// BlueprintGeneratedClass CineCoyle-01_BP.CineCoyle-01_BP_C
// Size: 0x2a8 (Inherited: 0x26c)
struct ACineCoyle-01_BP_C : ACineCharacterBase_BP_C {
	char pad_26C[0x4]; // 0x26c(0x04)
	struct URBSoundComponent* RBSound; // 0x270(0x08)
	struct USkeletalMeshComponent* Head; // 0x278(0x08)
	struct UNiagaraComponent* BatonElectric_Impact; // 0x280(0x08)
	struct UNiagaraComponent* BatonElectric; // 0x288(0x08)
	struct UPointLightComponent* BatonElectric_Light; // 0x290(0x08)
	struct UStaticMeshComponent* Weapon; // 0x298(0x08)
	struct USkeletalMeshComponent* Body; // 0x2a0(0x08)
};

