// AnimBlueprintGeneratedClass Futterman_Skeleton_AnimBlueprint.Futterman_Skeleton_AnimBlueprint_C
// Size: 0x317a (Inherited: 0x2c0)
struct UFutterman_Skeleton_AnimBlueprint_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8(0x1d8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x4d0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x5d8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x5f8(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x618(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x660(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x720(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x878(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x8a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x8c8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x8f0(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xa48(0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xaf0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xb18(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0xb40(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xc98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xcc0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xce8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xd68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xd98(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xe18(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xe48(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xef8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xf20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xf48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xf70(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xf98(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1018(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1048(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x10c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1178(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x11a8(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1258(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x1310(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x1468(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x15c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x15e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1610(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x1638(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1660(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x1688(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x16a8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x17b0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x18b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x19c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x1ac8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1bd0(0x108)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_3; // 0x1cd8(0x18)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1cf0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1d10(0x158)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x1e68(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1e88(0x158)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_2; // 0x1fe0(0x18)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1ff8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2018(0x20)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x2038(0x18)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2050(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x2070(0x158)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x21c8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x22d0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x23d8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x24e0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2500(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2608(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2710(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2730(0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x27d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x2800(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x2828(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x2850(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x2910(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x2a68(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x2a90(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2ab8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2ae0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2b08(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2bc8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2d20(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x2e78(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2ea0(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2ec8(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2f90(0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3038(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3060(0xc0)
	struct USkeletalMeshComponent* Mesh; // 0x3120(0x08)
	int32_t RightHand; // 0x3128(0x04)
	float jawOpen; // 0x312c(0x04)
	struct FRotator BowTieRotation; // 0x3130(0x0c)
	char pad_313C[0x4]; // 0x313c(0x04)
	struct UCurveFloat* Curve; // 0x3140(0x08)
	struct UgooseberryFace_AnimBP_C* Gooseberry Face Player; // 0x3148(0x08)
	bool Futterman Speaking; // 0x3150(0x01)
	enum class ENPCAnimStyle AnimStyle; // 0x3151(0x01)
	bool IsIdleBreaker; // 0x3152(0x01)
	char pad_3153[0x5]; // 0x3153(0x05)
	struct Ugooseberry_AnimBP_C* Gooseberry Anim BP; // 0x3158(0x08)
	float TimeToPlayNextIdleBreaker; // 0x3160(0x04)
	bool IsDrilling; // 0x3164(0x01)
	char pad_3165[0x3]; // 0x3165(0x03)
	struct FRotator DrillRotating; // 0x3168(0x0c)
	float DrillRotationRate; // 0x3174(0x04)
	bool IsMoving; // 0x3178(0x01)
	bool ManualDrill; // 0x3179(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Futterman_Skeleton_AnimBlueprint.Futterman_Skeleton_AnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Futterman_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_26BB82544BD8A0B1178B39B3B137D995(); // Function Futterman_Skeleton_AnimBlueprint.Futterman_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Futterman_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_26BB82544BD8A0B1178B39B3B137D995 // (BlueprintEvent) // @ game+0x201e6d4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Futterman_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A32E9B3C46B87B94F62B2186312FFD65(); // Function Futterman_Skeleton_AnimBlueprint.Futterman_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Futterman_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_A32E9B3C46B87B94F62B2186312FFD65 // (BlueprintEvent) // @ game+0x201e6d4
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Futterman_Skeleton_AnimBlueprint.Futterman_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void AnimNotify_BreakerReset(); // Function Futterman_Skeleton_AnimBlueprint.Futterman_Skeleton_AnimBlueprint_C.AnimNotify_BreakerReset // (BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void PlayIdleBreaker(); // Function Futterman_Skeleton_AnimBlueprint.Futterman_Skeleton_AnimBlueprint_C.PlayIdleBreaker // (BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ExecuteUbergraph_Futterman_Skeleton_AnimBlueprint(int32_t EntryPoint); // Function Futterman_Skeleton_AnimBlueprint.Futterman_Skeleton_AnimBlueprint_C.ExecuteUbergraph_Futterman_Skeleton_AnimBlueprint // (Final|UbergraphFunction|HasDefaults) // @ game+0x201e6d4
};

