// Class OPP.AlignedWrapBox
// Size: 0x140 (Inherited: 0x120)
struct UAlignedWrapBox : UPanelWidget {
	struct FVector2D InnerSlotPadding; // 0x120(0x08)
	float WrapWidth; // 0x128(0x04)
	bool bExplicitWrapWidth; // 0x12c(0x01)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x12d(0x01)
	char pad_12E[0x12]; // 0x12e(0x12)

	void SetInnerSlotPadding(struct FVector2D InPadding); // Function OPP.AlignedWrapBox.SetInnerSlotPadding // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1ce51b0
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function OPP.AlignedWrapBox.SetHorizontalAlignment // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce50b0
	struct UAlignedWrapBoxSlot* AddChildWrapBox(struct UWidget* Content); // Function OPP.AlignedWrapBox.AddChildWrapBox // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce4e30
};

// Class OPP.AlignedWrapBoxSlot
// Size: 0x60 (Inherited: 0x38)
struct UAlignedWrapBoxSlot : UPanelSlot {
	struct FMargin Padding; // 0x38(0x10)
	bool bFillEmptySpace; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float FillSpanWhenLessThan; // 0x4c(0x04)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x50(0x01)
	enum class EVerticalAlignment VerticalAlignment; // 0x51(0x01)
	char pad_52[0xe]; // 0x52(0x0e)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function OPP.AlignedWrapBoxSlot.SetVerticalAlignment // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce52ec
	void SetPadding(struct FMargin InPadding); // Function OPP.AlignedWrapBoxSlot.SetPadding // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce5260
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function OPP.AlignedWrapBoxSlot.SetHorizontalAlignment // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce5134
	void SetFillSpanWhenLessThan(float InFillSpanWhenLessThan); // Function OPP.AlignedWrapBoxSlot.SetFillSpanWhenLessThan // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce502c
	void SetFillEmptySpace(bool InbFillEmptySpace); // Function OPP.AlignedWrapBoxSlot.SetFillEmptySpace // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce4fac
};

// Class OPP.OPPEngine
// Size: 0xdf0 (Inherited: 0xde0)
struct UOPPEngine : UGameEngine {
	struct URBFunctionalTestManager* FunctionalTestManager; // 0xde0(0x08)
	char pad_DE8[0x8]; // 0xde8(0x08)
};

// Class OPP.RBAchievementManager
// Size: 0x3a0 (Inherited: 0x28)
struct URBAchievementManager : UObject {
	char pad_28[0x30]; // 0x28(0x30)
	struct TArray<struct ARBController*> RegisteredControllers; // 0x58(0x10)
	struct TMap<struct FProfileId, struct FPlayerAchievementsRuntimeData> RuntimeData; // 0x68(0x50)
	char pad_B8[0x2e8]; // 0xb8(0x2e8)
};

// Class OPP.RBAchievementDefinition
// Size: 0x70 (Inherited: 0x28)
struct URBAchievementDefinition : UObject {
	struct FName OnlineUnlockId; // 0x28(0x08)
	struct FText Name; // 0x30(0x18)
	struct FText Description; // 0x48(0x18)
	struct URBAchievementUnlockCondition* UnlockCondition; // 0x60(0x08)
	struct FName RewardDataId; // 0x68(0x08)
};

// Class OPP.RBAchievementsConfig
// Size: 0x38 (Inherited: 0x28)
struct URBAchievementsConfig : UObject {
	struct TArray<struct URBAchievementDefinition*> Achievements; // 0x28(0x10)

	void RefreshAchievements(); // Function OPP.RBAchievementsConfig.RefreshAchievements // (Final|Native|Public) // @ game+0x1521dbc
};

// Class OPP.RBAchievementUnlockCondition
// Size: 0x48 (Inherited: 0x28)
struct URBAchievementUnlockCondition : UObject {
	struct URBAchievementDefinition* AssociatedAchievementDefinition; // 0x28(0x08)
	struct ARBPlayerState* RBPlayerState; // 0x30(0x08)
	char pad_38[0x10]; // 0x38(0x10)
};

// Class OPP.RBAchievementUnlockCondition_StageCompletion
// Size: 0xb0 (Inherited: 0x48)
struct URBAchievementUnlockCondition_StageCompletion : URBAchievementUnlockCondition {
	int32_t NumTimes; // 0x48(0x04)
	enum class EGameDifficulty MinDifficulty; // 0x4c(0x01)
	enum class EGameDifficulty MaxDifficulty; // 0x4d(0x01)
	bool bAnyMission; // 0x4e(0x01)
	char pad_4F[0x1]; // 0x4f(0x01)
	struct TArray<struct FRBMissionID> MissionIds; // 0x50(0x10)
	bool bAnyStage; // 0x60(0x01)
	char pad_61[0x7]; // 0x61(0x07)
	struct TArray<struct FRBStageID> StageIds; // 0x68(0x10)
	struct FRBPlayerLoadoutValidator PlayerLoadoutValidator; // 0x78(0x18)
	struct TArray<enum class EPlayerEvent> PlayerEventFailureConditions; // 0x90(0x10)
	int32_t MaxDamagePerStage; // 0xa0(0x04)
	char pad_A4[0xc]; // 0xa4(0x0c)

	void OnStageEnded(struct FRBStageID& StageID, struct FRBMissionID& MissionID, bool bIsReset); // Function OPP.RBAchievementUnlockCondition_StageCompletion.OnStageEnded // (Final|Native|Private|HasOutParms) // @ game+0x1ce8d9c
	void OnPlayerEvent(enum class EPlayerEvent EventType, int32_t Value); // Function OPP.RBAchievementUnlockCondition_StageCompletion.OnPlayerEvent // (Final|Native|Private) // @ game+0x1ce8cac
};

// Class OPP.RBActor
// Size: 0x250 (Inherited: 0x248)
struct ARBActor : AActor {
	bool bAllowAttachmentReplication; // 0x248(0x01)
	char pad_249[0x7]; // 0x249(0x07)
};

// Class OPP.RBActiveSkill
// Size: 0x3d8 (Inherited: 0x250)
struct ARBActiveSkill : ARBActor {
	struct UStaticMeshComponent* ActiveSkillMesh; // 0x250(0x08)
	enum class EActiveSkillType ActiveSkillType; // 0x258(0x01)
	char pad_259[0x7]; // 0x259(0x07)
	struct ARBActiveSkillController* ControllerItemClass; // 0x260(0x08)
	struct FText SkillStillRecharginText; // 0x268(0x18)
	struct FText NoSkillChargeForEquip; // 0x280(0x18)
	struct FMulticastInlineDelegate OnIsInCooldownChangedEvent; // 0x298(0x10)
	struct FMulticastInlineDelegate OnIsActiveChangedEvent; // 0x2a8(0x10)
	struct ARBPlayer* PlayerOwner; // 0x2b8(0x08)
	struct FRBActiveSkillSettings ActiveSkillSettings; // 0x2c0(0x2c)
	bool bIsActive; // 0x2ec(0x01)
	char pad_2ED[0x1]; // 0x2ed(0x01)
	bool bIsInCooldown; // 0x2ee(0x01)
	char pad_2EF[0x1]; // 0x2ef(0x01)
	float ActivationTimeRemaining; // 0x2f0(0x04)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	float CooldownPawnTime; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct FRBGameplayAttribute ActiveSkillCooldown; // 0x300(0x30)
	struct FRBGameplayAttribute ActiveSkillEffectRadius; // 0x330(0x30)
	struct FRBGameplayAttribute ActiveSkillEffectDuration; // 0x360(0x30)
	struct FRBGameplayAttribute ActiveSkillEffect2Duration; // 0x390(0x30)
	struct ARBActiveSkillController* ControllerItem; // 0x3c0(0x08)
	char pad_3C8[0x10]; // 0x3c8(0x10)

	void OnRep_IsInCooldown(); // Function OPP.RBActiveSkill.OnRep_IsInCooldown // (Final|Native|Public) // @ game+0x13b1f58
	void OnRep_IsActive(); // Function OPP.RBActiveSkill.OnRep_IsActive // (Final|Native|Public) // @ game+0x1ce8d70
	float GetCooldownTimeRemaining(); // Function OPP.RBActiveSkill.GetCooldownTimeRemaining // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8a18
	float GetCooldownRatio(); // Function OPP.RBActiveSkill.GetCooldownRatio // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce89f0
	void Event_OnPlayerInitReplicated(struct ARBPlayer* Player); // Function OPP.RBActiveSkill.Event_OnPlayerInitReplicated // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnIsInCooldownChanged(bool isInCooldown); // Function OPP.RBActiveSkill.Event_OnIsInCooldownChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnIsActiveChanged(bool IsActive); // Function OPP.RBActiveSkill.Event_OnIsActiveChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_DisplayDebugInfo(); // Function OPP.RBActiveSkill.Event_DisplayDebugInfo // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	bool BP_IsSkillUsageDisabled(); // Function OPP.RBActiveSkill.BP_IsSkillUsageDisabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce87fc
	float BP_GetTotalCooldownTime(); // Function OPP.RBActiveSkill.BP_GetTotalCooldownTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce87d0
	float BP_GetEffectDuration(); // Function OPP.RBActiveSkill.BP_GetEffectDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce87a4
	bool BP_CanUseSkillInLocation(); // Function OPP.RBActiveSkill.BP_CanUseSkillInLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce877c
};

// Class OPP.RBPickup
// Size: 0x9d0 (Inherited: 0x250)
struct ARBPickup : ARBActor {
	char pad_250[0x18]; // 0x250(0x18)
	struct URBInteractionZoneComponent* InteractionZoneBox; // 0x268(0x08)
	struct URBActiveSkillVisionComponent* ActiveSkillVisionComponent; // 0x270(0x08)
	struct UStaticMeshComponent* ActiveSkillWaveSphere; // 0x278(0x08)
	struct FItemDefinition ItemDefinition; // 0x280(0x48)
	struct UMeshComponent* InWorldMeshComponent; // 0x2c8(0x08)
	struct UMeshComponent* InHandMeshComponent; // 0x2d0(0x08)
	float WaterFloatingDepth; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
	struct USceneComponent* SpawnPointRef; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)
	struct FTransform SpawnPointRelativeInverseTransform; // 0x2f0(0x30)
	struct UItemAnimRef* AnimationData1P; // 0x320(0x08)
	struct UItemAnimRef* AnimationData1PDown; // 0x328(0x08)
	struct UItemAnimRef* AnimationData3P; // 0x330(0x08)
	float staminaRestoreAmount; // 0x338(0x04)
	float HealthRestoreAmount; // 0x33c(0x04)
	float TemporaryHealthRestoreAmount; // 0x340(0x04)
	float PsychosisRestoreAmount; // 0x344(0x04)
	float BatteryRestoreAmount; // 0x348(0x04)
	bool bResetActiveSkillCooldown; // 0x34c(0x01)
	char pad_34D[0x3]; // 0x34d(0x03)
	struct FRBConfigurableGameplayAttributeModifier AttributeModifier; // 0x350(0xd0)
	float noStaminaConsumptionDuration; // 0x420(0x04)
	float MovementSpeedBonusMultiplier; // 0x424(0x04)
	struct FHUDTutorialTextData PickupTutorialData; // 0x428(0x38)
	bool bOverrideTutorialDefaultDuration; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct FTutorialTextData EquippedTutorialData; // 0x468(0x20)
	bool bDisableHoldUseTutorial; // 0x488(0x01)
	bool bDisablesInputInTutorial; // 0x489(0x01)
	char pad_48A[0x6]; // 0x48a(0x06)
	struct FText CustomInteractionText; // 0x490(0x18)
	struct FText CannotUseTwiceCustomText; // 0x4a8(0x18)
	struct FText NoRoomInInventoryInteractionText; // 0x4c0(0x18)
	struct FString PickupSwitchName; // 0x4d8(0x10)
	struct URBOutlineComponent* OutlineComponent; // 0x4e8(0x08)
	struct FMulticastInlineDelegate PickedUpEvent; // 0x4f0(0x10)
	struct FMulticastInlineDelegate DroppedEvent; // 0x500(0x10)
	struct FMulticastInlineDelegate DuplicatedEvent; // 0x510(0x10)
	struct FMulticastInlineDelegate OnConsumedChanged; // 0x520(0x10)
	struct FMulticastInlineDelegate OnPlayerOwnerChanged; // 0x530(0x10)
	struct FMulticastInlineDelegate OnTossDone; // 0x540(0x10)
	struct UTexture2D* Icon; // 0x550(0x08)
	struct UTexture2D* HoldConsumeIcon; // 0x558(0x08)
	struct FText HoldConsumeText; // 0x560(0x18)
	struct FText DisplayName; // 0x578(0x18)
	bool bOverrideCategoryColor; // 0x590(0x01)
	char pad_591[0x3]; // 0x591(0x03)
	struct FLinearColor InventoryItemColor; // 0x594(0x10)
	bool bConsumeCameraLimit; // 0x5a4(0x01)
	char pad_5A5[0x3]; // 0x5a5(0x03)
	float ConsumeCameraMinYaw; // 0x5a8(0x04)
	float ConsumeCameraMaxYaw; // 0x5ac(0x04)
	float ConsumeCameraMinPitch; // 0x5b0(0x04)
	float ConsumeCameraMaxPitch; // 0x5b4(0x04)
	struct FString ServerName; // 0x5b8(0x10)
	struct FScheduledUObject PawnOwner; // 0x5c8(0x88)
	struct FScheduledInt OwnerInventorySlot; // 0x650(0x78)
	struct FScheduledBool IsConsumedScheduled; // 0x6c8(0x70)
	char pad_738[0x8]; // 0x738(0x08)
	struct FScheduledTransform PickupTransform; // 0x740(0x130)
	struct FScheduledBool ConsumeOutcomeProcessed; // 0x870(0x70)
	struct FScheduledBool bDoubleDoseUsedOnce; // 0x8e0(0x70)
	bool bIsInHand; // 0x950(0x01)
	bool bIsDuplicatedToPersistent; // 0x951(0x01)
	char pad_952[0x6]; // 0x952(0x06)
	struct ARBPawn* PickingUpPawn; // 0x958(0x08)
	struct ARBContainer* Container; // 0x960(0x08)
	char pad_968[0x8]; // 0x968(0x08)
	struct FTransform ContainerPickupTransform; // 0x970(0x30)
	bool bHasBeenPickedUp; // 0x9a0(0x01)
	char pad_9A1[0x7]; // 0x9a1(0x07)
	struct AActor* UsedOnActor; // 0x9a8(0x08)
	char pad_9B0[0x8]; // 0x9b0(0x08)
	struct ARBPawn* LastDroppedBy; // 0x9b8(0x08)
	char pad_9C0[0x10]; // 0x9c0(0x10)

	void OnRep_PickupTransform(); // Function OPP.RBPickup.OnRep_PickupTransform // (Final|Native|Protected) // @ game+0x1dc0034
	void OnRep_PawnOwner(); // Function OPP.RBPickup.OnRep_PawnOwner // (Native|Protected) // @ game+0x1dc001c
	void OnRep_OwnerInventorySlot(); // Function OPP.RBPickup.OnRep_OwnerInventorySlot // (Native|Protected) // @ game+0x1dbfff0
	void OnRep_IsDuplicatedToPersistent(); // Function OPP.RBPickup.OnRep_IsDuplicatedToPersistent // (Final|Native|Protected) // @ game+0x1dbffdc
	void OnRep_IsConsumed(); // Function OPP.RBPickup.OnRep_IsConsumed // (Final|Native|Protected) // @ game+0x1dbffc0
	void OnRep_HasBeenPickedUp(); // Function OPP.RBPickup.OnRep_HasBeenPickedUp // (Final|Native|Protected) // @ game+0x1d3a1b8
	void OnRep_DoubleDoseUsedOnce(); // Function OPP.RBPickup.OnRep_DoubleDoseUsedOnce // (Final|Native|Protected) // @ game+0x1dbffa4
	void OnRep_ContainerPickupTransform(); // Function OPP.RBPickup.OnRep_ContainerPickupTransform // (Final|Native|Protected) // @ game+0x1dbff90
	void OnRep_Container(); // Function OPP.RBPickup.OnRep_Container // (Final|Native|Protected) // @ game+0x1dbff7c
	void OnRep_ConsumeOutcomeProcessed(); // Function OPP.RBPickup.OnRep_ConsumeOutcomeProcessed // (Final|Native|Protected) // @ game+0x1dbff60
	void OnPickupTransformChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBPickup.OnPickupTransformChangedCallback // (Final|Native|Protected) // @ game+0x1dbfee0
	void OnPawnOwnerChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBPickup.OnPawnOwnerChangedCallback // (Native|Protected) // @ game+0x1dbfe5c
	void OnOwnerInventorySlotChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBPickup.OnOwnerInventorySlotChangedCallback // (Native|Protected) // @ game+0x1dbfdd8
	void OnIsConsumedChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBPickup.OnIsConsumedChangedCallback // (Native|Protected) // @ game+0x1dbfd54
	void OnDoubleDoseUsedOnceChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBPickup.OnDoubleDoseUsedOnceChangedCallback // (Native|Protected) // @ game+0x1dbfcd0
	void OnConsumeItemStartNotify(struct ARBPawn* Pawn); // Function OPP.RBPickup.OnConsumeItemStartNotify // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void OnConsumeItemNotify(struct ARBPawn* Pawn); // Function OPP.RBPickup.OnConsumeItemNotify // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void OnConsumeItemCancelledNotify(struct ARBPawn* Pawn); // Function OPP.RBPickup.OnConsumeItemCancelledNotify // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Multicast_OnDropped(struct ARBPawn* Pawn, struct FTransform Transform, bool bPredicted); // Function OPP.RBPickup.Multicast_OnDropped // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1dbfb8c
	bool IsItemHeldInHand(); // Function OPP.RBPickup.IsItemHeldInHand // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dbec70
	bool IsConsumed(); // Function OPP.RBPickup.IsConsumed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dbec58
	struct ARBPawn* GetPawnOwner(); // Function OPP.RBPickup.GetPawnOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dbec34
	struct UMeshComponent* GetDisplayMesh(); // Function OPP.RBPickup.GetDisplayMesh // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1cfe9b8
	struct ARBContainer* GetContainer(); // Function OPP.RBPickup.GetContainer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dbec1c
	void Event_SnapToState(); // Function OPP.RBPickup.Event_SnapToState // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnUpdateVisibility(bool bShouldBeHidden); // Function OPP.RBPickup.Event_OnUpdateVisibility // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnPickedUp(struct ARBPawn* Pawn); // Function OPP.RBPickup.Event_OnPickedUp // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnItemHeldInHandChanged(bool bHeldInHand); // Function OPP.RBPickup.Event_OnItemHeldInHandChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnContainerChanged(); // Function OPP.RBPickup.Event_OnContainerChanged // (Event|Protected|BlueprintEvent) // @ game+0x201e6d4
	bool CanSwapBetweenItem(struct ARBPickup* otherItem); // Function OPP.RBPickup.CanSwapBetweenItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dbe9b0
	void BP_UpdateDisplayMesh(); // Function OPP.RBPickup.BP_UpdateDisplayMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x1d3a1b8
	bool BP_TickItem(float DeltaTime); // Function OPP.RBPickup.BP_TickItem // (Native|Event|Public|BlueprintEvent) // @ game+0x1d9db18
	void BP_SetIsInteractible(bool interactible); // Function OPP.RBPickup.BP_SetIsInteractible // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1dbe930
	struct ARBPlayer* BP_GetPlayerOwner(); // Function OPP.RBPickup.BP_GetPlayerOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dbe858
};

// Class OPP.RBActiveSkillController
// Size: 0x9e0 (Inherited: 0x9d0)
struct ARBActiveSkillController : ARBPickup {
	struct USkeletalMeshComponent* SkeletalDisplayMesh; // 0x9d0(0x08)
	struct ARBActiveSkill* ActiveSkillControlled; // 0x9d8(0x08)

	bool IsSkillActive(); // Function OPP.RBActiveSkillController.IsSkillActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8b70
	void Event_OnSkillActiveChanged(bool IsActive); // Function OPP.RBActiveSkillController.Event_OnSkillActiveChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBActiveSkillVisionComponent
// Size: 0x240 (Inherited: 0x220)
struct URBActiveSkillVisionComponent : USceneComponent {
	bool bOverrideMeshMaterials; // 0x218(0x01)
	bool bShowHaloWhenVisionActive; // 0x219(0x01)
	enum class EIntelType IntelType; // 0x21a(0x01)
	struct FMulticastInlineDelegate OnActiveSkillVisionChangedCallback; // 0x220(0x10)
	struct FMulticastInlineDelegate OnSeeThroughWallChangedCallback; // 0x230(0x10)

	void Event_OnSeeThroughWallChanged(bool Enabled); // Function OPP.RBActiveSkillVisionComponent.Event_OnSeeThroughWallChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnActiveSkillChanged(bool Enabled); // Function OPP.RBActiveSkillVisionComponent.Event_OnActiveSkillChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBUserWidget
// Size: 0x268 (Inherited: 0x260)
struct URBUserWidget : UUserWidget {
	struct UGameViewportClient* SpecificViewport; // 0x260(0x08)

	void RemoveFromGameViewport(); // Function OPP.RBUserWidget.RemoveFromGameViewport // (Final|Native|Public|BlueprintCallable) // @ game+0x1e314d4
	void Event_InputSourceChanged(bool bIsGamepad); // Function OPP.RBUserWidget.Event_InputSourceChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	struct TArray<struct FText> BP_SplitMessageToMultipleLines(struct FText& Message); // Function OPP.RBUserWidget.BP_SplitMessageToMultipleLines // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1e30a98
	bool BP_IsUsingGamepad(); // Function OPP.RBUserWidget.BP_IsUsingGamepad // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1e309f4
	void AddToGameViewport(int32_t ZOrder); // Function OPP.RBUserWidget.AddToGameViewport // (Final|Native|Public|BlueprintCallable) // @ game+0x1e30918
};

// Class OPP.RBTaskMenuWidgetBase
// Size: 0x278 (Inherited: 0x268)
struct URBTaskMenuWidgetBase : URBUserWidget {
	struct ARBTaskManager* TaskManager; // 0x268(0x08)
	enum class ETaskType TaskType; // 0x270(0x01)
	char pad_271[0x7]; // 0x271(0x07)

	void Event_Refresh(); // Function OPP.RBTaskMenuWidgetBase.Event_Refresh // (Event|Protected|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBActiveTaskListWidget
// Size: 0x288 (Inherited: 0x278)
struct URBActiveTaskListWidget : URBTaskMenuWidgetBase {
	struct TArray<struct ARBTask*> ActiveTasks; // 0x278(0x10)
};

// Class OPP.RBActorGroup
// Size: 0x2a8 (Inherited: 0x248)
struct ARBActorGroup : AActor {
	char pad_248[0x18]; // 0x248(0x18)
	struct USceneComponent* ActorGroupRootComponent; // 0x260(0x08)
	struct TArray<struct AActor*> ActorClasses; // 0x268(0x10)
	struct TArray<struct FName> PossibleTags; // 0x278(0x10)
	struct TArray<struct TSoftObjectPtr<AActor>> ActorsRefs; // 0x288(0x10)
	struct TArray<struct AActor*> Actors; // 0x298(0x10)

	void SelectLinkedActors(); // Function OPP.RBActorGroup.SelectLinkedActors // (Final|Native|Public) // @ game+0x1521dbc
	struct TArray<struct AActor*> GetActors(); // Function OPP.RBActorGroup.GetActors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce89d4
	void CenterOnLinkedActors(); // Function OPP.RBActorGroup.CenterOnLinkedActors // (Final|Native|Public) // @ game+0x1ce88ec
	void AddSelectedActors(); // Function OPP.RBActorGroup.AddSelectedActors // (Final|Native|Public) // @ game+0x1521dbc
};

// Class OPP.RBActorPrevisComponent
// Size: 0x290 (Inherited: 0x270)
struct URBActorPrevisComponent : UChildActorComponent {
	bool bPrevisEnabled; // 0x268(0x01)
	bool bOnlyPrevisWhenSelected; // 0x269(0x01)
	bool bAutoSpawnOnBeginPlay; // 0x26a(0x01)
	struct AActor* runtimeChildActor; // 0x270(0x08)
	struct FMulticastInlineDelegate OnActorPrevisRuntimeChildActorChanged; // 0x278(0x10)
	char pad_28B[0x5]; // 0x28b(0x05)

	void OnRep_RuntimeChildActor(); // Function OPP.RBActorPrevisComponent.OnRep_RuntimeChildActor // (Final|Native|Public) // @ game+0x1ce8d88
	void BP_SpawnRuntimeChildActor(); // Function OPP.RBActorPrevisComponent.BP_SpawnRuntimeChildActor // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1ce8824
	void BP_ForceUpdateVisibility(); // Function OPP.RBActorPrevisComponent.BP_ForceUpdateVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x1521dbc
};

// Class OPP.RBActorProximityDetectionComponent
// Size: 0x140 (Inherited: 0xb8)
struct URBActorProximityDetectionComponent : UActorComponent {
	char pad_B8[0x8]; // 0xb8(0x08)
	struct TArray<struct AActor*> ActorClasses; // 0xc0(0x10)
	struct TArray<struct FName> PossibleTags; // 0xd0(0x10)
	struct TArray<struct TSoftObjectPtr<AActor>> ActorsRefs; // 0xe0(0x10)
	float ProximityDistance; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct FMulticastInlineDelegate OnActorEnterProximity; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnActorExitProximity; // 0x108(0x10)
	bool bEnableOnServer; // 0x118(0x01)
	char pad_119[0x7]; // 0x119(0x07)
	struct TArray<struct AActor*> CheckedActors; // 0x120(0x10)
	struct TArray<struct AActor*> ActorsInProximity; // 0x130(0x10)

	void OnPawnUnregistered(struct ARBPawn* RBPawn); // Function OPP.RBActorProximityDetectionComponent.OnPawnUnregistered // (Final|Native|Private) // @ game+0x1ce8c2c
	void OnPawnRegistered(struct ARBPawn* RBPawn); // Function OPP.RBActorProximityDetectionComponent.OnPawnRegistered // (Final|Native|Private) // @ game+0x1ce8bac
	void Event_OnActorExitProximity(struct AActor* Actor); // Function OPP.RBActorProximityDetectionComponent.Event_OnActorExitProximity // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnActorEnterProximity(struct AActor* Actor); // Function OPP.RBActorProximityDetectionComponent.Event_OnActorEnterProximity // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void ActorProximityDetectionComponentEvent__DelegateSignature(struct AActor* Actor); // DelegateFunction OPP.RBActorProximityDetectionComponent.ActorProximityDetectionComponentEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x201e6d4
};

// Class OPP.RBAddFriendWidget
// Size: 0x2e0 (Inherited: 0x268)
struct URBAddFriendWidget : URBUserWidget {
	char pad_268[0x78]; // 0x268(0x78)

	void ShowProfile(); // Function OPP.RBAddFriendWidget.ShowProfile // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce90c0
	void SendPlatformFriendRequest(); // Function OPP.RBAddFriendWidget.SendPlatformFriendRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce9038
	void SendFriendRequest(); // Function OPP.RBAddFriendWidget.SendFriendRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce8fc0
	void ResolveProfile(struct FString friendCode); // Function OPP.RBAddFriendWidget.ResolveProfile // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce8ee4
	bool IsOperationPending(); // Function OPP.RBAddFriendWidget.IsOperationPending // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8b44
	bool IsInitialDataPending(); // Function OPP.RBAddFriendWidget.IsInitialDataPending // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8b18
	void Init(); // Function OPP.RBAddFriendWidget.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x1ce8b04
	bool HasProfile(); // Function OPP.RBAddFriendWidget.HasProfile // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8ae8
	enum class EProfilePlatform GetProfilePlatform(); // Function OPP.RBAddFriendWidget.GetProfilePlatform // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8ac0
	struct FString GetName(); // Function OPP.RBAddFriendWidget.GetName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8a5c
	struct FString GetFriendCode(); // Function OPP.RBAddFriendWidget.GetFriendCode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8a40
	struct FString FilterFriendCodeInputText(struct FString inputText); // Function OPP.RBAddFriendWidget.FilterFriendCodeInputText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce892c
	void Event_ResolveCompleted(); // Function OPP.RBAddFriendWidget.Event_ResolveCompleted // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_Refresh(); // Function OPP.RBAddFriendWidget.Event_Refresh // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnError(); // Function OPP.RBAddFriendWidget.Event_OnError // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_Init(); // Function OPP.RBAddFriendWidget.Event_Init // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_Done(); // Function OPP.RBAddFriendWidget.Event_Done // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void CopyFriendCode(); // Function OPP.RBAddFriendWidget.CopyFriendCode // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1ce8900
	bool CanShowProfile(); // Function OPP.RBAddFriendWidget.CanShowProfile // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8880
	bool CanSendPlatformFriendRequest(); // Function OPP.RBAddFriendWidget.CanSendPlatformFriendRequest // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce885c
	bool CanSendFriendRequest(); // Function OPP.RBAddFriendWidget.CanSendFriendRequest // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1ce8838
};

// Class OPP.RBAIActivity
// Size: 0x48 (Inherited: 0x28)
struct URBAIActivity : UObject {
	struct ARBBot* bot; // 0x28(0x08)
	struct ARBNPC* NPC; // 0x30(0x08)
	struct URBAIPlayerManager* PlayerMgr; // 0x38(0x08)
	char pad_40[0x8]; // 0x40(0x08)
};

// Class OPP.RBAIActivityChase
// Size: 0xe0 (Inherited: 0x48)
struct URBAIActivityChase : URBAIActivity {
	struct ARBPlayer* TargetPlayer; // 0x48(0x08)
	char pad_50[0x30]; // 0x50(0x30)
	struct URBAreaExitPoint* PathBlockingExitPoint; // 0x80(0x08)
	char pad_88[0x10]; // 0x88(0x10)
	struct ARBNPC* YieldingToNPC; // 0x98(0x08)
	char pad_A0[0x8]; // 0xa0(0x08)
	float SprintSpeedGain; // 0xa8(0x04)
	char pad_AC[0x24]; // 0xac(0x24)
	struct ARBPlayer* LastActivelyChasedPlayer; // 0xd0(0x08)
	char pad_D8[0x8]; // 0xd8(0x08)
};

// Class OPP.RBAIActivityInvestigate
// Size: 0x258 (Inherited: 0x48)
struct URBAIActivityInvestigate : URBAIActivity {
	struct ARBPlayer* TargetPlayer; // 0x48(0x08)
	struct AActor* InitialInvestigationActor; // 0x50(0x08)
	struct TArray<struct FInvestigationPoint> InvestigationPoints; // 0x58(0x10)
	char pad_68[0x14]; // 0x68(0x14)
	int32_t NbPointsToCheck; // 0x7c(0x04)
	int32_t NbPointsChecked; // 0x80(0x04)
	bool bInvestigatingDisturbance; // 0x84(0x01)
	char pad_85[0x13]; // 0x85(0x13)
	bool bAtInvestigationPoint; // 0x98(0x01)
	char pad_99[0x27]; // 0x99(0x27)
	struct FInvestigationPoint CurrentInvestigationPoint; // 0xc0(0xc0)
	struct FNPCInvestigationSelectedAnimData PreselectedAnimData; // 0x180(0x30)
	bool bDynamicLookActive; // 0x1b0(0x01)
	bool bDynamicLookExplicit; // 0x1b1(0x01)
	char pad_1B2[0x2]; // 0x1b2(0x02)
	float DynamicLookStartedTime; // 0x1b4(0x04)
	char pad_1B8[0x10]; // 0x1b8(0x10)
	struct TArray<struct FInvestigationInterestPointData> InterestPoints; // 0x1c8(0x10)
	char pad_1D8[0x8]; // 0x1d8(0x08)
	struct TArray<struct URBInvestigationComponent*> InvestigatedPoints; // 0x1e0(0x10)
	char pad_1F0[0x68]; // 0x1f0(0x68)
};

// Class OPP.RBAIAwarenessState
// Size: 0x38 (Inherited: 0x28)
struct URBAIAwarenessState : UObject {
	enum class EAIAwarenessStateType Type; // 0x28(0x01)
	enum class EAIAwarenessStateType PreviousState; // 0x29(0x01)
	char pad_2A[0x2]; // 0x2a(0x02)
	float StartedTimestamp; // 0x2c(0x04)
	struct URBAIPlayerManager* ManagerOwner; // 0x30(0x08)
};

// Class OPP.RBAIAmbientAwarenessState
// Size: 0x68 (Inherited: 0x38)
struct URBAIAmbientAwarenessState : URBAIAwarenessState {
	enum class EAmbientAwarenessPhase Phase; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float StationStartTimestamp; // 0x3c(0x04)
	struct FAIStimulusInfo HighestPriorityStimulus; // 0x40(0x20)
	struct URBAmbientStationComponent* CurrentAmbientStation; // 0x60(0x08)
};

// Class OPP.RBAIScriptedState
// Size: 0x38 (Inherited: 0x38)
struct URBAIScriptedState : URBAIAwarenessState {
};

// Class OPP.RBAIUnawareState
// Size: 0x68 (Inherited: 0x38)
struct URBAIUnawareState : URBAIAwarenessState {
	float AwarenessMeter; // 0x38(0x04)
	float LastMeterIncreaseTimestamp; // 0x3c(0x04)
	bool bHasPlayedIncreaseVO; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FAIStimulusInfo HighestPriorityStimulus; // 0x48(0x20)
};

// Class OPP.RBAISuspiciousState
// Size: 0x78 (Inherited: 0x38)
struct URBAISuspiciousState : URBAIAwarenessState {
	float AwarenessMeter; // 0x38(0x04)
	float LastMeterIncreaseTimestamp; // 0x3c(0x04)
	float LastInvestigationTimestamp; // 0x40(0x04)
	float LastSourceInvestigationStartedTimestamp; // 0x44(0x04)
	bool bWaitingForStartle; // 0x48(0x01)
	bool bNeedStartle; // 0x49(0x01)
	bool bWaitingForValidState; // 0x4a(0x01)
	char pad_4B[0x5]; // 0x4b(0x05)
	struct FAIStimulusInfo TriggeringStimulus; // 0x50(0x20)
	char pad_70[0x8]; // 0x70(0x08)
};

// Class OPP.RBAIAlertedState
// Size: 0x70 (Inherited: 0x38)
struct URBAIAlertedState : URBAIAwarenessState {
	float ProgressiveAwarenessMeter; // 0x38(0x04)
	float LastInvestigationTimestamp; // 0x3c(0x04)
	float LastSourceInvestigationStartedTimestamp; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FAIStimulusInfo InvestigationStimulus; // 0x48(0x20)
	char pad_68[0x8]; // 0x68(0x08)
};

// Class OPP.RBAIBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct URBAIBlueprintLibrary : UBlueprintFunctionLibrary {

	void ZoneDefense(struct ARBBot* bot, struct TArray<struct AActor*>& zonePatrolPoints, struct AActor* fallbackLocation, struct ARBZoneDefenseMarker* defensiveSpline, struct FRBAIConditionSet& ExitConditions, bool bCanAttack); // Function OPP.RBAIBlueprintLibrary.ZoneDefense // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf1bb4
	void WakeUp(struct ARBBot* bot, bool bScream); // Function OPP.RBAIBlueprintLibrary.WakeUp // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cf1b00
	void WaitForAIConditions(struct ARBBot* bot, struct FLatentActionInfo LatentInfo, struct FRBAIConditionSet& conditionSet); // Function OPP.RBAIBlueprintLibrary.WaitForAIConditions // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf19c8
	void TryPlayAttackType(struct ARBBot* bot, enum class EAttackType AttackType, float MovementSpeed, struct AActor* TargetActor); // Function OPP.RBAIBlueprintLibrary.TryPlayAttackType // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cf188c
	void TriggerStimulusFromPlayer(enum class ETriggeringStimulusType StimulusType, struct ARBPlayer* Player); // Function OPP.RBAIBlueprintLibrary.TriggerStimulusFromPlayer // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cf17d8
	void TriggerStimulus(enum class ETriggeringStimulusType StimulusType, struct FVector& Location, struct AActor* SourceActor); // Function OPP.RBAIBlueprintLibrary.TriggerStimulus // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1cf16a4
	void TriggerDoubleSidedStimulusFromPlayer(enum class ETriggeringStimulusType StimulusType, struct ARBPlayer* Player, struct FVector& baseLocation, struct FVector& offsetWS); // Function OPP.RBAIBlueprintLibrary.TriggerDoubleSidedStimulusFromPlayer // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1cf1550
	void TriggerDoubleSidedStimulus(enum class ETriggeringStimulusType StimulusType, struct AActor* SourceActor, struct FVector& baseLocation, struct FVector& offsetWS); // Function OPP.RBAIBlueprintLibrary.TriggerDoubleSidedStimulus // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1cf13e4
	void TriggerCustomHighPriorityStimulusFromPlayer(struct ARBPlayer* Player, float fullLoudnessRange, float MaxHearingDistance); // Function OPP.RBAIBlueprintLibrary.TriggerCustomHighPriorityStimulusFromPlayer // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cf12e8
	void TriggerCustomHighPriorityStimulus(struct FVector& NoiseLocation, struct AActor* Source, float fullLoudnessRange, float maxBotDistance); // Function OPP.RBAIBlueprintLibrary.TriggerCustomHighPriorityStimulus // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1cf11ac
	void TestAIConditions(struct ARBBot* bot, enum class EAIBoolCommandResult& operationResult, struct FRBAIConditionSet& conditionSet); // Function OPP.RBAIBlueprintLibrary.TestAIConditions // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf1090
	void SummonNPC(enum class ENPCType NPCType, enum class ESpecialBotInitialBehavior initialBehavior, enum class EMonsterClosetSelectionMode closetSelectionMethod, struct ARBPlayer* TargetPlayer, struct ARBMonsterCloset* specificMonsterCloset, float MinBotLifetime, struct ARBBot*& spawnedBot, struct ARBNPC*& spawnedPawn); // Function OPP.RBAIBlueprintLibrary.SummonNPC // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf0e30
	void StartPatrolInvestigateVolumeGroup(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct TArray<struct TSoftObjectPtr<ARBVolumeGroup>>& RestrictedVolumeGroups, bool bSetLeashWithVolumes); // Function OPP.RBAIBlueprintLibrary.StartPatrolInvestigateVolumeGroup // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf0c60
	void StartPatrolInvestigateSoft(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct TArray<struct TSoftObjectPtr<AVolume>>& RestrictedVolumes, bool bSetLeashWithVolumes); // Function OPP.RBAIBlueprintLibrary.StartPatrolInvestigateSoft // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf0a90
	void StartPatrolInvestigate(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct TArray<struct AVolume*>& RestrictedVolumes, bool bSetLeashWithVolumes); // Function OPP.RBAIBlueprintLibrary.StartPatrolInvestigate // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf0898
	void StartPatrol(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct TArray<struct ARBWaypoint*>& WaypointList, enum class EPatrolWaypointSelectionMode Mode, float overrideSpeed, bool bForced); // Function OPP.RBAIBlueprintLibrary.StartPatrol // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf0630
	void SpawnPouncers(struct TArray<struct AVolume*>& allowedVolumes, struct FLatentActionInfo LatentInfo, int32_t minPouncers, int32_t maxPouncers, struct URBAIConfig* configOverride); // Function OPP.RBAIBlueprintLibrary.SpawnPouncers // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf0474
	void SpawnPouncer(struct AActor* hidespot, struct URBAIConfig* configOverride, struct ARBBot*& spawnedBot, struct ARBNPC*& spawnedPawn, struct FLatentActionInfo LatentInfo); // Function OPP.RBAIBlueprintLibrary.SpawnPouncer // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cf01cc
	void SpawnAISync(struct ARBNPC* PawnClass, struct URBAIConfig* configAsset, struct FAIConfigData ConfigOverrides, struct TArray<struct URBPartialAIConfig*>& AdditionalConfigs, struct URBVOMapping* VOMappingOverride, struct AActor* spawnPoint, struct ARBBot*& spawnedBot, struct ARBNPC*& spawnedPawn); // Function OPP.RBAIBlueprintLibrary.SpawnAISync // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cefeec
	void SpawnAI(struct ARBNPC* PawnClass, struct URBAIConfig* configAsset, struct FAIConfigData ConfigOverrides, struct TArray<struct URBPartialAIConfig*>& AdditionalConfigs, struct URBVOMapping* VOMappingOverride, struct AActor* spawnPoint, struct ARBBot*& spawnedBot, struct ARBNPC*& spawnedPawn, struct FLatentActionInfo LatentInfo); // Function OPP.RBAIBlueprintLibrary.SpawnAI // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cefba0
	void SetVOMapOverrides(struct ARBBot* bot, struct URBVOMappingOverride* voOverrides); // Function OPP.RBAIBlueprintLibrary.SetVOMapOverrides // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cef980
	void SetupAmbush(struct ARBBot* bot, struct URBHidespotComponent* hidespot, bool bImmediate); // Function OPP.RBAIBlueprintLibrary.SetupAmbush // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cefaa4
	void SetupAIDirectorForOpenedSections(struct URBAIDirectorConfig* directorConfig); // Function OPP.RBAIBlueprintLibrary.SetupAIDirectorForOpenedSections // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cefa34
	void SetupAIDirector(struct URBAIDirectorConfig* directorConfig); // Function OPP.RBAIBlueprintLibrary.SetupAIDirector // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cefa34
	void SetSpecificTarget(struct ARBBot* bot, struct ARBPlayer* TargetPlayer); // Function OPP.RBAIBlueprintLibrary.SetSpecificTarget // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cef8cc
	void SetSnipingSplines(struct ARBBot* bot, struct TArray<struct ARBSplineActor*>& splineMarkers); // Function OPP.RBAIBlueprintLibrary.SetSnipingSplines // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cef7fc
	void SetLeashes(struct ARBBot* bot, struct TArray<struct ARBLeashMarker*>& leashMarkers); // Function OPP.RBAIBlueprintLibrary.SetLeashes // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cef72c
	void SetLeashByVolumesSoft(struct ARBBot* bot, struct TArray<struct TSoftObjectPtr<AVolume>>& RestrictedVolumes); // Function OPP.RBAIBlueprintLibrary.SetLeashByVolumesSoft // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cef660
	void SetLeashByVolumes(struct ARBBot* bot, struct TArray<struct AVolume*>& RestrictedVolumes); // Function OPP.RBAIBlueprintLibrary.SetLeashByVolumes // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cef590
	void SetLeashByVolumeGroups(struct ARBBot* bot, struct TArray<struct TSoftObjectPtr<ARBVolumeGroup>>& RestrictedVolumeGroups); // Function OPP.RBAIBlueprintLibrary.SetLeashByVolumeGroups // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cef4c4
	void SetLeash(struct ARBBot* bot, struct ARBLeashMarker* leashMarker); // Function OPP.RBAIBlueprintLibrary.SetLeash // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cef410
	void SetGuard(struct ARBBot* bot, struct AActor* guardAnchor, struct FRBAIConditionSet& ExitConditions, bool bCanAttack, float lateralBlockingDistance); // Function OPP.RBAIBlueprintLibrary.SetGuard // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cef278
	void SetFixedAnimPose(struct ARBBot* bot, struct UAnimSequence* AnimToPlay, float animTime); // Function OPP.RBAIBlueprintLibrary.SetFixedAnimPose // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cef178
	void SetConditionalAIConfig(struct ARBBot* bot, struct FRBAIConditionSet& conditionSet, struct FAIConfigData ConfigOverrides, bool bStayActivated); // Function OPP.RBAIBlueprintLibrary.SetConditionalAIConfig // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ceefc4
	void SetAvailableAmbientActivityMarkers(struct ARBBot* bot, struct TArray<struct ARBAmbientActivityMarker*>& ambientMarkers); // Function OPP.RBAIBlueprintLibrary.SetAvailableAmbientActivityMarkers // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ceeef4
	void SetAIConfig(struct ARBBot* bot, struct URBAIConfig* configAsset, struct TArray<struct URBPartialAIConfig*>& AdditionalConfigs, struct FAIConfigData ConfigOverrides, bool bSetAsDefault, bool bResetAwarenessState); // Function OPP.RBAIBlueprintLibrary.SetAIConfig // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ceecb0
	void SeekRetirement(struct ARBBot* bot, bool bPriorityOverActiveBehaviors); // Function OPP.RBAIBlueprintLibrary.SeekRetirement // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceebfc
	void RetirePouncersInVolumes(struct TArray<struct AVolume*>& allowedVolumes); // Function OPP.RBAIBlueprintLibrary.RetirePouncersInVolumes // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ceeb74
	void ResetAIConfig(struct ARBBot* bot); // Function OPP.RBAIBlueprintLibrary.ResetAIConfig // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceeb04
	void RequestPatrol(struct ARBBot* bot, struct TArray<struct ARBWaypoint*>& WaypointList, enum class EPatrolWaypointSelectionMode Mode, float overrideSpeed, bool bForced); // Function OPP.RBAIBlueprintLibrary.RequestPatrol // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cee968
	void RequestInvestigatePoints(struct ARBBot* bot, struct TArray<struct AActor*>& pointList, enum class EInvestigationPointSelectionMode SelectionMode, bool bAware, bool bContinueInvestigatingWhenDone, int32_t maxNumberOfPoints, bool bOnlySpecifiedPoints); // Function OPP.RBAIBlueprintLibrary.RequestInvestigatePoints // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cee760
	void RequestInvestigatePoint(struct ARBBot* bot, struct AActor* InvestigationPoint, bool bAware, bool bContinueInvestigatingWhenDone); // Function OPP.RBAIBlueprintLibrary.RequestInvestigatePoint // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cee628
	void RequestInvestigateLocation(struct ARBBot* bot, struct FVector& investigationLoc, bool bAware, bool bContinueInvestigatingWhenDone); // Function OPP.RBAIBlueprintLibrary.RequestInvestigateLocation // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1cee4c0
	void RequestInvestigate(struct ARBBot* bot, bool bAware); // Function OPP.RBAIBlueprintLibrary.RequestInvestigate // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cee3dc
	void RequestGotoAmbientMarker(struct ARBBot* bot, struct AActor* ambientLocation); // Function OPP.RBAIBlueprintLibrary.RequestGotoAmbientMarker // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cee328
	void RequestGoto(struct ARBBot* bot, struct AActor* Destination, float overrideSpeed, bool bTurnToRotation, float distanceBuffer, bool bForced); // Function OPP.RBAIBlueprintLibrary.RequestGoto // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cedecc
	void PlaySingleShotAnim(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct UAnimSequence* AnimSeq); // Function OPP.RBAIBlueprintLibrary.PlaySingleShotAnim // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cedc04
	void PlayScriptedVO(struct ARBBot* bot, struct UAkAudioEvent* AudioEvent, enum class EVOPriority VOPriority); // Function OPP.RBAIBlueprintLibrary.PlayScriptedVO // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cedb0c
	void PlayLoopingIdle(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct UAnimSequence* IdleAnim, bool bIgnorePlayers, struct FRBAIConditionSet& specificExitConditions, struct UAnimSequence* specificExitAnim); // Function OPP.RBAIBlueprintLibrary.PlayLoopingIdle // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ced70c
	void PlayHitReaction(struct ARBBot* bot, enum class ENPCHitReactionType ReactionType, struct FVector& impactSourceLocation, bool bPlayEffects); // Function OPP.RBAIBlueprintLibrary.PlayHitReaction // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1ced5d0
	void PlayContextualVO(struct ARBBot* bot, enum class EVOContext Context); // Function OPP.RBAIBlueprintLibrary.PlayContextualVO // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ced51c
	void OverrideBotAnims(struct ARBBot* bot, struct URBAnimReferences* AnimRefsAsset); // Function OPP.RBAIBlueprintLibrary.OverrideBotAnims // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ced468
	void KillBot(struct ARBBot* bot); // Function OPP.RBAIBlueprintLibrary.KillBot // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ced3f8
	void KillAllBots(); // Function OPP.RBAIBlueprintLibrary.KillAllBots // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ced3bc
	bool IsAnyBotOfType(enum class ENPCType NPCType); // Function OPP.RBAIBlueprintLibrary.IsAnyBotOfType // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ced344
	void InvestigatePoints(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct TArray<struct AActor*>& pointList, enum class EInvestigationPointSelectionMode SelectionMode, bool bAware, bool bContinueInvestigatingWhenDone, int32_t maxNumberOfPoints, bool bOnlySpecifiedPoints); // Function OPP.RBAIBlueprintLibrary.InvestigatePoints // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ced078
	void InvestigatePoint(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct AActor* InvestigationPoint, bool bAware, bool bContinueInvestigatingWhenDone); // Function OPP.RBAIBlueprintLibrary.InvestigatePoint // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cece90
	void InvestigateLocation(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct FVector& investigationLoc, bool bAware, bool bContinueInvestigatingWhenDone); // Function OPP.RBAIBlueprintLibrary.InvestigateLocation // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1cecc64
	void Investigate(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, bool bAware); // Function OPP.RBAIBlueprintLibrary.Investigate // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cecac8
	void IgnoreAllPlayers(struct ARBBot* bot, bool bBotIgnoreAllPlayers); // Function OPP.RBAIBlueprintLibrary.IgnoreAllPlayers // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceca14
	void GotoSabotage(struct ARBBot* bot, struct AActor* sabotageTarget); // Function OPP.RBAIBlueprintLibrary.GotoSabotage // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cec960
	void GotoLocation(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct AActor* Destination, float overrideSpeed, bool bTurnToRotation, float distanceBuffer, bool bForced); // Function OPP.RBAIBlueprintLibrary.GotoLocation // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cec44c
	void GotoHidingSpot(struct ARBBot* bot, struct AActor* hidespot); // Function OPP.RBAIBlueprintLibrary.GotoHidingSpot // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cec398
	void GotoAmbientMarker(struct ARBBot* bot, struct AActor* ambientLocation, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo); // Function OPP.RBAIBlueprintLibrary.GotoAmbientMarker // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1cec238
	void GoRetireInCloset(struct ARBBot* bot, struct ARBMonsterCloset* closet, bool bPriorityOverActiveBehaviors); // Function OPP.RBAIBlueprintLibrary.GoRetireInCloset // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cec13c
	void GlobalIgnoreAllPlayers(bool bIgnoreAllPlayers); // Function OPP.RBAIBlueprintLibrary.GlobalIgnoreAllPlayers // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1cec0b8
	int32_t GetNumberOfBotsByType(enum class ENPCType NPCType); // Function OPP.RBAIBlueprintLibrary.GetNumberOfBotsByType // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1cec038
	int32_t GetNumberOfBotsAroundInActivity(enum class EAIActivity Activity, struct FVector& Point, float Radius, struct ARBPawn* excludedPawn); // Function OPP.RBAIBlueprintLibrary.GetNumberOfBotsAroundInActivity // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1cebef8
	int32_t GetNumberOfBotsAround(struct FVector& Point, float Radius, struct ARBPawn* excludedPawn); // Function OPP.RBAIBlueprintLibrary.GetNumberOfBotsAround // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1cebde8
	int32_t GetNumberOfBots(); // Function OPP.RBAIBlueprintLibrary.GetNumberOfBots // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1cebda8
	struct ARBNPC* GetNPCByType(enum class ENPCType NPCType); // Function OPP.RBAIBlueprintLibrary.GetNPCByType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1cebd00
	struct ARBNPC* GetNPCByClass(struct ARBNPC* NPCClass); // Function OPP.RBAIBlueprintLibrary.GetNPCByClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1cebc28
	void GetBotsByType(enum class ENPCType NPCType, struct TArray<struct ARBBot*>& bots); // Function OPP.RBAIBlueprintLibrary.GetBotsByType // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1cebb58
	void GetBotsByClass(struct ARBNPC* NPCClass, struct TArray<struct ARBBot*>& bots); // Function OPP.RBAIBlueprintLibrary.GetBotsByClass // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1ceba88
	struct ARBBot* GetBotByType(enum class ENPCType NPCType); // Function OPP.RBAIBlueprintLibrary.GetBotByType // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ceb9d4
	struct ARBBot* GetBotByClass(struct ARBNPC* NPCClass); // Function OPP.RBAIBlueprintLibrary.GetBotByClass // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1ceb8e0
	void ForcePlayStartleAnimation(struct ARBBot* bot, enum class EStartleType startledType, enum class EStartleSpeed startledSpeed, float wsYaw); // Function OPP.RBAIBlueprintLibrary.ForcePlayStartleAnimation // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb7a4
	void ForceGasGroupAttack(struct ARBBot* bot, struct FVector Direction); // Function OPP.RBAIBlueprintLibrary.ForceGasGroupAttack // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1ceb6e0
	void ForceExecute(struct ARBBot* bot, struct ARBPlayer* Player); // Function OPP.RBAIBlueprintLibrary.ForceExecute // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb62c
	void ForceChaseUntilContact(struct ARBBot* bot, struct ARBPlayer* TargetPlayer); // Function OPP.RBAIBlueprintLibrary.ForceChaseUntilContact // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb578
	void ForceAttackSequence(struct ARBBot* bot, struct UAnimSequence* forcedAnimSequence); // Function OPP.RBAIBlueprintLibrary.ForceAttackSequence // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb4c4
	void ExitHidingSpot(struct ARBBot* bot); // Function OPP.RBAIBlueprintLibrary.ExitHidingSpot // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb454
	void DisableAIDirector(); // Function OPP.RBAIBlueprintLibrary.DisableAIDirector // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb440
	void DetachFromScriptedAnimStation(struct ARBBot* bot); // Function OPP.RBAIBlueprintLibrary.DetachFromScriptedAnimStation // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb3d0
	void ClearVOMapOverrides(struct ARBBot* bot); // Function OPP.RBAIBlueprintLibrary.ClearVOMapOverrides // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb360
	void ClearSpecificTarget(struct ARBBot* bot); // Function OPP.RBAIBlueprintLibrary.ClearSpecificTarget // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb2f0
	void ClearScriptedCommands(struct ARBBot* bot); // Function OPP.RBAIBlueprintLibrary.ClearScriptedCommands // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb280
	void ClearLeash(struct ARBBot* bot); // Function OPP.RBAIBlueprintLibrary.ClearLeash // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1ceb210
	void AttachToScriptedAnimStation(struct ARBBot* bot, enum class EAICommandResult& operationResult, struct FLatentActionInfo LatentInfo, struct ARBScriptedAnimStation* Station, struct USkeletalMeshComponent* MeshTarget, bool bIgnorePlayers, struct FRBAIConditionSet& specificExitConditions, float StartDelay); // Function OPP.RBAIBlueprintLibrary.AttachToScriptedAnimStation // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1ceaf74
};

// Class OPP.RBAIChaseAwarenessState
// Size: 0x50 (Inherited: 0x38)
struct URBAIChaseAwarenessState : URBAIAwarenessState {
	struct ARBPlayer* TargetPlayer; // 0x38(0x08)
	struct ARBPlayer* KnockdownTargetToForget; // 0x40(0x08)
	char pad_48[0x8]; // 0x48(0x08)
};

// Class OPP.RBAISneakChaseAwarenessState
// Size: 0x50 (Inherited: 0x50)
struct URBAISneakChaseAwarenessState : URBAIChaseAwarenessState {
};

// Class OPP.RBAIAlwaysChaseAwarenessState
// Size: 0x50 (Inherited: 0x50)
struct URBAIAlwaysChaseAwarenessState : URBAIChaseAwarenessState {
};

// Class OPP.RBAICondition
// Size: 0x30 (Inherited: 0x28)
struct URBAICondition : UObject {
	bool bInversed; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class OPP.RBAICondition_AllOfSubConditions
// Size: 0x40 (Inherited: 0x30)
struct URBAICondition_AllOfSubConditions : URBAICondition {
	struct TArray<struct URBAICondition*> SubConditions; // 0x30(0x10)
};

// Class OPP.RBAICondition_AnyOfSubConditions
// Size: 0x40 (Inherited: 0x30)
struct URBAICondition_AnyOfSubConditions : URBAICondition {
	struct TArray<struct URBAICondition*> SubConditions; // 0x30(0x10)
};

// Class OPP.RBAICondition_AnyPlayerInVolumes
// Size: 0x40 (Inherited: 0x30)
struct URBAICondition_AnyPlayerInVolumes : URBAICondition {
	struct TArray<struct ARBPlayerTriggerVolume*> TestVolumes; // 0x30(0x10)
};

// Class OPP.RBAICondition_IsInVolumes
// Size: 0x40 (Inherited: 0x30)
struct URBAICondition_IsInVolumes : URBAICondition {
	struct TArray<struct TSoftObjectPtr<AVolume>> TestVolumes; // 0x30(0x10)
};

// Class OPP.RBAICondition_IsInRoom
// Size: 0x58 (Inherited: 0x30)
struct URBAICondition_IsInRoom : URBAICondition {
	struct TSoftObjectPtr<ARBRoom> TestRoom; // 0x30(0x28)
};

// Class OPP.RBAICondition_IsInRoomGroup
// Size: 0x58 (Inherited: 0x30)
struct URBAICondition_IsInRoomGroup : URBAICondition {
	struct TSoftObjectPtr<ARBRoomGroup> TestRoomGroup; // 0x30(0x28)
};

// Class OPP.RBAICondition_AnyPlayerInSight
// Size: 0x30 (Inherited: 0x30)
struct URBAICondition_AnyPlayerInSight : URBAICondition {
};

// Class OPP.RBAICondition_IsBotInStation
// Size: 0x30 (Inherited: 0x30)
struct URBAICondition_IsBotInStation : URBAICondition {
};

// Class OPP.RBAICondition_AnyPlayerCloseToPoint
// Size: 0x40 (Inherited: 0x30)
struct URBAICondition_AnyPlayerCloseToPoint : URBAICondition {
	struct AActor* TestActor; // 0x30(0x08)
	float MaxHorzDistance; // 0x38(0x04)
	float MaxVertDistance; // 0x3c(0x04)
};

// Class OPP.RBAICondition_AnyBotCloseToPoint
// Size: 0x58 (Inherited: 0x30)
struct URBAICondition_AnyBotCloseToPoint : URBAICondition {
	struct AActor* TestActor; // 0x30(0x08)
	float MaxHorzDistance; // 0x38(0x04)
	float MaxVertDistance; // 0x3c(0x04)
	bool bRequireSpecificType; // 0x40(0x01)
	enum class ENPCType SpecificType; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
	struct TArray<enum class EAIActivity> SpecificActivities; // 0x48(0x10)
};

// Class OPP.RBAICondition_IsIdle
// Size: 0x30 (Inherited: 0x30)
struct URBAICondition_IsIdle : URBAICondition {
};

// Class OPP.RBAICondition_IsInvestigating
// Size: 0x30 (Inherited: 0x30)
struct URBAICondition_IsInvestigating : URBAICondition {
};

// Class OPP.RBAICondition_IsPatrolling
// Size: 0x30 (Inherited: 0x30)
struct URBAICondition_IsPatrolling : URBAICondition {
};

// Class OPP.RBAICondition_IsChasing
// Size: 0x30 (Inherited: 0x30)
struct URBAICondition_IsChasing : URBAICondition {
};

// Class OPP.RBAICondition_FasterThan
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_FasterThan : URBAICondition {
	float Speed; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_CloseToPoint
// Size: 0x40 (Inherited: 0x30)
struct URBAICondition_CloseToPoint : URBAICondition {
	struct AActor* TestActor; // 0x30(0x08)
	float MaxHorzDistance; // 0x38(0x04)
	float MaxVertDistance; // 0x3c(0x04)
};

// Class OPP.RBAICondition_CloseToAnyPlayer
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_CloseToAnyPlayer : URBAICondition {
	float MaxHorzDistance; // 0x30(0x04)
	float MaxVertDistance; // 0x34(0x04)
};

// Class OPP.RBAICondition_CloseToAnotherBot
// Size: 0x50 (Inherited: 0x30)
struct URBAICondition_CloseToAnotherBot : URBAICondition {
	float MaxHorzDistance; // 0x30(0x04)
	float MaxVertDistance; // 0x34(0x04)
	bool bRequireSpecificType; // 0x38(0x01)
	enum class ENPCType SpecificType; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct TArray<enum class EAIActivity> SpecificActivities; // 0x40(0x10)
};

// Class OPP.RBAICondition_HasDealtDamage
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_HasDealtDamage : URBAICondition {
	float TimeWindow; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_HasTakenDamage
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_HasTakenDamage : URBAICondition {
	float TimeWindow; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_HasChasedAPlayer
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_HasChasedAPlayer : URBAICondition {
	float TimeWindow; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_HasSeenAPlayer
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_HasSeenAPlayer : URBAICondition {
	float TimeWindow; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_HasBeenDisturbed
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_HasBeenDisturbed : URBAICondition {
	float TimeWindow; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_HasKilledPlayers
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_HasKilledPlayers : URBAICondition {
	int32_t MinNumPlayersKilled; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_IsAtSpawnLocation
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_IsAtSpawnLocation : URBAICondition {
	float MaxDistance; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_IsInDarkness
// Size: 0x30 (Inherited: 0x30)
struct URBAICondition_IsInDarkness : URBAICondition {
};

// Class OPP.RBAICondition_TimeSinceSpawned
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_TimeSinceSpawned : URBAICondition {
	float MinimumTimeSinceSpawned; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_SummonedByAIDirector
// Size: 0x30 (Inherited: 0x30)
struct URBAICondition_SummonedByAIDirector : URBAICondition {
};

// Class OPP.RBAICondition_Blueprint
// Size: 0x50 (Inherited: 0x30)
struct URBAICondition_Blueprint : URBAICondition {
	struct FString ConditionDescription; // 0x30(0x10)
	struct FString ConditionDescriptionInversed; // 0x40(0x10)

	bool Event_EvaluateCondition(struct ARBBot* bot); // Function OPP.RBAICondition_Blueprint.Event_EvaluateCondition // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBAICondition_MinimumHealthyPlayers
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_MinimumHealthyPlayers : URBAICondition {
	int32_t MinHealthyPlayers; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_MaxActiveBots
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_MaxActiveBots : URBAICondition {
	int32_t MaximumNumberOfActiveBots; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_MaxBotsByType
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_MaxBotsByType : URBAICondition {
	int32_t MaxBotsOfType; // 0x30(0x04)
	enum class ENPCType NPCType; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
};

// Class OPP.RBAICondition_MaxBotsByTags
// Size: 0x78 (Inherited: 0x30)
struct URBAICondition_MaxBotsByTags : URBAICondition {
	int32_t MaxBotsWithTags; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FGameplayTagContainer IncludeTags; // 0x38(0x20)
	struct FGameplayTagContainer ExcludeTags; // 0x58(0x20)
};

// Class OPP.RBAICondition_MaxParaspecialists
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_MaxParaspecialists : URBAICondition {
	int32_t MaxParaspecialists; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_MaxPrimeAssets
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_MaxPrimeAssets : URBAICondition {
	int32_t MaxPrimeAssets; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class OPP.RBAICondition_StageTime
// Size: 0xf8 (Inherited: 0x30)
struct URBAICondition_StageTime : URBAICondition {
	struct FConfigurableFloat StageTimeThresholdInMinutes; // 0x30(0xc8)
};

// Class OPP.RBAICondition_MinimumGameDifficulty
// Size: 0x38 (Inherited: 0x30)
struct URBAICondition_MinimumGameDifficulty : URBAICondition {
	enum class EGameDifficulty MinDifficulty; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class OPP.RBAICondition_Adversity
// Size: 0xf8 (Inherited: 0x30)
struct URBAICondition_Adversity : URBAICondition {
	struct FConfigurableInt MinimumAdversityLevel; // 0x30(0xc8)
};

// Class OPP.RBAIConfig
// Size: 0x1200 (Inherited: 0x28)
struct URBAIConfig : UObject {
	struct URBAIConfig* Parent; // 0x28(0x08)
	struct FString OverridesDescription; // 0x30(0x10)
	struct FAIConfigData Config; // 0x40(0x11bc)
	char pad_11FC[0x4]; // 0x11fc(0x04)
};

// Class OPP.RBPartialAIConfig
// Size: 0x11f8 (Inherited: 0x28)
struct URBPartialAIConfig : UObject {
	struct FAIConfigData Overrides; // 0x28(0x11bc)
	char pad_11E4[0x4]; // 0x11e4(0x04)
	struct FString OverridesDescription; // 0x11e8(0x10)
};

// Class OPP.RBAIDirector
// Size: 0x14a8 (Inherited: 0x28)
struct URBAIDirector : UObject {
	struct FMulticastInlineDelegate OnAIDirectorSpawnedBot; // 0x28(0x10)
	struct URBAIManager* AIMgr; // 0x38(0x08)
	struct FRBAIRandomSpawning RandomSpawner; // 0x40(0x58)
	struct URBAIDirectorConfig* DirectorCfg; // 0x98(0x08)
	struct FSpecialistsConfigData SpecialistsConfig; // 0xa0(0x12f8)
	struct TArray<struct FSpawnRuleData> SpawnEventRules; // 0x1398(0x10)
	char pad_13A8[0x10]; // 0x13a8(0x10)
	struct FDynamicPressureData DynamicPressure; // 0x13b8(0x18)
	struct TArray<struct FStandardBotRespawnData> RespawnableBots; // 0x13d0(0x10)
	struct TArray<struct FRandomSpecialistSpawningData> RandomSpawns; // 0x13e0(0x10)
	char pad_13F0[0x18]; // 0x13f0(0x18)
	struct FPlayerProximityData PlayerProximity; // 0x1408(0x28)
	struct FPlayerRushingData PlayerRushing; // 0x1430(0x18)
	struct FAdversityData Adversity; // 0x1448(0x08)
	struct FRandomNPCSpawningDebugInfo RandomSpawningDebugInfo; // 0x1450(0x10)
	struct TArray<struct FPressureEventDebugData> PressureEventLog; // 0x1460(0x10)
	struct TArray<struct FSummonedBotDebugInfo> SummonedBotsLog; // 0x1470(0x10)
	struct TArray<struct FFailedBotSummonDebugInfo> LastFailedSummons; // 0x1480(0x10)
	char pad_1490[0x18]; // 0x1490(0x18)
};

// Class OPP.RBAIManager
// Size: 0x4e0 (Inherited: 0x28)
struct URBAIManager : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TArray<struct FBotCollisionInfo> CollisionData; // 0x38(0x10)
	struct TArray<struct ARBBot*> ActiveScreamers; // 0x48(0x10)
	struct TArray<struct FPsychosisMineData> PsychosisMines; // 0x58(0x10)
	char pad_68[0xf0]; // 0x68(0xf0)
	struct URBAIDirector* Director; // 0x158(0x08)
	char pad_160[0x28]; // 0x160(0x28)
	struct TArray<struct AActor*> UsedSpawningPositions; // 0x188(0x10)
	char pad_198[0x60]; // 0x198(0x60)
	struct TArray<struct FInvestigatedDoorData> RecentDoorInvestigations; // 0x1f8(0x10)
	char pad_208[0x138]; // 0x208(0x138)
	struct TArray<struct URBScheduledBotSpawnCommand*> ScheduledSpawns; // 0x340(0x10)
	struct TArray<struct FActiveChemMineData> ChemMines; // 0x350(0x10)
	struct TMap<struct URBAIConfig*, struct URBAIConfig*> ConfigRedirects; // 0x360(0x50)
	struct TArray<struct URBPartialAIConfig*> VariatorGlobalConfigOverrides; // 0x3b0(0x10)
	struct TArray<struct FRBVariatorNPCAIConfigOverride> VariatorConfigOverrides; // 0x3c0(0x10)
	char pad_3D0[0x100]; // 0x3d0(0x100)
	struct TArray<struct FLatentActionInfo> LatentSpawnAIQueue; // 0x4d0(0x10)
};

// Class OPP.RBAimAssistComponent
// Size: 0x230 (Inherited: 0x220)
struct URBAimAssistComponent : USceneComponent {
	enum class EAssistType AssistType; // 0x218(0x01)
	float AssistStartDistance; // 0x21c(0x04)
	float AssistCloseRadius; // 0x220(0x04)
	float AssistFarRadius; // 0x224(0x04)
	char pad_22D[0x3]; // 0x22d(0x03)
};

// Class OPP.RBAIPlayerManager
// Size: 0xb0 (Inherited: 0x28)
struct URBAIPlayerManager : UObject {
	struct ARBNPC* NPC; // 0x28(0x08)
	struct ARBBot* bot; // 0x30(0x08)
	struct URBAIAwarenessState* AwarenessState; // 0x38(0x08)
	char pad_40[0x50]; // 0x40(0x50)
	struct TArray<struct FAIStimulusInfo> PendingStimulusInfoList; // 0x90(0x10)
	struct TArray<struct FAIStimulusInfo> LatestStimulusInfoList; // 0xa0(0x10)
};

// Class OPP.RBAISleeperUnawareState
// Size: 0x68 (Inherited: 0x38)
struct URBAISleeperUnawareState : URBAIAwarenessState {
	float AwarenessMeter; // 0x38(0x04)
	float LastMeterIncreaseTimestamp; // 0x3c(0x04)
	float LastSleeperReactionEvent; // 0x40(0x04)
	float LastSleeperStartleEvent; // 0x44(0x04)
	struct FAIStimulusInfo HighestPriorityStimulus; // 0x48(0x20)
};

// Class OPP.RBAISleeperAlertedState
// Size: 0x58 (Inherited: 0x38)
struct URBAISleeperAlertedState : URBAIAwarenessState {
	struct FAIStimulusInfo InvestigationStimulus; // 0x38(0x20)
};

// Class OPP.RBAISneakAwarenessState
// Size: 0x40 (Inherited: 0x38)
struct URBAISneakAwarenessState : URBAIAwarenessState {
	struct ARBPlayer* TargetPlayer; // 0x38(0x08)
};

// Class OPP.RBAISpawner
// Size: 0x1670 (Inherited: 0x248)
struct ARBAISpawner : AActor {
	char pad_248[0x10]; // 0x248(0x10)
	bool bEnabled; // 0x258(0x01)
	enum class EAISpawnControlType SpawnType; // 0x259(0x01)
	char pad_25A[0x6]; // 0x25a(0x06)
	struct ARBNPC* PawnClass; // 0x260(0x08)
	struct TSoftObjectPtr<ARBRandomManager> ControllingRandomManager; // 0x268(0x28)
	int32_t ControllingRandomizerId; // 0x290(0x04)
	char pad_294[0x4]; // 0x294(0x04)
	struct URBAIConfig* configAsset; // 0x298(0x08)
	struct TArray<struct URBPartialAIConfig*> AdditionalConfigs; // 0x2a0(0x10)
	struct FAIConfigData ConfigOverrides; // 0x2b0(0x11bc)
	char pad_146C[0x4]; // 0x146c(0x04)
	struct FString ConfigOverridesDescription; // 0x1470(0x10)
	struct TArray<struct TSoftObjectPtr<ARBLeashMarker>> LeashesSoftRefs; // 0x1480(0x10)
	struct URBVOMapping* SpecificVOMapping; // 0x1490(0x08)
	struct FGameplayTagContainer ExtraTags; // 0x1498(0x20)
	struct TArray<struct FString> VoiceTypeOptionsOverride; // 0x14b8(0x10)
	char bUseVoiceTypeOptionsOverride : 1; // 0x14c8(0x01)
	char pad_14C8_1 : 7; // 0x14c8(0x01)
	bool bIsFemaleOverride; // 0x14c9(0x01)
	char bUseIsFemaleOverride : 1; // 0x14ca(0x01)
	char pad_14CA_1 : 7; // 0x14ca(0x01)
	char pad_14CB[0x5]; // 0x14cb(0x05)
	struct ARBMonsterCloset* SpawningMonsterCloset; // 0x14d0(0x08)
	struct TSoftObjectPtr<ARBMonsterCloset> SpawningMonsterClosetSoftRef; // 0x14d8(0x28)
	struct TArray<struct TSoftObjectPtr<ARBMonsterCloset>> SpawningMonsterClosets; // 0x1500(0x10)
	bool bSpawnAtRandomLocation; // 0x1510(0x01)
	char pad_1511[0x7]; // 0x1511(0x07)
	struct TArray<struct AActor*> AdditionalPossibleSpawnLocations; // 0x1518(0x10)
	struct TArray<struct AActor*> ExcludedSpawnLocations; // 0x1528(0x10)
	bool bDoNotSpawnAtSpawnerLocation; // 0x1538(0x01)
	bool bSpawnInLimbo; // 0x1539(0x01)
	bool bSpawnAutomatically; // 0x153a(0x01)
	char pad_153B[0x5]; // 0x153b(0x05)
	struct FAISpawnerUICustomizationProxy UICustomizationProxy; // 0x1540(0x08)
	struct URBAmbientConfig* AmbientConfig; // 0x1548(0x08)
	bool bResumeAfterInterruption; // 0x1550(0x01)
	bool bInfiniteIdleOnSpawn; // 0x1551(0x01)
	bool bSpecificIdleDuration; // 0x1552(0x01)
	char pad_1553[0x1]; // 0x1553(0x01)
	float SpecificMinDuration; // 0x1554(0x04)
	float SpecificMaxDuration; // 0x1558(0x04)
	char pad_155C[0x4]; // 0x155c(0x04)
	struct TArray<struct AActor*> AmbientActivityMarkers; // 0x1560(0x10)
	struct TArray<struct TSoftObjectPtr<AVolume>> AmbientActivityVolumes; // 0x1570(0x10)
	bool bAvailableForAmbientPatrol; // 0x1580(0x01)
	bool bOnlyAvailableForSpawnedNPC; // 0x1581(0x01)
	bool bStartInInfiniteInvestigation; // 0x1582(0x01)
	bool bUseRestrictedVolumesForPatrolInvestigate; // 0x1583(0x01)
	char pad_1584[0x4]; // 0x1584(0x04)
	struct TArray<struct TSoftObjectPtr<AVolume>> RestrictedVolumes; // 0x1588(0x10)
	struct TArray<struct TSoftObjectPtr<ARBVolumeGroup>> RestrictedVolumeGroups; // 0x1598(0x10)
	bool bUseRestrictedVolumesForLeash; // 0x15a8(0x01)
	bool bStartInPatrol; // 0x15a9(0x01)
	bool bForcedPatrol; // 0x15aa(0x01)
	char pad_15AB[0x1]; // 0x15ab(0x01)
	float OverridePatrolSpeed; // 0x15ac(0x04)
	struct TArray<struct ARBWaypoint*> PatrolWaypoints; // 0x15b0(0x10)
	struct TArray<struct TSoftObjectPtr<ARBWaypointGroup>> WaypointGroups; // 0x15c0(0x10)
	struct TArray<struct TSoftObjectPtr<AVolume>> PatrolWaypointVolumes; // 0x15d0(0x10)
	enum class EPatrolWaypointSelectionMode PatrolMode; // 0x15e0(0x01)
	char pad_15E1[0x7]; // 0x15e1(0x07)
	struct FMulticastInlineDelegate AIEvent_Server; // 0x15e8(0x10)
	struct FMulticastInlineDelegate SpawnedBot_Server; // 0x15f8(0x10)
	enum class ERBAISpawnerVersion Version; // 0x1608(0x01)
	char pad_1609[0x7]; // 0x1609(0x07)
	struct URBAmbientStationComponent* AmbientStation; // 0x1610(0x08)
	enum class EAISpawnerState State; // 0x1618(0x01)
	char pad_1619[0x7]; // 0x1619(0x07)
	struct ARBBot* bot; // 0x1620(0x08)
	struct ARBNPC* NPC; // 0x1628(0x08)
	struct URBAIConfig* ExternallySetConfigAsset; // 0x1630(0x08)
	struct TArray<struct URBPartialAIConfig*> ExternallySetPartialConfigs; // 0x1638(0x10)
	struct AActor* ExternallySetSpawnLocation; // 0x1648(0x08)
	struct ARBWaypointGroup* ActiveWaypointGroup; // 0x1650(0x08)
	int32_t RandomizationId; // 0x1658(0x04)
	char pad_165C[0x14]; // 0x165c(0x14)

	struct ARBBot* BP_SpawnBotSpecific(struct ARBNPC* specificPawnClass, struct URBAIConfig* specificConfig); // Function OPP.RBAISpawner.BP_SpawnBotSpecific // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1cfe8d8
	void BP_SpawnBotAsync(struct ARBBot*& bot, struct ARBNPC*& spawnedPawn, struct FLatentActionInfo LatentInfo); // Function OPP.RBAISpawner.BP_SpawnBotAsync // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1cfe7a0
	struct ARBBot* BP_SpawnBot(); // Function OPP.RBAISpawner.BP_SpawnBot // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1cfe724
};

// Class OPP.RBAIVolume
// Size: 0x288 (Inherited: 0x280)
struct ARBAIVolume : AVolume {
	bool bDisablePouncerSpawning; // 0x280(0x01)
	char pad_281[0x7]; // 0x281(0x07)
};

// Class OPP.RBAmbientActivityMarker
// Size: 0x290 (Inherited: 0x248)
struct ARBAmbientActivityMarker : AActor {
	bool bEnabled; // 0x248(0x01)
	char pad_249[0x3]; // 0x249(0x03)
	float RelativeProbability; // 0x24c(0x04)
	struct URBAmbientConfig* AmbientConfig; // 0x250(0x08)
	struct TArray<struct URBAmbientConfig*> AmbientConfigs; // 0x258(0x10)
	int32_t PreviewConfigIdx; // 0x268(0x04)
	bool bSpecificIdleDuration; // 0x26c(0x01)
	char pad_26D[0x3]; // 0x26d(0x03)
	float SpecificMinDuration; // 0x270(0x04)
	float SpecificMaxDuration; // 0x274(0x04)
	struct URBAmbientStationComponent* AmbientStation; // 0x278(0x08)
	char pad_280[0x10]; // 0x280(0x10)

	void Event_OnReached(struct ARBBot* bot); // Function OPP.RBAmbientActivityMarker.Event_OnReached // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnLeft(struct ARBBot* bot); // Function OPP.RBAmbientActivityMarker.Event_OnLeft // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBAmbientSound
// Size: 0x258 (Inherited: 0x248)
struct ARBAmbientSound : AActor {
	struct URBSoundComponent* SoundComponent; // 0x248(0x08)
	bool StopWhenOwnerIsDestroyed; // 0x250(0x01)
	char pad_251[0x7]; // 0x251(0x07)

	void StopAmbientSound(); // Function OPP.RBAmbientSound.StopAmbientSound // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x1cfe9f8
	void StartAmbientSound(); // Function OPP.RBAmbientSound.StartAmbientSound // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x1cfe9e0
};

// Class OPP.RBAmbientSoundMovable
// Size: 0x268 (Inherited: 0x258)
struct ARBAmbientSoundMovable : ARBAmbientSound {
	struct ARBSplineActor* LinkedSpline; // 0x258(0x08)
	float SplineOffset; // 0x260(0x04)
	float PositionApproachCoeff; // 0x264(0x04)
};

// Class OPP.RBAmbientConfig
// Size: 0x108 (Inherited: 0x28)
struct URBAmbientConfig : UObject {
	struct FNPCAmbientConfig Config; // 0x28(0xe0)
};

// Class OPP.RBAmbientStationComponent
// Size: 0x100 (Inherited: 0xb8)
struct URBAmbientStationComponent : UActorComponent {
	bool bEnabled; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	float RelativeProbability; // 0xbc(0x04)
	struct URBAmbientConfig* configAsset; // 0xc0(0x08)
	struct ARBBot* ActiveBot; // 0xc8(0x08)
	struct ARBBot* IncomingBot; // 0xd0(0x08)
	bool bResumeAfterInterruption; // 0xd8(0x01)
	bool bSpecificIdleDuration; // 0xd9(0x01)
	char pad_DA[0x2]; // 0xda(0x02)
	float SpecificMinDuration; // 0xdc(0x04)
	float SpecificMaxDuration; // 0xe0(0x04)
	char pad_E4[0xc]; // 0xe4(0x0c)
	struct URBAmbientConfig* ValidatedConfigAsset; // 0xf0(0x08)
	char pad_F8[0x8]; // 0xf8(0x08)
};

// Class OPP.RBAnimAnchorComponent
// Size: 0x520 (Inherited: 0x520)
struct URBAnimAnchorComponent : UStaticMeshComponent {
};

// Class OPP.RBAnimatedProp
// Size: 0x260 (Inherited: 0x248)
struct ARBAnimatedProp : AActor {
	struct USceneComponent* LineOfSightTestLocation; // 0x248(0x08)
	struct URBSoundComponent* SoundComponent; // 0x250(0x08)
	struct URBPropOptimizerComponent* PropOptimizerComponent; // 0x258(0x08)
};

// Class OPP.RBCustomSpecialMoveInteractableActor
// Size: 0x2c0 (Inherited: 0x248)
struct ARBCustomSpecialMoveInteractableActor : AActor {
	char pad_248[0x8]; // 0x248(0x08)
	struct URBInteractionZoneComponent* InteractionZone; // 0x250(0x08)
	bool bAllowMultipleInteractors; // 0x258(0x01)
	char pad_259[0x3]; // 0x259(0x03)
	float MinDelayBetweenInteractions; // 0x25c(0x04)
	struct ARBPlayer* interactingPlayer; // 0x260(0x08)
	struct FVector2D CameraYawLimit; // 0x268(0x08)
	struct FVector2D CameraPitchLimit; // 0x270(0x08)
	struct FMulticastInlineDelegate OnLocalPlayerInteracted; // 0x278(0x10)
	struct FMulticastInlineDelegate OnPlayerInteracted; // 0x288(0x10)
	struct FMulticastInlineDelegate OnLocalPlayerInteractionCompleted; // 0x298(0x10)
	struct FMulticastInlineDelegate OnPlayerInteractionCompleted; // 0x2a8(0x10)
	char pad_2B8[0x8]; // 0x2b8(0x08)

	void Multicast_OnPlayerInteractionCompleted(struct ARBPlayer* Player); // Function OPP.RBCustomSpecialMoveInteractableActor.Multicast_OnPlayerInteractionCompleted // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d49188
	void Multicast_OnPlayerInteracted(struct ARBPlayer* Player); // Function OPP.RBCustomSpecialMoveInteractableActor.Multicast_OnPlayerInteracted // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d49104
	void Event_OnLocalPlayerInteractionCompleted(); // Function OPP.RBCustomSpecialMoveInteractableActor.Event_OnLocalPlayerInteractionCompleted // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnLocalPlayerInteracted(); // Function OPP.RBCustomSpecialMoveInteractableActor.Event_OnLocalPlayerInteracted // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void CompleteInteractionForPlayer_Server(struct ARBPlayer* Player); // Function OPP.RBCustomSpecialMoveInteractableActor.CompleteInteractionForPlayer_Server // (Final|Native|Public|BlueprintCallable) // @ game+0x1d48768
	void CompleteInteractionForPlayer_Client(struct ARBPlayer* Player); // Function OPP.RBCustomSpecialMoveInteractableActor.CompleteInteractionForPlayer_Client // (Final|Native|Public|BlueprintCallable) // @ game+0x1d486d4
	void CompleteInteraction_Server(); // Function OPP.RBCustomSpecialMoveInteractableActor.CompleteInteraction_Server // (Final|Native|Public|BlueprintCallable) // @ game+0x1d48838
	void CompleteInteraction_Client(); // Function OPP.RBCustomSpecialMoveInteractableActor.CompleteInteraction_Client // (Final|Native|Public|BlueprintCallable) // @ game+0x1d487f8
};

// Class OPP.RBQuestGiver
// Size: 0x2d8 (Inherited: 0x2c0)
struct ARBQuestGiver : ARBCustomSpecialMoveInteractableActor {
	struct URBMenuWidget* QuestGiverMenuClass; // 0x2c0(0x08)
	struct URBSoundComponent* VoiceAKComponent; // 0x2c8(0x08)
	struct URBQuestGiverConfig* QuestGiverConfig; // 0x2d0(0x08)

	void PlayAkEvent(struct UAkAudioEvent* akEvent, enum class EVOContext VOContext, enum class EVOPriority VOPriority); // Function OPP.RBQuestGiver.PlayAkEvent // (Native|Public|BlueprintCallable) // @ game+0x1deb580
	enum class EMetaNPCType GetMetaNPCType(); // Function OPP.RBQuestGiver.GetMetaNPCType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1deaef0
};

// Class OPP.RBAnimatedQuestGiver
// Size: 0x2f8 (Inherited: 0x2d8)
struct ARBAnimatedQuestGiver : ARBQuestGiver {
	struct AActor* MenuCameraPositionRef; // 0x2d8(0x08)
	struct USkeletalMeshComponent* QuestGiverMesh; // 0x2e0(0x08)
	struct UDataTable* FacialAnimations; // 0x2e8(0x08)
	struct UPoseAsset* FacePoseAsset; // 0x2f0(0x08)

	bool TryPlayFacialAnim(struct FString lineId); // Function OPP.RBAnimatedQuestGiver.TryPlayFacialAnim // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1cfea44
	void StopFacialAnim(); // Function OPP.RBAnimatedQuestGiver.StopFacialAnim // (Final|Native|Public|BlueprintCallable) // @ game+0x1cfea30
	struct USkeletalMeshComponent* GetFaceFXSkeletalMeshComponent(); // Function OPP.RBAnimatedQuestGiver.GetFaceFXSkeletalMeshComponent // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1cfe9b8
};

// Class OPP.RBAnimInstance
// Size: 0x900 (Inherited: 0x2c0)
struct URBAnimInstance : UAnimInstance {
	struct TMap<struct TSoftClassPtr<UObject>, struct FOperatableAnimationData> OperatableAnimationSequences; // 0x2b8(0x50)
	struct FHidespotsAnimRefs HidespotAnimRefs; // 0x308(0x260)
	struct FBasicDirectionAnimations AdditiveTwitchAnims; // 0x568(0x20)
	struct FName HidingSpotSlotName; // 0x588(0x08)
	struct TMap<enum class ELargeObjectType, struct UAnimSequence*> LargeItemPoseMap; // 0x590(0x50)
	struct TMap<enum class ELargeObjectType, struct UAnimSequence*> LargeItemCradleMap; // 0x5e0(0x50)
	float SpeedToBeConsideredMoving; // 0x630(0x04)
	float SpeedToBeConsideredRunning; // 0x634(0x04)
	bool bUseSmoothVelocityForIsMoving; // 0x638(0x01)
	bool bIsShadow; // 0x639(0x01)
	char pad_642[0x1e]; // 0x642(0x1e)
	bool bIsLanding; // 0x660(0x01)
	char pad_661[0x1]; // 0x661(0x01)
	enum class ELandingType LandingType; // 0x662(0x01)
	enum class ELocomotionMovementSpeed LandingSpeed; // 0x663(0x01)
	enum class EBasicDirection LandingDirection; // 0x664(0x01)
	char pad_665[0x3]; // 0x665(0x03)
	float LandingAngle; // 0x668(0x04)
	char pad_66C[0x4]; // 0x66c(0x04)
	struct ARBPawn* RBPawn; // 0x670(0x08)
	bool bFullBodySynced; // 0x678(0x01)
	bool bFullBodySyncedIsBlendSpace; // 0x679(0x01)
	char pad_67A[0x6]; // 0x67a(0x06)
	struct UAnimSequence* AnimationSyncSequence; // 0x680(0x08)
	struct UBlendSpaceBase* AnimationBlendSyncSequence; // 0x688(0x08)
	float AnimationSyncValue; // 0x690(0x04)
	float AnimationSyncBlendXValue; // 0x694(0x04)
	bool IsPlayingSpecialMoveAnimation; // 0x698(0x01)
	char pad_699[0x7]; // 0x699(0x07)
	struct UAnimMontage* PlayingSpecialMoveAnimMontage; // 0x6a0(0x08)
	struct FName CurrentGameplayState; // 0x6a8(0x08)
	bool isDead; // 0x6b0(0x01)
	bool IsGhost; // 0x6b1(0x01)
	char pad_6B2[0x2]; // 0x6b2(0x02)
	float HealthPercentage; // 0x6b4(0x04)
	struct USkeletalMeshComponent* GhostMesh; // 0x6b8(0x08)
	float GhostBlendIn; // 0x6c0(0x04)
	float GhostBlendOut; // 0x6c4(0x04)
	bool IsPlayingGhostAnim; // 0x6c8(0x01)
	bool IsInGroundAndPound; // 0x6c9(0x01)
	bool IsInNormalLocomotionMode; // 0x6ca(0x01)
	bool IsCrouched; // 0x6cb(0x01)
	bool IsInAir; // 0x6cc(0x01)
	bool bIsInAirFromJumpOver; // 0x6cd(0x01)
	bool IsMoving; // 0x6ce(0x01)
	bool IsMovingTransition; // 0x6cf(0x01)
	bool IsRunning; // 0x6d0(0x01)
	bool IsSlideFloor; // 0x6d1(0x01)
	bool IsSlideFloorBlocked; // 0x6d2(0x01)
	bool IsSlideOver; // 0x6d3(0x01)
	bool IsTraversalDone; // 0x6d4(0x01)
	bool bTraversalBlendToLocomotion; // 0x6d5(0x01)
	bool IsSlideHitWall; // 0x6d6(0x01)
	char pad_6D7[0x1]; // 0x6d7(0x01)
	struct FVector Acceleration; // 0x6d8(0x0c)
	struct FVector Velocity; // 0x6e4(0x0c)
	float SpeedForward; // 0x6f0(0x04)
	float SpeedRight; // 0x6f4(0x04)
	float SpeedTotal; // 0x6f8(0x04)
	float SpeedBlendScaling; // 0x6fc(0x04)
	bool CountsAsWalkingForward; // 0x700(0x01)
	bool IsMovingMoreThanALittle; // 0x701(0x01)
	char pad_702[0x2]; // 0x702(0x02)
	float PercentageOfTotalSpeedRight; // 0x704(0x04)
	float InAirDuration; // 0x708(0x04)
	bool InAirAngleBackward; // 0x70c(0x01)
	char pad_70D[0x3]; // 0x70d(0x03)
	float InAirAngle; // 0x710(0x04)
	float SmoothedRotationSpeed; // 0x714(0x04)
	bool IsTurning; // 0x718(0x01)
	bool OnSlope; // 0x719(0x01)
	char pad_71A[0x2]; // 0x71a(0x02)
	struct FRotator SlopeRotation; // 0x71c(0x0c)
	char pad_728[0x8]; // 0x728(0x08)
	struct FTransform SlopeTransform; // 0x730(0x30)
	enum class ESpecialMove specialMove; // 0x760(0x01)
	bool IsOverrideFullBody; // 0x761(0x01)
	char pad_762[0x2]; // 0x762(0x02)
	float OverrideFullBodyBlendTiming; // 0x764(0x04)
	char pad_768[0x8]; // 0x768(0x08)
	bool IsPlayingSingleEvalBlendSpace; // 0x770(0x01)
	char pad_771[0x7]; // 0x771(0x07)
	struct UBlendSpaceBase* SingleEvalBlendSpace; // 0x778(0x08)
	float SingleEvalBlendSpaceControlValueX; // 0x780(0x04)
	float SingleEvalBlendSpaceControlValueY; // 0x784(0x04)
	float SingleEvalBlendSpacePlayRate; // 0x788(0x04)
	float SingleEvalBlendTimeIn; // 0x78c(0x04)
	float SingleEvalBlendTimeOut; // 0x790(0x04)
	char pad_794[0x4]; // 0x794(0x04)
	struct UAnimSequence* OperatableStart; // 0x798(0x08)
	struct UAnimSequence* OperatableLoop; // 0x7a0(0x08)
	struct UAnimSequence* OperatableEnd; // 0x7a8(0x08)
	bool IsUsingOperatable; // 0x7b0(0x01)
	bool IsOperationComplete; // 0x7b1(0x01)
	char pad_7B2[0x2]; // 0x7b2(0x02)
	float OperatableLoopPosition; // 0x7b4(0x04)
	bool IsHoldingItem; // 0x7b8(0x01)
	bool IsHoldingLargeItem; // 0x7b9(0x01)
	char pad_7BA[0x6]; // 0x7ba(0x06)
	struct UAnimSequence* LargeItemPose; // 0x7c0(0x08)
	struct UAnimSequence* LargeItemCradlePose; // 0x7c8(0x08)
	enum class EHidespotCategory HidingSpotType; // 0x7d0(0x01)
	char pad_7D1[0x7]; // 0x7d1(0x07)
	struct FSingleHidespotInteractionsAnimRefs CurrentHidingSpotAnimations; // 0x7d8(0x40)
	bool IsInHidingSpot; // 0x818(0x01)
	char pad_819[0x3]; // 0x819(0x03)
	float HidingSpotPeekRatio; // 0x81c(0x04)
	float OverrideUpperBody; // 0x820(0x04)
	float OverrideIKHandsChest; // 0x824(0x04)
	bool IsPlayingGrab; // 0x828(0x01)
	bool IsUsingGrabBS; // 0x829(0x01)
	char pad_82A[0x2]; // 0x82a(0x02)
	float GrabBlendSpaceControl; // 0x82c(0x04)
	struct UBlendSpace1D* GrabEnterBS; // 0x830(0x08)
	struct UAnimSequence* GrabEnter; // 0x838(0x08)
	struct UAnimSequence* GrabExit; // 0x840(0x08)
	float AnkleHeight; // 0x848(0x04)
	float HipsOffset; // 0x84c(0x04)
	struct FTransform LeftFootStairTransform; // 0x850(0x30)
	bool LeftFootAnimNotifyDown; // 0x880(0x01)
	bool LeftFootIsDown; // 0x881(0x01)
	char pad_882[0xe]; // 0x882(0x0e)
	struct FTransform RightFootStairTransform; // 0x890(0x30)
	bool RightFootAnimNotifyDown; // 0x8c0(0x01)
	bool RightFootIsDown; // 0x8c1(0x01)
	char pad_8C2[0x2]; // 0x8c2(0x02)
	float FacingStairsUp; // 0x8c4(0x04)
	float FacingStairsDown; // 0x8c8(0x04)
	float AlignedToStairsUp; // 0x8cc(0x04)
	float AlignedToStairsDown; // 0x8d0(0x04)
	bool bValidStairsMarker; // 0x8d4(0x01)
	char pad_8D5[0x3]; // 0x8d5(0x03)
	float StairAnimationBlendTiming; // 0x8d8(0x04)
	char pad_8DC[0x24]; // 0x8dc(0x24)

	void SetIsPlayingSpecialMoveAnimation(bool in_IsPlayingSpecialMoveAnimation); // Function OPP.RBAnimInstance.SetIsPlayingSpecialMoveAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x1d0052c
	void SetHoldingItem(bool Value, bool Force); // Function OPP.RBAnimInstance.SetHoldingItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1d00468
	void OnTraversalSlideDone(bool bHitWall); // Function OPP.RBAnimInstance.OnTraversalSlideDone // (Native|Public) // @ game+0x1d003e4
	bool GetIsPlayingSpecialMoveAnimation(); // Function OPP.RBAnimInstance.GetIsPlayingSpecialMoveAnimation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d003ac
	bool GetIsLeftFootDown(); // Function OPP.RBAnimInstance.GetIsLeftFootDown // (Final|Native|Public|BlueprintCallable) // @ game+0x1d0038c
};

// Class OPP.RBAnimInstanceBackgroundCharacter
// Size: 0x380 (Inherited: 0x2c0)
struct URBAnimInstanceBackgroundCharacter : UAnimInstance {
	struct ARBBackgroundCharacter* Character; // 0x2b8(0x08)
	bool bPlayingAnimSlotA; // 0x2c0(0x01)
	bool bUsingIdleLookAt; // 0x2c1(0x01)
	struct UAnimSequence* AnimSlotA; // 0x2c8(0x08)
	struct UAnimSequence* AnimSlotB; // 0x2d0(0x08)
	struct UAnimSequence* RelaxIdle; // 0x2d8(0x08)
	struct UAnimSequence* AlertIdle; // 0x2e0(0x08)
	struct UBlendSpace* LookAtRelaxBS; // 0x2e8(0x08)
	struct UBlendSpace* LookAtRelaxToAlertBS; // 0x2f0(0x08)
	struct UBlendSpace* LookAtAlertBS; // 0x2f8(0x08)
	struct UBlendSpace* LookAtAlertToRelaxBS; // 0x300(0x08)
	struct UAnimSequence* ForwardLoopAnim; // 0x308(0x08)
	struct UBlendSpace* ForwardLoopBS; // 0x310(0x08)
	bool bIsForwardLoopUsingBlendSpace; // 0x318(0x01)
	char pad_31B[0x5]; // 0x31b(0x05)
	struct UAnimSequence* StartAnim; // 0x320(0x08)
	struct UBlendSpace* StartBS; // 0x328(0x08)
	bool bIsStartUsingBlendSpace; // 0x330(0x01)
	char pad_331[0x7]; // 0x331(0x07)
	struct UAnimSequence* StopAnim; // 0x338(0x08)
	struct UBlendSpace* StopBS; // 0x340(0x08)
	bool bIsStopUsingBlendSpace; // 0x348(0x01)
	char pad_349[0x3]; // 0x349(0x03)
	float StopAnimationStartTime; // 0x34c(0x04)
	bool bMoving; // 0x350(0x01)
	bool bWantPlayStartAnim; // 0x351(0x01)
	bool bWantExitStartAnim; // 0x352(0x01)
	bool bWantIdleToMovingThrough; // 0x353(0x01)
	bool bWantPlayStopAnim; // 0x354(0x01)
	bool bWantExitStopAnim; // 0x355(0x01)
	bool bAlert; // 0x356(0x01)
	char pad_357[0x1]; // 0x357(0x01)
	float LookAtYaw; // 0x358(0x04)
	float LookAtPitch; // 0x35c(0x04)
	char pad_360[0x20]; // 0x360(0x20)
};

// Class OPP.RBAnimInstanceNPC
// Size: 0x20c0 (Inherited: 0x900)
struct URBAnimInstanceNPC : URBAnimInstance {
	float NominalWalkSpeed; // 0x900(0x04)
	float MaxWalkSpeed; // 0x904(0x04)
	float NominalStrideSpeed; // 0x908(0x04)
	float MaxStrideSpeed; // 0x90c(0x04)
	bool bSupportsStrideSpeed; // 0x910(0x01)
	bool bSupportsJogSpeed; // 0x911(0x01)
	char pad_912[0x2]; // 0x912(0x02)
	float NominalJogSpeed; // 0x914(0x04)
	float MaxJogSpeed; // 0x918(0x04)
	float NominalRunSpeed; // 0x91c(0x04)
	char pad_920[0x10]; // 0x920(0x10)
	struct FName NormalLocomotionNodeName; // 0x930(0x08)
	struct FName AgressiveLocomotionNodeName; // 0x938(0x08)
	struct TMap<enum class ELocomotionMovementSpeed, struct FLocomotionTurnDirectionOptions> StartSequences; // 0x940(0x50)
	struct TMap<enum class ELocomotionMovementSpeed, struct FLocomotionTurnDirectionOptions> StartSequencesAggressive; // 0x990(0x50)
	float AnimatedStartDefaultBlendOutTime; // 0x9e0(0x04)
	float AnimatedStartCompleteNotifyBlendOutTime; // 0x9e4(0x04)
	struct TMap<enum class ELocomotionMovementSpeed, struct FLocomotionStopDirectionOptions> StopSequences; // 0x9e8(0x50)
	struct TMap<enum class ELocomotionMovementSpeed, struct FLocomotionStopDirectionOptions> StopSequencesAggressive; // 0xa38(0x50)
	struct UAnimSequence* ImmediateStopFast; // 0xa88(0x08)
	struct UAnimSequence* ImmediateStopSlow; // 0xa90(0x08)
	struct UAnimSequence* ImmediateStopFastAggressive; // 0xa98(0x08)
	struct UAnimSequence* ImmediateStopSlowAggressive; // 0xaa0(0x08)
	struct UBlendSpaceBase* ImmediateStopFastBlendSpace; // 0xaa8(0x08)
	struct UBlendSpaceBase* ImmediateStopSlowBlendSpace; // 0xab0(0x08)
	struct UBlendSpaceBase* ImmediateStopFastBlendSpaceAggressive; // 0xab8(0x08)
	struct UBlendSpaceBase* ImmediateStopSlowBlendSpaceAggressive; // 0xac0(0x08)
	float AnimatedStopsDefaultBlendOutTime; // 0xac8(0x04)
	char pad_ACC[0x4]; // 0xacc(0x04)
	struct TMap<enum class EStartleType, struct FLocomotionStartleSpeedOptions> StartleSequences; // 0xad0(0x50)
	struct TArray<struct FAttackMove> Openers; // 0xb20(0x10)
	struct TArray<struct FAttackMove> Heavies; // 0xb30(0x10)
	struct TArray<struct FAttackMove> Punishes; // 0xb40(0x10)
	float AttackTargetDistanceTooFar; // 0xb50(0x04)
	float AttackTargetDistanceTooClose; // 0xb54(0x04)
	float AttackAngleToTargetTooLarge; // 0xb58(0x04)
	float AttackInitialSpeedDiffTooFast; // 0xb5c(0x04)
	float AttackInitialSpeedDiffTooSlow; // 0xb60(0x04)
	float AttackMaxCeilingClipDistance; // 0xb64(0x04)
	struct TArray<struct FAttackMove> GrabAttacks; // 0xb68(0x10)
	float GrabEnterDistance; // 0xb78(0x04)
	float GrabExitDistance; // 0xb7c(0x04)
	float MinGrabHeightClearance; // 0xb80(0x04)
	char pad_B84[0x4]; // 0xb84(0x04)
	struct FGrabAttackData GrabData; // 0xb88(0x150)
	struct TArray<struct UAnimSequence*> BlindSequences; // 0xcd8(0x10)
	struct TArray<struct UAnimSequence*> BlindSequencesAgitated; // 0xce8(0x10)
	struct TArray<struct FNPCInvestigationAnimData> InvestigationAnims; // 0xcf8(0x10)
	struct TArray<struct FNPCInvestigationAnimData> InvestigationAnimsAggressive; // 0xd08(0x10)
	struct TArray<struct FNPCWaypointAnimData> WaypointAnims; // 0xd18(0x10)
	struct TArray<struct FNPCWaypointAnimData> WaypointAnimsAggressive; // 0xd28(0x10)
	struct TArray<struct FNPCHitReactionAnimData> HitReactionAnims; // 0xd38(0x10)
	struct TArray<struct FNPCHitReactionAnimData> HitReactionAnimsAggressive; // 0xd48(0x10)
	struct FHidespotsAnimRefs HidespotAnimRefsAggressive; // 0xd58(0x260)
	struct FNPCDoorPassthroughAnimDataSet DoorPassthroughUnaware; // 0xfb8(0x440)
	struct FNPCDoorPassthroughAnimDataSet DoorPassthroughChase; // 0x13f8(0x440)
	struct FNPCDoorInvestigationAnimDataSet DoorInvestigationsUnaware; // 0x1838(0x2a0)
	struct FNPCDoorInvestigationAnimDataSet DoorInvestigationsChase; // 0x1ad8(0x2a0)
	struct TArray<struct UAnimSequence*> RelaxedIdleBreakers; // 0x1d78(0x10)
	struct TArray<struct UAnimSequence*> SuspiciousIdleBreakers; // 0x1d88(0x10)
	struct TArray<struct UAnimSequence*> ChaseIdleBreakers; // 0x1d98(0x10)
	bool bUsesCeilingClearance; // 0x1da8(0x01)
	char pad_1DA9[0x3]; // 0x1da9(0x03)
	struct FName WeaponAttachmentBoneForCeilingChecks; // 0x1dac(0x08)
	struct FVector CeilingClearanceOffsetFromAttachmentBone; // 0x1db4(0x0c)
	float MaxHipsDownOffsetForCeiling; // 0x1dc0(0x04)
	float MaxSpineRotationForCeiling; // 0x1dc4(0x04)
	float BaseHeadHeight; // 0x1dc8(0x04)
	float MaxCeilingHeightForEffect; // 0x1dcc(0x04)
	bool bComputeHandShieldingEyes; // 0x1dd0(0x01)
	char pad_1DD1[0xf]; // 0x1dd1(0x0f)
	struct FTransform HandShieldingEyesOffsetFromHead; // 0x1de0(0x30)
	struct FVector HandShieldingEyesLocation; // 0x1e10(0x0c)
	struct FRotator HandShieldingEyesRotation; // 0x1e1c(0x0c)
	bool bUpdateAll; // 0x1e28(0x01)
	bool bUpdateStopCurves; // 0x1e29(0x01)
	bool bUpdateStartCurves; // 0x1e2a(0x01)
	bool bUpdateStartles; // 0x1e2b(0x01)
	bool bUpdateAttackMoves; // 0x1e2c(0x01)
	bool bUpdateInvestigationData; // 0x1e2d(0x01)
	bool bUpdateDoors; // 0x1e2e(0x01)
	bool bResetHitReactionAnims; // 0x1e2f(0x01)
	float MinimumAmountOfTimeBetweenStanceSwitches; // 0x1e30(0x04)
	char pad_1E34[0x4]; // 0x1e34(0x04)
	struct FMulticastInlineDelegate OnAggressiveStanceChanged; // 0x1e38(0x10)
	struct FMulticastInlineDelegate OnPlayingFullBodyIdleBreakerStateChanged; // 0x1e48(0x10)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x1e58(0x08)
	struct ARBNPC* NPC; // 0x1e60(0x08)
	bool IsKnockedDown; // 0x1e68(0x01)
	bool AggressiveStance; // 0x1e69(0x01)
	bool bIsInDarkness; // 0x1e6a(0x01)
	bool IsPassingUnderDoorFrame; // 0x1e6b(0x01)
	bool OverrideRightArm; // 0x1e6c(0x01)
	bool bCombatMovementActive; // 0x1e6d(0x01)
	char pad_1E6E[0x2]; // 0x1e6e(0x02)
	float CombatMovementPlayRate; // 0x1e70(0x04)
	float PlayRateForMovementBlendspaces; // 0x1e74(0x04)
	bool IsCrouchingUnderSomething; // 0x1e78(0x01)
	bool IsCrouchingUnderShort; // 0x1e79(0x01)
	bool IsCrouchingUnderSomethingQuickly; // 0x1e7a(0x01)
	char pad_1E7B[0x5]; // 0x1e7b(0x05)
	struct FCrouchUnderAnimRefs CrouchUnderLong; // 0x1e80(0x20)
	struct FCrouchUnderAnimRefs CrouchUnderShort; // 0x1ea0(0x20)
	bool IsPlayingAmbientIdle; // 0x1ec0(0x01)
	bool IsPlayingAmbientIdleBlendspace; // 0x1ec1(0x01)
	bool bShouldExitAmbientIdle; // 0x1ec2(0x01)
	bool bIsAmbientIdleActiveState; // 0x1ec3(0x01)
	char pad_1EC4[0x4]; // 0x1ec4(0x04)
	struct UAnimSequence* AmbientIdleSequence; // 0x1ec8(0x08)
	struct UBlendSpaceBase* AmbientIdleBlendSpace; // 0x1ed0(0x08)
	struct UAnimSequence* AmbientExitSequence; // 0x1ed8(0x08)
	struct UBlendSpaceBase* AmbientIdleActive; // 0x1ee0(0x08)
	struct UBlendSpaceBase* AmbientIdlePassiveToActive; // 0x1ee8(0x08)
	struct UBlendSpaceBase* AmbientIdleActiveToPassive; // 0x1ef0(0x08)
	float AmbientIdleRelativeYaw; // 0x1ef8(0x04)
	float AmbientIdleRelativePitch; // 0x1efc(0x04)
	struct USkeletalMeshComponent* GhostStationSkeletalMeshTarget; // 0x1f00(0x08)
	bool IsInGhostStation; // 0x1f08(0x01)
	bool GhostStationExitRequested; // 0x1f09(0x01)
	bool ExitGhostStationImmediately; // 0x1f0a(0x01)
	bool IsLooking; // 0x1f0b(0x01)
	float LookAtAlpha; // 0x1f0c(0x04)
	float LookAtOwnership; // 0x1f10(0x04)
	float LookatInvestigationAlpha; // 0x1f14(0x04)
	float LookatInvestigationPercentage; // 0x1f18(0x04)
	float LookAtYaw; // 0x1f1c(0x04)
	float LookAtPitch; // 0x1f20(0x04)
	bool IsPlayingInvestigate; // 0x1f24(0x01)
	char pad_1F25[0x3]; // 0x1f25(0x03)
	struct UAnimSequence* InvestigationSequence; // 0x1f28(0x08)
	bool IsRelaxed; // 0x1f30(0x01)
	bool IsSuspicious; // 0x1f31(0x01)
	bool IsAlerted; // 0x1f32(0x01)
	bool IsChase; // 0x1f33(0x01)
	bool IsInCombat; // 0x1f34(0x01)
	bool IsProwling; // 0x1f35(0x01)
	enum class ENPCAnimStyle AnimStyle; // 0x1f36(0x01)
	bool bAnimatedStartIsBlend; // 0x1f37(0x01)
	struct UAnimSequence* StartSequence; // 0x1f38(0x08)
	struct UBlendSpaceBase* AnimatedStartBlendSpace; // 0x1f40(0x08)
	float StartSequenceAnimationPlayRate; // 0x1f48(0x04)
	float StartAnimationTargetSpeed; // 0x1f4c(0x04)
	enum class ELocomotionMovementSpeed StartMovementSpeed; // 0x1f50(0x01)
	enum class ELocomotionTurnDirection StartTurnDirection; // 0x1f51(0x01)
	char pad_1F52[0x2]; // 0x1f52(0x02)
	float ActualStartDeltaYaw; // 0x1f54(0x04)
	bool ShouldPlayAnimatedStart; // 0x1f58(0x01)
	char pad_1F59[0x8]; // 0x1f59(0x08)
	bool bAnimatedStopIsBlendSpace; // 0x1f61(0x01)
	char pad_1F62[0x6]; // 0x1f62(0x06)
	struct UAnimSequence* StopSequence; // 0x1f68(0x08)
	struct UBlendSpaceBase* AnimatedStopBlendSpace; // 0x1f70(0x08)
	enum class ELocomotionMovementSpeed StopMovementSpeed; // 0x1f78(0x01)
	enum class ELocomotionTurnDirection StopTurnDirection; // 0x1f79(0x01)
	char pad_1F7A[0x2]; // 0x1f7a(0x02)
	float StopSequenceAnimationPlayRate; // 0x1f7c(0x04)
	float StopSequenceAnimationStartTime; // 0x1f80(0x04)
	bool ShouldPlayAnimatedStop; // 0x1f84(0x01)
	char pad_1F85[0x1b]; // 0x1f85(0x1b)
	bool FoundStateMachineStuff; // 0x1fa0(0x01)
	char pad_1FA1[0x3]; // 0x1fa1(0x03)
	int32_t LocomotionStateMachineIndex; // 0x1fa4(0x04)
	int32_t StateIndexForStarts; // 0x1fa8(0x04)
	int32_t StateIndexForStops; // 0x1fac(0x04)
	float LocomotionBlendValue; // 0x1fb0(0x04)
	float StartBlendValue; // 0x1fb4(0x04)
	float StopBlendValue; // 0x1fb8(0x04)
	bool IsPlayingStartle; // 0x1fbc(0x01)
	bool IsPlayingStartleSequence; // 0x1fbd(0x01)
	bool IsPlayingStartleReaction; // 0x1fbe(0x01)
	char pad_1FBF[0x1]; // 0x1fbf(0x01)
	struct UAnimSequence* StartleSequence; // 0x1fc0(0x08)
	struct UAnimSequence* StartleReactionSequence; // 0x1fc8(0x08)
	char pad_1FD0[0x4]; // 0x1fd0(0x04)
	bool bStatusEffectIdleIsBlendSpace; // 0x1fd4(0x01)
	char pad_1FD5[0x3]; // 0x1fd5(0x03)
	struct UAnimSequence* StatusEffectIdleSequence; // 0x1fd8(0x08)
	struct UBlendSpaceBase* StatusEffectIdleBlendSpace; // 0x1fe0(0x08)
	bool bStatusEffectMovementIsBlendSpace; // 0x1fe8(0x01)
	char pad_1FE9[0x7]; // 0x1fe9(0x07)
	struct UAnimSequence* StatusEffectMovementSequence; // 0x1ff0(0x08)
	struct UBlendSpaceBase* StatusEffectMovementBlendSpace; // 0x1ff8(0x08)
	bool AffectedByStatusEffect; // 0x2000(0x01)
	bool AffectedByBlind; // 0x2001(0x01)
	bool LeaveBlindRequested; // 0x2002(0x01)
	bool BlindStateMachineSwitch; // 0x2003(0x01)
	bool BlindAgitated; // 0x2004(0x01)
	char pad_2005[0x3]; // 0x2005(0x03)
	struct UAnimSequence* BlindSequence_A; // 0x2008(0x08)
	struct UAnimSequence* BlindSequence_B; // 0x2010(0x08)
	struct UAnimMontage* MainIdleBreaker; // 0x2018(0x08)
	bool bPlayingFullBodyIdleBreaker; // 0x2020(0x01)
	char pad_2021[0x77]; // 0x2021(0x77)
	struct UAnimSequence* ForcedAttackSequence; // 0x2098(0x08)
	char pad_20A0[0x20]; // 0x20a0(0x20)

	bool IsPlayingSpecialAnimState(); // Function OPP.RBAnimInstanceNPC.IsPlayingSpecialAnimState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d003c4
	void Event_OnInDarknessChanged(); // Function OPP.RBAnimInstanceNPC.Event_OnInDarknessChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBAnimInstanceNPCBig
// Size: 0x20e0 (Inherited: 0x20c0)
struct URBAnimInstanceNPCBig : URBAnimInstanceNPC {
	bool bDetectsCeiling; // 0x20c0(0x01)
	char pad_20C1[0x3]; // 0x20c1(0x03)
	struct FRotator CeilingBendRotation; // 0x20c4(0x0c)
	struct FVector CeilingMoveDown; // 0x20d0(0x0c)
	char pad_20DC[0x4]; // 0x20dc(0x04)
};

// Class OPP.RBAnimInstancePlayer
// Size: 0xf80 (Inherited: 0x900)
struct URBAnimInstancePlayer : URBAnimInstance {
	float MinimumSpectreDistance; // 0x900(0x04)
	float MaximumSpectreDistance; // 0x904(0x04)
	float MinimumSpectreLookatDot; // 0x908(0x04)
	float MaximumSpectreLookatDot; // 0x90c(0x04)
	struct UBlendSpaceBase* GrabReaction; // 0x910(0x08)
	float GrabReactionLength; // 0x918(0x04)
	char pad_91C[0x4]; // 0x91c(0x04)
	struct FTurningOnSpotData TurningDataStanding; // 0x920(0x60)
	struct FTurningOnSpotData TurningDataCrouched; // 0x980(0x60)
	struct FTurningOnSpotData TurningDataDowned; // 0x9e0(0x60)
	struct UAimOffsetBlendSpace1D* CurrentTurnOnSpotLookAimSpace; // 0xa40(0x08)
	float LookAtInterpolationSpeed; // 0xa48(0x04)
	char pad_A4C[0x4]; // 0xa4c(0x04)
	struct UAnimSequence* StartKnockdownSlidingSequence; // 0xa50(0x08)
	struct UAnimSequence* StopKnockdownSlidingSequence; // 0xa58(0x08)
	struct UAnimSequence* EmoteTemporaryHelloAnimation; // 0xa60(0x08)
	float HorizontalPeekingAnimationLength; // 0xa68(0x04)
	char pad_A6C[0x14]; // 0xa6c(0x14)
	struct ARBPlayer* RBPlayer; // 0xa80(0x08)
	bool IsFirstPerson; // 0xa88(0x01)
	bool bIsLocallyControlled; // 0xa89(0x01)
	bool IsBeingChased; // 0xa8a(0x01)
	bool IsCrawling; // 0xa8b(0x01)
	bool IsPushing; // 0xa8c(0x01)
	bool IsPushingOnRails; // 0xa8d(0x01)
	bool IsPushingHard; // 0xa8e(0x01)
	char pad_A8F[0x1]; // 0xa8f(0x01)
	struct USceneComponent* PushableIKTarget; // 0xa90(0x08)
	bool bUsingIK; // 0xa98(0x01)
	char pad_A99[0x3]; // 0xa99(0x03)
	struct FVector IKTargetPosition; // 0xa9c(0x0c)
	struct FRotator IKTargetRotation; // 0xaa8(0x0c)
	char pad_AB4[0xc]; // 0xab4(0x0c)
	struct FTransform IKTargetTransform; // 0xac0(0x30)
	float HandIKInterpolationSpeed; // 0xaf0(0x04)
	float ShouldMoveHandIKRoot; // 0xaf4(0x04)
	float UseHandIK; // 0xaf8(0x04)
	bool bIsJumping; // 0xafc(0x01)
	enum class ELocomotionMode nextLocomotionMode; // 0xafd(0x01)
	char pad_AFE[0x2]; // 0xafe(0x02)
	float JumpAngle; // 0xb00(0x04)
	enum class EJumpType JumpType; // 0xb04(0x01)
	char pad_B05[0x3]; // 0xb05(0x03)
	float JumpTimestamp; // 0xb08(0x04)
	bool IsLookingAtWatch; // 0xb0c(0x01)
	char pad_B0D[0x3]; // 0xb0d(0x03)
	struct FTransform CameraTransformRelativeToTheCameraBoneOnThePreviousFrame; // 0xb10(0x30)
	float ViewPitchSmoothSpeed; // 0xb40(0x04)
	float ViewPitchSmoothed; // 0xb44(0x04)
	float BodyAwarenessArmBlend; // 0xb48(0x04)
	float BodyAwarenessLeftArmBlend; // 0xb4c(0x04)
	float BodyAwarenessIKHandsChestBlend; // 0xb50(0x04)
	float BodyAwarenessRightArmBlend; // 0xb54(0x04)
	float InverseBodyAwarenessArmBlend; // 0xb58(0x04)
	bool IsHallucinating; // 0xb5c(0x01)
	char pad_B5D[0x3]; // 0xb5d(0x03)
	float HallucinationEffectIntensity; // 0xb60(0x04)
	char pad_B64[0x4]; // 0xb64(0x04)
	struct UAnimMontage* ItemIdleBreaker; // 0xb68(0x08)
	struct FItemSequences ItemAnimData; // 0xb70(0xa8)
	struct FItemSequences ItemAnimDataDown; // 0xc18(0xa8)
	bool ItemHolstered; // 0xcc0(0x01)
	char pad_CC1[0x3]; // 0xcc1(0x03)
	float ItemConsumePlayRate; // 0xcc4(0x04)
	bool IsInItemGraph; // 0xcc8(0x01)
	char pad_CC9[0x3]; // 0xcc9(0x03)
	float ShouldCradleLargeObject; // 0xccc(0x04)
	float ShouldCradleLargeObjectInterpolationSpeed; // 0xcd0(0x04)
	bool ShouldSwapItem; // 0xcd4(0x01)
	bool ShouldDropItem; // 0xcd5(0x01)
	bool bLastIsItemTemporarelyHidden; // 0xcd6(0x01)
	char pad_CD7[0x1]; // 0xcd7(0x01)
	struct ARBPickup* LastSelectedItem; // 0xcd8(0x08)
	struct TArray<struct ARBPickup*> ItemsToSwap; // 0xce0(0x10)
	struct FItemSequences NextItemAnimData; // 0xcf0(0xa8)
	struct FItemSequences NextItemAnimDataDown; // 0xd98(0xa8)
	struct UAnimSequence* ItemHandInteractReadyStart; // 0xe40(0x08)
	struct UAnimSequence* ItemHandInteractReadyPose; // 0xe48(0x08)
	struct UAnimSequence* ItemHandInteractReadyStop; // 0xe50(0x08)
	struct UAnimSequence* ItemHandPose; // 0xe58(0x08)
	struct UAnimSequence* ItemHandBreaker; // 0xe60(0x08)
	bool IsGivingItem; // 0xe68(0x01)
	bool ShouldPlayEquipAnim; // 0xe69(0x01)
	bool ShouldSkipUnequipAnim; // 0xe6a(0x01)
	bool IsHoldingItemSpecificallyRequiredForInteraction; // 0xe6b(0x01)
	bool IsPreparingToThrowItem; // 0xe6c(0x01)
	bool IsConsumingItem; // 0xe6d(0x01)
	char pad_E6E[0x7]; // 0xe6e(0x07)
	bool IsPlayingNightVisionAnimation; // 0xe75(0x01)
	char pad_E76[0x2]; // 0xe76(0x02)
	float NVAnimationTime; // 0xe78(0x04)
	char pad_E7C[0x4]; // 0xe7c(0x04)
	struct UAnimSequence* ArmNVAnimation; // 0xe80(0x08)
	struct UBlendSpaceBase* ArmNVAnimationBlend; // 0xe88(0x08)
	bool IsOpeningDoorSlowly; // 0xe90(0x01)
	bool IsOpeningDoorSlowlyOnTheLeftSide; // 0xe91(0x01)
	char pad_E92[0x2]; // 0xe92(0x02)
	float DoorOpeningRatio; // 0xe94(0x04)
	bool IsDoingCoopMove; // 0xe98(0x01)
	bool IsHailingForCoopMove; // 0xe99(0x01)
	bool IsHailingSpecific; // 0xe9a(0x01)
	bool IsHailingGeneric; // 0xe9b(0x01)
	bool IsHailingForLegUp; // 0xe9c(0x01)
	bool IsHailingForLedgePull; // 0xe9d(0x01)
	bool IsHailingForLongJump_Catch; // 0xe9e(0x01)
	bool IsHailingForLongJump_Toss_Right; // 0xe9f(0x01)
	bool IsHailingForLongJump_Toss_Left; // 0xea0(0x01)
	bool IsHailingForCoopBash; // 0xea1(0x01)
	bool IsHailingForCoopBashOnRightSide; // 0xea2(0x01)
	bool IsDoingDoorLift; // 0xea3(0x01)
	bool IsDoingLedgeCatch; // 0xea4(0x01)
	char pad_EA5[0x3]; // 0xea5(0x03)
	float PeekingHorizontal; // 0xea8(0x04)
	float PeekingVertical; // 0xeac(0x04)
	bool IsPeeking; // 0xeb0(0x01)
	char pad_EB1[0x3]; // 0xeb1(0x03)
	float InitialStoppedYaw; // 0xeb4(0x04)
	float CurrentOffsetFromStoppedYaw; // 0xeb8(0x04)
	float TargetTurnYaw; // 0xebc(0x04)
	float StoppedLookOffset; // 0xec0(0x04)
	float StoppedLookOffsetTarget; // 0xec4(0x04)
	float TimeStartedTurning; // 0xec8(0x04)
	float TimeStoppedTurning; // 0xecc(0x04)
	struct FRotator StoppedLookOffsetRotator; // 0xed0(0x0c)
	float DesireToTurn; // 0xedc(0x04)
	float LookDirectionHorizontal; // 0xee0(0x04)
	float LookDirectionVertical; // 0xee4(0x04)
	float HailingLookDirectionHorizontal; // 0xee8(0x04)
	float HailingLookDirectionVertical; // 0xeec(0x04)
	char pad_EF0[0x4]; // 0xef0(0x04)
	bool RightArm_Locomotion_To_Combined; // 0xef4(0x01)
	bool RightArm_Combined_To_Locomotion; // 0xef5(0x01)
	char pad_EF6[0x2]; // 0xef6(0x02)
	int32_t LocomotionStateMachine; // 0xef8(0x04)
	int32_t LocomotionStateMachine_Jumping; // 0xefc(0x04)
	int32_t AliveStateMachine; // 0xf00(0x04)
	int32_t AliveStateMachine_StopSlideUnder; // 0xf04(0x04)
	int32_t AliveStateMachine_SlideHitWallExit; // 0xf08(0x04)
	bool Locomotion_Jumping_To_Alive; // 0xf0c(0x01)
	bool LeftArm_Locomotion_To_Combined; // 0xf0d(0x01)
	bool LeftArm_Combined_To_Locomotion; // 0xf0e(0x01)
	bool Alive_StopSlideUnder_To_Stand; // 0xf0f(0x01)
	bool Alive_StopSlideUnder_To_Crouch; // 0xf10(0x01)
	bool Alive_SlideHitWallExit_To_Stand; // 0xf11(0x01)
	bool Alive_SlideHitWallExit_To_Crouch; // 0xf12(0x01)
	bool IsPlayingRandomIdle; // 0xf13(0x01)
	float PlayerStand_LargeObject_1P_PlaySpeed; // 0xf14(0x04)
	float Item_Items_Item_Normal_Hold_Blend; // 0xf18(0x04)
	float Item_Items_Item_Down_Hold_Blend; // 0xf1c(0x04)
	float HidingSpotPeeking_CameraRelative_RightArm; // 0xf20(0x04)
	float HidingSpotPeeking_CameraRelative_LeftArm; // 0xf24(0x04)
	bool IsPeekingAtAll; // 0xf28(0x01)
	char pad_F29[0x3]; // 0xf29(0x03)
	float IsPeekingAtAllAsFloat; // 0xf2c(0x04)
	float PeekWalkingPlayRate; // 0xf30(0x04)
	bool IsPeekingLeft; // 0xf34(0x01)
	bool IsPeekingFullyLeft; // 0xf35(0x01)
	bool IsPeekingFullyRight; // 0xf36(0x01)
	char pad_F37[0x1]; // 0xf37(0x01)
	float AbsolutePeeking; // 0xf38(0x04)
	float AbsoluteHorizontalPeekingValue; // 0xf3c(0x04)
	bool NotInAirOrLanding; // 0xf40(0x01)
	bool IsLandingFastEnoughToBeIntense; // 0xf41(0x01)
	bool IsLandingFromJumpOver; // 0xf42(0x01)
	bool IsPlayingNormalIdle; // 0xf43(0x01)
	bool bIsInHidingSpotAndNotGrabbed; // 0xf44(0x01)
	char pad_F45[0x3]; // 0xf45(0x03)
	float NormalWalkingPlayRateForBlendspaces; // 0xf48(0x04)
	float ChaseWalkingPlayRateForBlendspaces; // 0xf4c(0x04)
	float DownedLocomotionPlaybackSpeed; // 0xf50(0x04)
	float IsHoldingLargeItemAsFloat; // 0xf54(0x04)
	bool IsStationaryAndOnStairs; // 0xf58(0x01)
	bool IsKnockedDownAndSliding; // 0xf59(0x01)
	char pad_F5A[0x1e]; // 0xf5a(0x1e)
	struct UAnimMontage* TurnAnimMontage; // 0xf78(0x08)

	void UpdateItemAnimData(); // Function OPP.RBAnimInstancePlayer.UpdateItemAnimData // (Final|Native|Public|BlueprintCallable) // @ game+0x1d06520
	void SwapInventoryItemAnimationsToNextItem(); // Function OPP.RBAnimInstancePlayer.SwapInventoryItemAnimationsToNextItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1d0650c
	void SetNextInventoryMontageTime(); // Function OPP.RBAnimInstancePlayer.SetNextInventoryMontageTime // (Final|Native|Public|BlueprintCallable) // @ game+0x1d064f8
	void OnWantsNightVisionChanged(bool bOn); // Function OPP.RBAnimInstancePlayer.OnWantsNightVisionChanged // (Final|Native|Public) // @ game+0x1d0647c
	void HideSwappedItems(); // Function OPP.RBAnimInstancePlayer.HideSwappedItems // (Final|Native|Public|BlueprintCallable) // @ game+0x1d06468
	struct ARBPickup* GetItemHeld(); // Function OPP.RBAnimInstancePlayer.GetItemHeld // (Final|Native|Public|BlueprintCallable) // @ game+0x1d06444
	void ClearNightVisionAnimation(); // Function OPP.RBAnimInstancePlayer.ClearNightVisionAnimation // (Final|Native|Public) // @ game+0x1d0642c
	void ClearItemAnimData(); // Function OPP.RBAnimInstancePlayer.ClearItemAnimData // (Final|Native|Public|BlueprintCallable) // @ game+0x1d06408
};

// Class OPP.RBAnimInstancePlayer3P
// Size: 0xfc0 (Inherited: 0xf80)
struct URBAnimInstancePlayer3P : URBAnimInstancePlayer {
	int32_t RightHandBoneIndex; // 0xf80(0x04)
	struct FVector RightHandBoneLocation; // 0xf84(0x0c)
	struct FRotator RightHandBoneRotation; // 0xf90(0x0c)
	int32_t LeftHandBoneIndex; // 0xf9c(0x04)
	struct FVector LeftHandBoneLocation; // 0xfa0(0x0c)
	struct FRotator LeftHandBoneRotation; // 0xfac(0x0c)
	struct USkeletalMeshComponent* FirstPersonMesh; // 0xfb8(0x08)
};

// Class OPP.RBAnimManager
// Size: 0x1e0 (Inherited: 0x28)
struct URBAnimManager : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct TMap<struct UAnimSequence*, struct FTransform> CachedSequenceRootMotion; // 0x30(0x50)
	struct TMap<struct UAnimSequence*, struct FTransform> CachedAnchors; // 0x80(0x50)
	struct TMap<struct UAnimSequence*, float> GlobalAnimLastPlayTime; // 0xd0(0x50)
	struct TArray<struct FWorldDisturbanceData> DisturbanceData; // 0x120(0x10)
	struct TArray<struct FPawnAnimOptimData> PawnAnimOptimData; // 0x130(0x10)
	struct TArray<struct FSkelMeshActorOptimData> SkelMeshActorOptimData; // 0x140(0x10)
	struct FAnimCategoryStats AnimStats[0x9]; // 0x150(0x90)
};

// Class OPP.RBAnimNotify_Traversal
// Size: 0x50 (Inherited: 0x38)
struct URBAnimNotify_Traversal : UAnimNotify {
	enum class ETraversalNotifyType notifyType; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	struct FVector Value; // 0x3c(0x0c)
	float blendTime; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class OPP.RBAnimNotify_SpecialMove
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_SpecialMove : UAnimNotify {
	enum class ESpecialMoveNotifyType notifyType; // 0x38(0x01)
	enum class ESpecialMoveNotifyTriggerType NotifyTriggerType; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class OPP.RBAnimNotify_Footstep
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_Footstep : UAnimNotify {
	bool bLeftFoot; // 0x38(0x01)
	bool bPreviewAsRun; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class OPP.RBAnimNotify_FootDown
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotify_FootDown : UAnimNotifyState {
	bool bLeftFoot; // 0x30(0x01)
	bool bPlayFootstep; // 0x31(0x01)
	bool bPreviewAsRun; // 0x32(0x01)
	char pad_33[0x5]; // 0x33(0x05)
};

// Class OPP.RBAnimNotify_AttackDamage
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_AttackDamage : UAnimNotify {
	bool bSplitDamageAcrossHits; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class OPP.RBAnimNotifyState_ContinuousAttackDamage
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotifyState_ContinuousAttackDamage : UAnimNotifyState {
	bool bSplitDamageAcrossHits; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class OPP.RBAnimNotify_PlayWeaponAnim
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_PlayWeaponAnim : UAnimNotify {
};

// Class OPP.RBAnimNotify_DamageWindow
// Size: 0x48 (Inherited: 0x30)
struct URBAnimNotify_DamageWindow : UAnimNotifyState {
	bool IsWeaponHit; // 0x30(0x01)
	enum class EDamageValue DamageValue; // 0x31(0x01)
	enum class EKnockbackValue Knockback; // 0x32(0x01)
	enum class EDamageVolumeType VolumeType; // 0x33(0x01)
	char pad_34[0x4]; // 0x34(0x04)
	struct FString SpecificVolumeName; // 0x38(0x10)
};

// Class OPP.RBAnimNotify_GrabWindow
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotify_GrabWindow : UAnimNotifyState {
	enum class EDamageVolumeType VolumeType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class OPP.RBAnimNotify_SpecialAttackWindow
// Size: 0x30 (Inherited: 0x30)
struct URBAnimNotify_SpecialAttackWindow : UAnimNotifyState {
};

// Class OPP.RBAnimNotify_ThirdPersonView
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_ThirdPersonView : UAnimNotify {
	bool bThirdPersonView; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class OPP.RBAnimNotify_ThirdPersonViewWindow
// Size: 0x30 (Inherited: 0x30)
struct URBAnimNotify_ThirdPersonViewWindow : UAnimNotifyState {
};

// Class OPP.RBAnimNotify_AttachInteractionComponent
// Size: 0x48 (Inherited: 0x30)
struct URBAnimNotify_AttachInteractionComponent : UAnimNotifyState {
	struct FName ComponentTag; // 0x30(0x08)
	struct FName SocketName; // 0x38(0x08)
	bool SnapToSocket; // 0x40(0x01)
	bool ReturnTransformToOriginalLocation; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class OPP.RBAnimNotify_DrugTarget
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotify_DrugTarget : UAnimNotifyState {
	bool bInterruptible; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class OPP.RBAnimNotify_FoleySound
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_FoleySound : UAnimNotify {
	enum class ERBFoleyType notifyType; // 0x38(0x01)
	bool bLocalPlayerOnly; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class OPP.RBAnimNotify_AkEvent
// Size: 0x48 (Inherited: 0x38)
struct URBAnimNotify_AkEvent : UAnimNotify {
	struct UAkAudioEvent* Event; // 0x38(0x08)
	bool bLocalPlayerOnly; // 0x40(0x01)
	bool bUpdateFloorMaterial; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class OPP.RBAnimNotify_InteractionSoundEvent
// Size: 0x50 (Inherited: 0x48)
struct URBAnimNotify_InteractionSoundEvent : URBAnimNotify_AkEvent {
	bool bPlayOnInteractionActor; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// Class OPP.RBAnimNotify_VO
// Size: 0x48 (Inherited: 0x38)
struct URBAnimNotify_VO : UAnimNotify {
	struct UAkAudioEvent* Event; // 0x38(0x08)
	bool bLocalPlayerOnly; // 0x40(0x01)
	bool bPlayOnWatch; // 0x41(0x01)
	enum class EVOPriority VOPriority; // 0x42(0x01)
	char pad_43[0x5]; // 0x43(0x05)
};

// Class OPP.RBAnimNotifyState_AttachNewObject
// Size: 0x90 (Inherited: 0x30)
struct URBAnimNotifyState_AttachNewObject : UAnimNotifyState {
	struct AActor* ActorClass; // 0x30(0x08)
	struct UStaticMesh* StaticMesh; // 0x38(0x08)
	struct USkeletalMesh* SkeletalMesh; // 0x40(0x08)
	struct FName SocketName; // 0x48(0x08)
	struct FTransform RelativeTransform; // 0x50(0x30)
	struct UObject* SpawnedEditorObject; // 0x80(0x08)
	char pad_88[0x8]; // 0x88(0x08)
};

// Class OPP.RBAnimNotify_AttachObject
// Size: 0x48 (Inherited: 0x38)
struct URBAnimNotify_AttachObject : UAnimNotify {
	struct FName SocketName; // 0x38(0x08)
	float blendTime; // 0x40(0x04)
	bool bDetach; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// Class OPP.RBAnimNotify_DetachPairedPawnCollision
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_DetachPairedPawnCollision : UAnimNotify {
};

// Class OPP.RBAnimNotify_PlayLargeObjectSequence
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_PlayLargeObjectSequence : UAnimNotify {
	struct UAnimSequence* Sequence; // 0x38(0x08)
};

// Class OPP.RBAnimNotify_SwapItem
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_SwapItem : UAnimNotify {
};

// Class OPP.RBAnimNotifyState_HideItemInHand
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotifyState_HideItemInHand : UAnimNotifyState {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class OPP.RBAnimNotifyState_PlayerDepthRenderOverride
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotifyState_PlayerDepthRenderOverride : UAnimNotifyState {
	bool bRenderInForeground; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class OPP.RBAnimNotify_BlendOutControlState
// Size: 0x48 (Inherited: 0x30)
struct URBAnimNotify_BlendOutControlState : UAnimNotifyState {
	float blendOutDuration; // 0x30(0x04)
	bool bPlayerInputBlendOut; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	struct TArray<enum class ESpecialMove> AllowedSpecialMove; // 0x38(0x10)
};

// Class OPP.RBAnimNotify_NPCBlendOut
// Size: 0x48 (Inherited: 0x38)
struct URBAnimNotify_NPCBlendOut : UAnimNotify {
	enum class NPCBlendOutCondition Conditon; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float blendOutDuration; // 0x3c(0x04)
	float EndVelocityRatio; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class OPP.RBAnimNotify_NPCCompleteSpecialMove
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_NPCCompleteSpecialMove : UAnimNotify {
};

// Class OPP.RBAnimNotifyState_ProceduralAdjustment
// Size: 0x30 (Inherited: 0x30)
struct URBAnimNotifyState_ProceduralAdjustment : UAnimNotifyState {
};

// Class OPP.RBAnimNotifyState_EyeClosedEffect
// Size: 0x30 (Inherited: 0x30)
struct URBAnimNotifyState_EyeClosedEffect : UAnimNotifyState {
};

// Class OPP.RBAnimNotifyState_WeaponVFXControl
// Size: 0x40 (Inherited: 0x30)
struct URBAnimNotifyState_WeaponVFXControl : UAnimNotifyState {
	float DesiredIntensity; // 0x30(0x04)
	float RampUpRate; // 0x34(0x04)
	float RampDownRate; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class OPP.RBAnimNotify_DoorAction
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_DoorAction : UAnimNotify {
	enum class EDoorActionType actionType; // 0x38(0x01)
	bool bDriveDoorRotation; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class OPP.RBAnimNotify_DamagePlayer
// Size: 0x48 (Inherited: 0x38)
struct URBAnimNotify_DamagePlayer : UAnimNotify {
	enum class EPlayerDamageSetting DamageSetting; // 0x38(0x01)
	bool bSplitDamageAcrossHits; // 0x39(0x01)
	bool bBloodParticles; // 0x3a(0x01)
	bool bScreenBloodColumns; // 0x3b(0x01)
	float SpecificDamageAmount; // 0x3c(0x04)
	enum class EHurtVOType HurtVOType; // 0x40(0x01)
	enum class EDamageType DamageType; // 0x41(0x01)
	enum class EDamageSoundMaterial DamageSoundMaterialOverride; // 0x42(0x01)
	char bOverride_DamageSoundMaterial : 1; // 0x43(0x01)
	char pad_43_1 : 7; // 0x43(0x01)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class OPP.RBAnimNotify_DisablePlayerMovement
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotify_DisablePlayerMovement : UAnimNotifyState {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class OPP.RBAnimNotify_AttackDistanceMeasureFrame
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_AttackDistanceMeasureFrame : UAnimNotify {
};

// Class OPP.RBAnimNotify_ImportantRootMotionDone
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_ImportantRootMotionDone : UAnimNotify {
};

// Class OPP.RBAnimNotify_MinimumStopDistance
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_MinimumStopDistance : UAnimNotify {
};

// Class OPP.RBAnimNotify_AdjustmentLimit
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_AdjustmentLimit : UAnimNotify {
};

// Class OPP.RBAnimNotify_StartleFailsafe
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_StartleFailsafe : UAnimNotify {
};

// Class OPP.RBAnimNotify_StartleInterruptible
// Size: 0x30 (Inherited: 0x30)
struct URBAnimNotify_StartleInterruptible : UAnimNotifyState {
};

// Class OPP.RBAnimNotify_BranchPoint
// Size: 0x48 (Inherited: 0x38)
struct URBAnimNotify_BranchPoint : UAnimNotify {
	struct FString BranchName; // 0x38(0x10)
};

// Class OPP.RBAnimNotify_PlayItemSequence
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_PlayItemSequence : UAnimNotify {
	struct UAnimSequenceBase* ObjectSequence; // 0x38(0x08)
};

// Class OPP.RBAnimNotify_PlayRigSequence
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_PlayRigSequence : UAnimNotify {
	struct UAnimSequenceBase* ObjectSequence; // 0x38(0x08)
};

// Class OPP.RBAnimNotify_HideWeapon
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_HideWeapon : UAnimNotify {
};

// Class OPP.RBAnimNotify_UnhideWeapon
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_UnhideWeapon : UAnimNotify {
};

// Class OPP.RBAnimNotify_ActivateWeaponEffects
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_ActivateWeaponEffects : UAnimNotify {
};

// Class OPP.RBAnimNotify_DeactivateWeaponEffects
// Size: 0x38 (Inherited: 0x38)
struct URBAnimNotify_DeactivateWeaponEffects : UAnimNotify {
};

// Class OPP.RBAnimNotify_GhostEvent
// Size: 0x48 (Inherited: 0x38)
struct URBAnimNotify_GhostEvent : UAnimNotify {
	enum class EGhostAnimEvent GhostAnimEvent; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	struct FName GhostAnimEventName; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class OPP.RBAnimNotify_PlayerCamera
// Size: 0x40 (Inherited: 0x30)
struct URBAnimNotify_PlayerCamera : UAnimNotifyState {
	enum class EPlayerCameraTargetBehavior TargetBehavior; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float ManualPitchValue; // 0x34(0x04)
	bool bForceEvenIfPlayerChangedPitch; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class OPP.RBAnimNotify_LoopingAkEvent
// Size: 0x58 (Inherited: 0x38)
struct URBAnimNotify_LoopingAkEvent : UAnimNotify {
	bool bVO; // 0x38(0x01)
	bool bStart; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct UAkAudioEvent* StartEvent; // 0x40(0x08)
	struct UAkAudioEvent* StopEvent; // 0x48(0x08)
	bool bLocalPlayerOnly; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class OPP.RBAnimNotify_StingerAkEvent
// Size: 0x48 (Inherited: 0x38)
struct URBAnimNotify_StingerAkEvent : UAnimNotify {
	struct UAkAudioEvent* StingerEvent; // 0x38(0x08)
	float StingerDistance; // 0x40(0x04)
	bool bForceOnAssociatedPlayer; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// Class OPP.RBAnimNotify_NightVision
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_NightVision : UAnimNotify {
	enum class ENightVisionAnimNotifyType Type; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class OPP.RBAnimNotify_Stamina
// Size: 0x40 (Inherited: 0x38)
struct URBAnimNotify_Stamina : UAnimNotify {
	struct UAkAudioEvent* EffortVoiceEvent; // 0x38(0x08)
};

// Class OPP.RBAnimNotify_ScrubbingAkEvent
// Size: 0x48 (Inherited: 0x30)
struct URBAnimNotify_ScrubbingAkEvent : UAnimNotifyState {
	struct UAkAudioEvent* ForwardEvent; // 0x30(0x08)
	struct UAkAudioEvent* BackwardEvent; // 0x38(0x08)
	bool bLocalPlayerOnly; // 0x40(0x01)
	bool bVO; // 0x41(0x01)
	enum class EVOPriority VOPriority; // 0x42(0x01)
	char pad_43[0x1]; // 0x43(0x01)
	float MinimumInterval; // 0x44(0x04)
};

// Class OPP.RBAnimNotify_PlayUnderwaterEffect
// Size: 0xa0 (Inherited: 0x90)
struct URBAnimNotify_PlayUnderwaterEffect : UAnimNotify_PlayNiagaraEffect {
	bool bTestEffect; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct UAkAudioEvent* AudioEvent; // 0x98(0x08)
};

// Class OPP.RBAnimNotify_InterruptibleState
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotify_InterruptibleState : UAnimNotifyState {
	enum class EInterruptibilityState State; // 0x30(0x01)
	bool bShoveable; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
};

// Class OPP.RBAnimNotify_HitReactionState
// Size: 0x38 (Inherited: 0x30)
struct URBAnimNotify_HitReactionState : UAnimNotifyState {
	enum class EHitReactionState State; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class OPP.RBAnimNotify_Death
// Size: 0xa0 (Inherited: 0x90)
struct URBAnimNotify_Death : UAnimNotify_PlayNiagaraEffect {
	struct UAkAudioEvent* DeathVOOverride; // 0x90(0x08)
	char pad_98[0x8]; // 0x98(0x08)
};

// Class OPP.ItemAnimRef
// Size: 0xd8 (Inherited: 0x30)
struct UItemAnimRef : UDataAsset {
	struct FItemSequences Sequences; // 0x30(0xa8)
};

// Class OPP.RBAnimReferences
// Size: 0x3400 (Inherited: 0x28)
struct URBAnimReferences : UObject {
	struct FRBAnimReferencesData AnimRefs; // 0x28(0x33c8)
	struct URBAnimReferences* Parent; // 0x33f0(0x08)
	bool bAutoFlagReplacements; // 0x33f8(0x01)
	char pad_33F9[0x7]; // 0x33f9(0x07)
};

// Class OPP.RBAnnouncer
// Size: 0x248 (Inherited: 0x248)
struct ARBAnnouncer : AActor {

	void Multicast_PlayVO(struct UAkAudioEvent* akEvent, enum class EVOBehavior Behavior, float prePlayQueueDelay, uint32_t RandomSeed); // Function OPP.RBAnnouncer.Multicast_PlayVO // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d0c644
};

// Class OPP.RBInteractionZoneComponent
// Size: 0x5f0 (Inherited: 0x4c0)
struct URBInteractionZoneComponent : UBoxComponent {
	char pad_4C0[0x60]; // 0x4c0(0x60)
	float MaxEyeInteractionDistance2D; // 0x520(0x04)
	float MaxEyeInteractionDistanceZ; // 0x524(0x04)
	float MinEyeInteractionDistanceZ; // 0x528(0x04)
	float MaxInteractionAngle; // 0x52c(0x04)
	float FarExtraForwardExtent; // 0x530(0x04)
	float FarExtraBackwardExtent; // 0x534(0x04)
	float FarExtraRightExtent; // 0x538(0x04)
	float FarExtraLeftExtent; // 0x53c(0x04)
	float FarExtraUpExtent; // 0x540(0x04)
	float FarExtraDownExtent; // 0x544(0x04)
	bool bEnabled; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)
	struct TArray<struct URBInteractionRequirement*> Requirements; // 0x550(0x10)
	bool bLinkToParentInteractible; // 0x560(0x01)
	enum class EInteractionPriority InteractionPriority; // 0x561(0x01)
	enum class EInteractionPriority UnmetRequirementsInteractionPriority; // 0x562(0x01)
	char pad_563[0x5]; // 0x563(0x05)
	struct FText InteractionText; // 0x568(0x18)
	struct FText DenyInteractionText; // 0x580(0x18)
	struct FVector PingIconOffset; // 0x598(0x0c)
	char pad_5A4[0x4]; // 0x5a4(0x04)
	struct FMulticastInlineDelegate OnEnabledChanged; // 0x5a8(0x10)
	char pad_5B8[0x20]; // 0x5b8(0x20)
	bool bCurrentlyEnabled; // 0x5d8(0x01)
	char pad_5D9[0x7]; // 0x5d9(0x07)
	struct UObject* Interactable; // 0x5e0(0x08)
	char pad_5E8[0x8]; // 0x5e8(0x08)

	void OnRep_CurrentlyEnabled(); // Function OPP.RBInteractionZoneComponent.OnRep_CurrentlyEnabled // (Native|Protected) // @ game+0x1d88f24
	void NotifySpecialMoveCompleted(struct ARBPawn* Pawn, enum class ESpecialMove completedMove, bool bInterrupted); // Function OPP.RBInteractionZoneComponent.NotifySpecialMoveCompleted // (Native|Event|Public|BlueprintEvent) // @ game+0x1d88b60
	bool MeetRequirements(struct ARBPlayer* interactor); // Function OPP.RBInteractionZoneComponent.MeetRequirements // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d88ad0
	bool IsEnabled(); // Function OPP.RBInteractionZoneComponent.IsEnabled // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d88aa8
	struct UObject* GetInteractableSafe(); // Function OPP.RBInteractionZoneComponent.GetInteractableSafe // (Final|Native|Public|BlueprintCallable) // @ game+0x1d888a0
	void Event_OnEnabledChanged(); // Function OPP.RBInteractionZoneComponent.Event_OnEnabledChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_SetEnabled(bool bInteractible); // Function OPP.RBInteractionZoneComponent.BP_SetEnabled // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d885e4
};

// Class OPP.RBInteractibleComponent
// Size: 0x600 (Inherited: 0x5f0)
struct URBInteractibleComponent : URBInteractionZoneComponent {
	float EquippedItemHideDelayOverride; // 0x5f0(0x04)
	float EquippedItemUnhideDelayOverride; // 0x5f4(0x04)
	char pad_5F8[0x8]; // 0x5f8(0x08)
};

// Class OPP.RBInteractiblePanelComponent
// Size: 0x7a0 (Inherited: 0x600)
struct URBInteractiblePanelComponent : URBInteractibleComponent {
	struct FVector AnchorOffset; // 0x5f8(0x0c)
	bool bCanInteractWhileHoldingLargeObject; // 0x604(0x01)
	bool bDoClearanceCheck; // 0x605(0x01)
	bool bFull360Interaction; // 0x606(0x01)
	bool bPlayAnimAfterAdjustPosition; // 0x607(0x01)
	bool bCancelOnFailedAdjustment; // 0x608(0x01)
	bool bIgnoreSelfCollision; // 0x609(0x01)
	bool bDisableCollisionsWhenInteracting; // 0x60a(0x01)
	bool bDisablePawnCollisionsWhenInteracting; // 0x60b(0x01)
	bool bManageActorOwnerTick; // 0x60c(0x01)
	struct FText OperatingText; // 0x610(0x18)
	struct FText OperatingTextGamepad; // 0x628(0x18)
	struct FVector2D CameraYawLimit; // 0x640(0x08)
	struct FVector2D CameraPitchLimit; // 0x648(0x08)
	bool bAllowLookBack; // 0x650(0x01)
	struct FVector LookBackOffset; // 0x654(0x0c)
	struct FVector AnimatedLookBackOffset; // 0x660(0x0c)
	bool bAllowPsychosisGasEffect; // 0x66c(0x01)
	bool bAllowPlayerDithering; // 0x66d(0x01)
	struct FMulticastInlineDelegate OnPanelActiveChanged; // 0x670(0x10)
	struct FMulticastInlineDelegate OnPawnInteractingChanged; // 0x680(0x10)
	struct FMulticastInlineDelegate OnPanelStarted; // 0x690(0x10)
	struct FMulticastInlineDelegate OnTickEnabledChanged; // 0x6a0(0x10)
	struct FMulticastInlineDelegate OnInProgressSpectatingStarted; // 0x6b0(0x10)
	struct FMulticastInlineDelegate OnInProgressSpectatingStopped; // 0x6c0(0x10)
	struct FMulticastInlineDelegate OnPawnSoftOperatingStarted; // 0x6d0(0x10)
	struct FMulticastInlineDelegate OnPawnSoftOperatingStopped; // 0x6e0(0x10)
	struct FMulticastInlineDelegate OnPawnPlaySpecialMoveAnimation; // 0x6f0(0x10)
	bool bPanelStarted; // 0x700(0x01)
	bool bPanelInUse; // 0x701(0x01)
	char pad_702[0x6]; // 0x702(0x06)
	struct URBGhostAnimInstance* GhostAnimationInstanceClass; // 0x708(0x08)
	bool bPanelActive; // 0x710(0x01)
	char pad_711[0x7]; // 0x711(0x07)
	struct FScheduledUObject pawnInteracting; // 0x718(0x88)

	void TryNotifyInteractorReady(struct ARBPlayer* interactor); // Function OPP.RBInteractiblePanelComponent.TryNotifyInteractorReady // (Final|Native|Public|BlueprintCallable) // @ game+0x1d8457c
	bool ShouldBPTick(); // Function OPP.RBInteractiblePanelComponent.ShouldBPTick // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1d8451c
	void SetPanelInUse_Server(bool bInPanelInUse); // Function OPP.RBInteractiblePanelComponent.SetPanelInUse_Server // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d843f8
	void OnRep_PawnInteracting(); // Function OPP.RBInteractiblePanelComponent.OnRep_PawnInteracting // (Native|Protected) // @ game+0x1d843cc
	void OnRep_PanelStarted(); // Function OPP.RBInteractiblePanelComponent.OnRep_PanelStarted // (Final|Native|Protected) // @ game+0x1d8439c
	void OnRep_PanelActive(); // Function OPP.RBInteractiblePanelComponent.OnRep_PanelActive // (Native|Protected) // @ game+0x1d84384
	void OnPawnInteractingChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBInteractiblePanelComponent.OnPawnInteractingChangedCallback // (Native|Public) // @ game+0x1d8429c
	void NotifyInteractorReady_Server(struct ARBPlayer* interactor); // Function OPP.RBInteractiblePanelComponent.NotifyInteractorReady_Server // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d840ac
	bool IsPanelActive(); // Function OPP.RBInteractiblePanelComponent.IsPanelActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d83f8c
	struct ARBPawn* GetPawnInteracting(); // Function OPP.RBInteractiblePanelComponent.GetPawnInteracting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d83dc4
	float GetInteractionProgressRatio(struct ARBPlayer* Player); // Function OPP.RBInteractiblePanelComponent.GetInteractionProgressRatio // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d83d18
	void BP_PanelGameplayDone(); // Function OPP.RBInteractiblePanelComponent.BP_PanelGameplayDone // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d83a30
	void BP_OnPawnInteractingChanged(struct ARBPawn* newPawnInteracting); // Function OPP.RBInteractiblePanelComponent.BP_OnPawnInteractingChanged // (Event|Protected|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBArmWreslingPanelComponent
// Size: 0x8a0 (Inherited: 0x7a0)
struct URBArmWreslingPanelComponent : URBInteractiblePanelComponent {
	char pad_7A0[0x8]; // 0x7a0(0x08)
	struct FText MashInteractionText; // 0x7a8(0x18)
	int32_t MaxConsecutiveHitsForZoneSize; // 0x7c0(0x04)
	float HitSuccessPushAmount; // 0x7c4(0x04)
	float HitFailPenalty; // 0x7c8(0x04)
	int32_t NumScoringSteps; // 0x7cc(0x04)
	struct TArray<float> HitZoneMultipliers; // 0x7d0(0x10)
	int32_t CursorRevolutionCount; // 0x7e0(0x04)
	float SuccessZoneSize; // 0x7e4(0x04)
	float SuccessZoneSizeMin; // 0x7e8(0x04)
	float SuccessZoneSizeMax; // 0x7ec(0x04)
	float SuccessZoneOffset; // 0x7f0(0x04)
	int32_t HitZoneIndex; // 0x7f4(0x04)
	int32_t MaxRevolutions; // 0x7f8(0x04)
	float CursorStartSpeed; // 0x7fc(0x04)
	float CursorMaxSpeed; // 0x800(0x04)
	float CursorSpeedIncreasePerRevolution; // 0x804(0x04)
	int32_t NumRevolutionsUntilMaxSpeed; // 0x808(0x04)
	float CursorWidth; // 0x80c(0x04)
	float InitialRevolutionCursorSpeed; // 0x810(0x04)
	float FakePlayerSuccessRate; // 0x814(0x04)
	struct FVector2D GameTimeCameraYawLimit; // 0x818(0x08)
	struct FVector2D GameTimeCameraPitchLimit; // 0x820(0x08)
	struct FVector2D WaitingCameraYawLimit; // 0x828(0x08)
	struct FVector2D WaitingCameraPitchLimit; // 0x830(0x08)
	float TauntMinimumInterval; // 0x838(0x04)
	char pad_83C[0x4]; // 0x83c(0x04)
	struct ARBArmWreslingTable* LinkedTable; // 0x840(0x08)
	float MatchStartPawnTime; // 0x848(0x04)
	float MatchStartServerTime; // 0x84c(0x04)
	struct FMulticastInlineDelegate InputSuccessCallback; // 0x850(0x10)
	struct FMulticastInlineDelegate InputFailCallback; // 0x860(0x10)
	struct FMulticastInlineDelegate UpdateEndZoneCallback; // 0x870(0x10)
	struct FMulticastInlineDelegate TauntCallback; // 0x880(0x10)
	char pad_890[0x10]; // 0x890(0x10)

	void UpdatePlayerCameraLimits(struct ARBArmWreslingTable* Table); // Function OPP.RBArmWreslingPanelComponent.UpdatePlayerCameraLimits // (Final|Native|Public) // @ game+0x1d0c8e0
	void UpdateEndZone(); // Function OPP.RBArmWreslingPanelComponent.UpdateEndZone // (Final|Native|Public) // @ game+0x1d0c8cc
	void OnRep_SuccessZoneOffset(); // Function OPP.RBArmWreslingPanelComponent.OnRep_SuccessZoneOffset // (Final|Native|Public) // @ game+0x1d0c8cc
	void OnRep_HitZoneIndex(); // Function OPP.RBArmWreslingPanelComponent.OnRep_HitZoneIndex // (Final|Native|Public) // @ game+0x1d0c8cc
	void OnLinkedTableChange(); // Function OPP.RBArmWreslingPanelComponent.OnLinkedTableChange // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Multicast_TauntEvent(struct ARBPawn* Pawn); // Function OPP.RBArmWreslingPanelComponent.Multicast_TauntEvent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d0c848
	bool IsPredictedPlayer(); // Function OPP.RBArmWreslingPanelComponent.IsPredictedPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c30c
	bool IsPlayer1(); // Function OPP.RBArmWreslingPanelComponent.IsPlayer1 // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c2ec
	bool IsArmWreslingTableCompleted(); // Function OPP.RBArmWreslingPanelComponent.IsArmWreslingTableCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c280
	bool IsArmWreslingRoundInProgress(); // Function OPP.RBArmWreslingPanelComponent.IsArmWreslingRoundInProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c260
	bool GetIsInputInProgress(); // Function OPP.RBArmWreslingPanelComponent.GetIsInputInProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c140
	float GetInputStartPosition(); // Function OPP.RBArmWreslingPanelComponent.GetInputStartPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c128
	float GetElapsedMatchTime(); // Function OPP.RBArmWreslingPanelComponent.GetElapsedMatchTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c0d8
	float GetCursorPosition(); // Function OPP.RBArmWreslingPanelComponent.GetCursorPosition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c09c
	void Debug_ForcePlayerExit(); // Function OPP.RBArmWreslingPanelComponent.Debug_ForcePlayerExit // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1521dbc
};

// Class OPP.RBArmWreslingTable
// Size: 0x3e0 (Inherited: 0x248)
struct ARBArmWreslingTable : AActor {
	float SuccessZoneOffsetMin; // 0x248(0x04)
	float SuccessZoneOffsetMax; // 0x24c(0x04)
	struct FArmWreslingPlayerRoundData player1RoundData; // 0x250(0x38)
	struct FArmWreslingPlayerRoundData player2RoundData; // 0x288(0x38)
	struct TArray<float> SuccessZoneOffsets; // 0x2c0(0x10)
	struct TSoftObjectPtr<AActor> Player1PanelActor; // 0x2d0(0x28)
	struct TSoftObjectPtr<AActor> Player2PanelActor; // 0x2f8(0x28)
	float MatchIntroTime; // 0x320(0x04)
	float MatchOutroTime; // 0x324(0x04)
	struct URBArmWreslingPanelComponent* Player1Panel; // 0x328(0x08)
	struct URBArmWreslingPanelComponent* Player2Panel; // 0x330(0x08)
	float MatchStartTimestamp; // 0x338(0x04)
	float MatchEndTimestamp; // 0x33c(0x04)
	struct ARBPlayer* Winner; // 0x340(0x08)
	struct ARBPlayer* Loser; // 0x348(0x08)
	struct ARBPlayer* Player1; // 0x350(0x08)
	struct ARBPlayer* Player2; // 0x358(0x08)
	float Player1WinRatio; // 0x360(0x04)
	bool bRoundCompleted; // 0x364(0x01)
	bool bGameTied; // 0x365(0x01)
	char pad_366[0x12]; // 0x366(0x12)
	struct FMulticastInlineDelegate OnPlayerInputCallback; // 0x378(0x10)
	struct FMulticastInlineDelegate OnTableStateChanged; // 0x388(0x10)
	struct FMulticastInlineDelegate OnWinningRatioPerPointChanged; // 0x398(0x10)
	struct FMulticastInlineDelegate OnPlayerConnectedCallback; // 0x3a8(0x10)
	struct FMulticastInlineDelegate OnPlayerDisconnectedCallback; // 0x3b8(0x10)
	struct FMulticastInlineDelegate OnRoundEndedCallback; // 0x3c8(0x10)
	char pad_3D8[0x8]; // 0x3d8(0x08)

	void Multicast_PlayerInputEvent(struct FArmWreslingPlayerRoundData PlayerData); // Function OPP.RBArmWreslingTable.Multicast_PlayerInputEvent // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d0c788
	void Multicast_OnRoundEnded(struct FArmWreslingPlayerRoundData player1Data, struct FArmWreslingPlayerRoundData player2Data); // Function OPP.RBArmWreslingTable.Multicast_OnRoundEnded // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d0c510
	void Multicast_OnResetMatch(); // Function OPP.RBArmWreslingTable.Multicast_OnResetMatch // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d0c4f8
	void Multicast_BroadcastMatchStartMessage(struct ARBPlayer* player1Ptr, struct ARBPlayer* player2Ptr); // Function OPP.RBArmWreslingTable.Multicast_BroadcastMatchStartMessage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d0c430
	void Multicast_BroadcastMatchEndMessage(struct ARBPlayer* winnerPlayer, struct ARBPlayer* loserPlayer, bool gameTied_value); // Function OPP.RBArmWreslingTable.Multicast_BroadcastMatchEndMessage // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d0c330
	bool IsMatchStartedOrCompleted(); // Function OPP.RBArmWreslingTable.IsMatchStartedOrCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c2cc
	bool IsMatchInProgress(); // Function OPP.RBArmWreslingTable.IsMatchInProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c2b0
	enum class EArmWreslingTableState GetTableState(); // Function OPP.RBArmWreslingTable.GetTableState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c248
	struct URBArmWreslingPanelComponent* GetOpposingWatchedPanel(); // Function OPP.RBArmWreslingTable.GetOpposingWatchedPanel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c1d4
	struct URBArmWreslingPanelComponent* GetLocallyWatchedPanel(); // Function OPP.RBArmWreslingTable.GetLocallyWatchedPanel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c160
	float GetElapsedRoundTime(); // Function OPP.RBArmWreslingTable.GetElapsedRoundTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0c100
	void Event_OnWinningRatioPerPointChanged(); // Function OPP.RBArmWreslingTable.Event_OnWinningRatioPerPointChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnTableStateChanged(); // Function OPP.RBArmWreslingTable.Event_OnTableStateChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnRoundEnded(struct FArmWreslingPlayerRoundData& player1Data, struct FArmWreslingPlayerRoundData& player2Data); // Function OPP.RBArmWreslingTable.Event_OnRoundEnded // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnPlayerDisconnected(struct URBArmWreslingPanelComponent* panelComponent, struct ARBPlayer* Player); // Function OPP.RBArmWreslingTable.Event_OnPlayerDisconnected // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnPlayerConnected(struct URBArmWreslingPanelComponent* panelComponent, struct ARBPlayer* Player); // Function OPP.RBArmWreslingTable.Event_OnPlayerConnected // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBAttackDummy
// Size: 0x268 (Inherited: 0x248)
struct ARBAttackDummy : AActor {
	bool bStepBackOnAttackStart; // 0x248(0x01)
	char pad_249[0x3]; // 0x249(0x03)
	float StepBackSpeed; // 0x24c(0x04)
	int32_t NumHits; // 0x250(0x04)
	bool bAttackStarted; // 0x254(0x01)
	char pad_255[0x13]; // 0x255(0x13)

	void Event_OnHit(); // Function OPP.RBAttackDummy.Event_OnHit // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_SetLocationFromTimeline(struct FVector& NewLocation); // Function OPP.RBAttackDummy.BP_SetLocationFromTimeline // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d0bfe0
	void BP_ResetAttackDummy(); // Function OPP.RBAttackDummy.BP_ResetAttackDummy // (Final|Native|Public|BlueprintCallable) // @ game+0x1d0bfc0
};

// Class OPP.RBAudioManager
// Size: 0x3d0 (Inherited: 0x28)
struct URBAudioManager : UObject {
	struct TArray<struct FSoundTriggerEvent> CurrentSoundVolumeEvents; // 0x28(0x10)
	struct TArray<struct ARBSoundVolume*> ListenerVolumes; // 0x38(0x10)
	struct TArray<struct FMultiPositionGroup> ActiveGroups; // 0x48(0x10)
	char pad_58[0x8]; // 0x58(0x08)
	struct TArray<struct URBSoundComponent*> RangeOptimizedSources; // 0x60(0x10)
	struct TArray<struct URBSoundComponent*> ActiveSources; // 0x70(0x10)
	struct TWeakObjectPtr<struct URBSoundComponent> Listener; // 0x80(0x08)
	struct URBVOManager* VOManager; // 0x88(0x08)
	char pad_90[0x98]; // 0x90(0x98)
	struct TSet<struct ARBSoundVolume*> DeferredVolumesToAdd; // 0x128(0x50)
	struct TSet<struct ARBSoundVolume*> UninitializedVolumes; // 0x178(0x50)
	struct TSet<struct URBSoundConnectorComponent*> ConnectorsRequiringUpdate; // 0x1c8(0x50)
	struct TArray<struct FAudioPathNode> AudioPathNodes; // 0x218(0x10)
	char pad_228[0x8]; // 0x228(0x08)
	struct TArray<struct UAkAudioEvent*> LevelMusicStartEvents; // 0x230(0x10)
	struct TArray<struct UAkAudioEvent*> LevelMusicStopEvents; // 0x240(0x10)
	struct TArray<struct UAkAudioEvent*> MusicTrackStartEvents; // 0x250(0x10)
	struct TArray<struct UAkAudioEvent*> MusicTrackStopEvents; // 0x260(0x10)
	struct FNarrativeSoundEventsInfo ServerNarrativeSoundEvents; // 0x270(0x20)
	struct FNarrativeSoundEventsInfo ClientNarrativeSoundEvents; // 0x290(0x20)
	char pad_2B0[0x8]; // 0x2b0(0x08)
	struct TArray<struct FMusicEventInfo> MusicEventLog; // 0x2b8(0x10)
	char pad_2C8[0x60]; // 0x2c8(0x60)
	struct TArray<struct FSoundEmitterTransaction> SoundEmittersTransactions; // 0x328(0x10)
	struct TArray<struct FDualSidedEmitterTransaction> DualSidedEmitterTransactions; // 0x338(0x10)
	char pad_348[0x28]; // 0x348(0x28)
	struct TArray<struct URBSoundComponent*> ComponentStopTransactions; // 0x370(0x10)
	char pad_380[0x28]; // 0x380(0x28)
	struct TArray<struct FRBMurkoffAnnouncentAudioData> PendingMurkoffAnnouncementLinesLeft; // 0x3a8(0x10)
	char pad_3B8[0x18]; // 0x3b8(0x18)

	void ExitAllVolumes(); // Function OPP.RBAudioManager.ExitAllVolumes // (Final|Native|Public|BlueprintCallable) // @ game+0x1d0c088
};

// Class OPP.RBMenuWidget
// Size: 0x308 (Inherited: 0x268)
struct URBMenuWidget : URBUserWidget {
	struct UAkAudioEvent* MenuOpenSoundOverride; // 0x268(0x08)
	char bOverride_MenuOpenSound : 1; // 0x270(0x01)
	char pad_270_1 : 7; // 0x270(0x01)
	char pad_271[0x7]; // 0x271(0x07)
	struct UAkAudioEvent* MenuExitSoundOverride; // 0x278(0x08)
	char bOverride_MenuExitSound : 1; // 0x280(0x01)
	char pad_280_1 : 7; // 0x280(0x01)
	enum class EMuffleLevel MuffleLevel; // 0x281(0x01)
	bool bPopPageOnPadCancel; // 0x282(0x01)
	bool bUseTransitionOnPush; // 0x283(0x01)
	bool bUseTransitionOnPop; // 0x284(0x01)
	bool bHideWhenUnfocused; // 0x285(0x01)
	bool bHidePageUnderWhenPushed; // 0x286(0x01)
	bool bPushOnBottom; // 0x287(0x01)
	bool bIsUsingCursor; // 0x288(0x01)
	char pad_289[0x7]; // 0x289(0x07)
	struct UWidget* FirstFocusedWidget; // 0x290(0x08)
	struct UWidget* CurrentlyFocusedWidget; // 0x298(0x08)
	bool bPushInErrorPageStack; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	struct FMulticastInlineDelegate OnMenuPushed; // 0x2a8(0x10)
	struct FMulticastInlineDelegate OnMenuPop; // 0x2b8(0x10)
	struct FMulticastInlineDelegate OnMenuFocused; // 0x2c8(0x10)
	struct FMulticastInlineDelegate OnMenuUnfocused; // 0x2d8(0x10)
	char pad_2E8[0x18]; // 0x2e8(0x18)
	enum class ESlateVisibility DefaultVisibility; // 0x300(0x01)
	char pad_301[0x7]; // 0x301(0x07)

	void Event_OnUnfocusMenu(bool bShouldHide); // Function OPP.RBMenuWidget.Event_OnUnfocusMenu // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnPush(); // Function OPP.RBMenuWidget.Event_OnPush // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnPop(); // Function OPP.RBMenuWidget.Event_OnPop // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnMenuTutorialSeen(); // Function OPP.RBMenuWidget.Event_OnMenuTutorialSeen // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnMenuSettingsModified(); // Function OPP.RBMenuWidget.Event_OnMenuSettingsModified // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnHide(); // Function OPP.RBMenuWidget.Event_OnHide // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnFocusMenu(); // Function OPP.RBMenuWidget.Event_OnFocusMenu // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_MenuTabRight_Released(); // Function OPP.RBMenuWidget.Event_MenuTabRight_Released // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_MenuTabLeft_Released(); // Function OPP.RBMenuWidget.Event_MenuTabLeft_Released // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_MenuRightPage_Released(); // Function OPP.RBMenuWidget.Event_MenuRightPage_Released // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_MenuLeftPage_Released(); // Function OPP.RBMenuWidget.Event_MenuLeftPage_Released // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_MenuConfirm_Released(); // Function OPP.RBMenuWidget.Event_MenuConfirm_Released // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_MenuCancel_Pressed(); // Function OPP.RBMenuWidget.Event_MenuCancel_Pressed // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_SetFocusedWidget(struct UWidget* WidgetToFocus); // Function OPP.RBMenuWidget.BP_SetFocusedWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x1d9d954
	void BP_PushAndClearTransitionStack(bool bDoTransition); // Function OPP.RBMenuWidget.BP_PushAndClearTransitionStack // (Final|Native|Public|BlueprintCallable) // @ game+0x1d9d818
	void BP_Push(); // Function OPP.RBMenuWidget.BP_Push // (Final|Native|Public|BlueprintCallable) // @ game+0x1d9d804
	void BP_Pop(); // Function OPP.RBMenuWidget.BP_Pop // (Final|Native|Public|BlueprintCallable) // @ game+0x1d9d7f0
	void BP_MenuHidden(); // Function OPP.RBMenuWidget.BP_MenuHidden // (Final|Native|Public|BlueprintCallable) // @ game+0x1d9d7d4
	struct UWidget* BP_GetFocusedWidget(); // Function OPP.RBMenuWidget.BP_GetFocusedWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x1d9d44c
};

// Class OPP.RBAudioSettingsWidget
// Size: 0x308 (Inherited: 0x308)
struct URBAudioSettingsWidget : URBMenuWidget {

	void Event_Refresh(); // Function OPP.RBAudioSettingsWidget.Event_Refresh // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBFunctionalTestAgent
// Size: 0x40 (Inherited: 0x28)
struct URBFunctionalTestAgent : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct URBFunctionalTestManager* FunctionalTestManager; // 0x38(0x08)
};

// Class OPP.RBAutoCompleteStageTestAgent
// Size: 0x70 (Inherited: 0x40)
struct URBAutoCompleteStageTestAgent : URBFunctionalTestAgent {
	char pad_40[0x18]; // 0x40(0x18)
	struct URBGameInstance* Owner; // 0x58(0x08)
	char pad_60[0x10]; // 0x60(0x10)

	void OnStageReady(struct FRBStageID& StageID, struct FRBMissionID& MissionID); // Function OPP.RBAutoCompleteStageTestAgent.OnStageReady // (Final|Native|Private|HasOutParms) // @ game+0x1d1138c
	void OnStageEnded(struct FRBStageID& StageID, struct FRBMissionID& MissionID, bool bIsReset); // Function OPP.RBAutoCompleteStageTestAgent.OnStageEnded // (Final|Native|Private|HasOutParms) // @ game+0x1d11140
	void OnMatchReady(); // Function OPP.RBAutoCompleteStageTestAgent.OnMatchReady // (Final|Native|Private) // @ game+0x1d11014
	void OnGamePhaseUpdated(enum class EGamePhase gamePhase); // Function OPP.RBAutoCompleteStageTestAgent.OnGamePhaseUpdated // (Final|Native|Private) // @ game+0x1d10f00
	void OnFindHubCompleted(bool bPending, bool bSucceeded); // Function OPP.RBAutoCompleteStageTestAgent.OnFindHubCompleted // (Final|Native|Private) // @ game+0x1d10e3c
};

// Class OPP.RBInteractible
// Size: 0x4c0 (Inherited: 0x248)
struct ARBInteractible : AActor {
	char pad_248[0x8]; // 0x248(0x08)
	struct FScheduledBool IsInteractible; // 0x250(0x70)
	bool bInteractionActionCollisionCheck; // 0x2c0(0x01)
	bool bCanBlockSelfInteraction; // 0x2c1(0x01)
	char pad_2C2[0x6]; // 0x2c2(0x06)
	struct URBInteractionZoneComponent* InteractionZoneBox; // 0x2c8(0x08)
	struct TArray<struct UBoxComponent*> AdditionalInteractZoneBox; // 0x2d0(0x10)
	struct UStaticMeshComponent* InteractionMesh; // 0x2e0(0x08)
	bool bNPCInteractOnInvestigation; // 0x2e8(0x01)
	char pad_2E9[0x3]; // 0x2e9(0x03)
	int32_t MaxNumberOfInteractors; // 0x2ec(0x04)
	bool bInteruptOnInteractRelease; // 0x2f0(0x01)
	bool bIgnoreCollisionWhileInteracting; // 0x2f1(0x01)
	bool bIgnoreCollisionWithThisActorWhileInteracting; // 0x2f2(0x01)
	bool bCanInteractWhileLookingBack; // 0x2f3(0x01)
	bool bCanBeInteractedWhileMovingLargeObject; // 0x2f4(0x01)
	bool bDropLargeObjectOnInteraction; // 0x2f5(0x01)
	bool bCradleLargeObjectOnInteraction; // 0x2f6(0x01)
	bool bCanBeInteractedWhileInPsychosis; // 0x2f7(0x01)
	float MinDelayBetweenInteractions; // 0x2f8(0x04)
	float MaxPositionningTime; // 0x2fc(0x04)
	struct FText InteractionText; // 0x300(0x18)
	struct FInteractionData PlayerInteractionData; // 0x318(0x50)
	struct FInteractionData NPCInteractionData; // 0x368(0x50)
	struct FVector2D CameraYawLimit; // 0x3b8(0x08)
	struct FVector2D CameraPitchLimit; // 0x3c0(0x08)
	bool bCanLookBack; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct FInteractionSoundEvent StartInteractionSoundEvent; // 0x3d0(0x20)
	struct FInteractionSoundEvent ActionInteractionSoundEvent; // 0x3f0(0x20)
	struct FInteractionSoundEvent EndInteractionSoundEvent; // 0x410(0x20)
	struct FMulticastInlineDelegate OnInteractorChangedEvent; // 0x430(0x10)
	struct FMulticastInlineDelegate OnDoAction; // 0x440(0x10)
	struct FMulticastInlineDelegate OnInteractibilityStateChanged; // 0x450(0x10)
	struct ARBInteractible* ParentInteractible; // 0x460(0x08)
	struct USceneComponent* InteractibleRootComponent; // 0x468(0x08)
	int32_t RandomSeed; // 0x470(0x04)
	int32_t OverseerColorIndex; // 0x474(0x04)
	float AnimBlendInTime; // 0x478(0x04)
	float AnimBlendOutTime; // 0x47c(0x04)
	float EquippedItemHideDelayOverride; // 0x480(0x04)
	float EquipedItemUnhideDelayOverride; // 0x484(0x04)
	char pad_488[0x8]; // 0x488(0x08)
	int32_t NumberOfInteract; // 0x490(0x04)
	bool bHasDeprecated; // 0x494(0x01)
	bool bStartsInteractible; // 0x495(0x01)
	char pad_496[0x2]; // 0x496(0x02)
	struct TArray<struct ARBPawn*> DesiredInteractorPawns; // 0x498(0x10)
	struct TArray<struct ARBPawn*> InteractorPawns; // 0x4a8(0x10)
	float DesiredInteractorPawnTime; // 0x4b8(0x04)
	float LastTimeWithInteractorsServerTimeStamp; // 0x4bc(0x04)

	void SnapToState_Implementation(); // Function OPP.RBInteractible.SnapToState_Implementation // (Final|Native|Public) // @ game+0x1d84544
	bool ShouldAlignToGround(struct ARBPawn* interactorPawn); // Function OPP.RBInteractible.ShouldAlignToGround // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d84488
	void OnRep_IsInteractive(); // Function OPP.RBInteractible.OnRep_IsInteractive // (Final|Native|Public) // @ game+0x1d84338
	void OnRep_DesiredInteractorPawnTime(); // Function OPP.RBInteractible.OnRep_DesiredInteractorPawnTime // (Final|Native|Private) // @ game+0x1d84320
	void OnRep_DesiredInteractorPawns(); // Function OPP.RBInteractible.OnRep_DesiredInteractorPawns // (Final|Native|Private) // @ game+0x1d84320
	void NotifySpecialMoveStartedEvent(struct ARBPawn* Pawn, enum class ESpecialMove specialMove); // Function OPP.RBInteractible.NotifySpecialMoveStartedEvent // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void NotifySpecialMoveCompletedEvent(struct ARBPawn* Pawn, enum class ESpecialMove specialMove, bool bInterrupted); // Function OPP.RBInteractible.NotifySpecialMoveCompletedEvent // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Multicast_OnStopInteract(struct ARBPawn* Pawn); // Function OPP.RBInteractible.Multicast_OnStopInteract // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d84028
	void Multicast_OnStartInteract(struct ARBPawn* Pawn); // Function OPP.RBInteractible.Multicast_OnStartInteract // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d83fa4
	void IsInteractiveChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBInteractible.IsInteractiveChangedCallback // (Native|Public) // @ game+0x1d83e88
	void IncrementNumberOfInteract(); // Function OPP.RBInteractible.IncrementNumberOfInteract // (Final|Native|Public|BlueprintCallable) // @ game+0x1d83e74
	bool GetStartsInteractible(); // Function OPP.RBInteractible.GetStartsInteractible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16a8200
	int32_t GetNumberOfInteract(); // Function OPP.RBInteractible.GetNumberOfInteract // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d83dac
	bool GetInteractionActionCollisionCheck(); // Function OPP.RBInteractible.GetInteractionActionCollisionCheck // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x107c030
	struct FVector GetAnimLocation(struct ARBPawn* interactorPawn, enum class ESpecialMove specialMove); // Function OPP.RBInteractible.GetAnimLocation // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1d83c3c
	struct FVector GetAnimForward(struct ARBPawn* interactorPawn, enum class ESpecialMove specialMove); // Function OPP.RBInteractible.GetAnimForward // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1d83b60
	void Event_SnapToState(); // Function OPP.RBInteractible.Event_SnapToState // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnInteractorsChangedEvent(); // Function OPP.RBInteractible.Event_OnInteractorsChangedEvent // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnInteract(struct ARBPawn* Pawn); // Function OPP.RBInteractible.Event_OnInteract // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_DoAction(struct ARBPawn* interactor); // Function OPP.RBInteractible.Event_DoAction // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_StopAllCurrentInteractions(); // Function OPP.RBInteractible.BP_StopAllCurrentInteractions // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d83b4c
	void BP_SetShowInDebug(bool bShowInDebugValue); // Function OPP.RBInteractible.BP_SetShowInDebug // (Final|Native|Public|BlueprintCallable) // @ game+0x1d83acc
	void BP_SetIsInteractible(bool bInteractibleValue); // Function OPP.RBInteractible.BP_SetIsInteractible // (Final|Native|Public|BlueprintCallable) // @ game+0x1d83a4c
	void BP_OnIsInteractibleChanged(bool bInteractibleValue); // Function OPP.RBInteractible.BP_OnIsInteractibleChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	bool BP_IsInteractible(); // Function OPP.RBInteractible.BP_IsInteractible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d83a18
	struct TArray<struct ARBPawn*> BP_GetInteractorPawns(); // Function OPP.RBInteractible.BP_GetInteractorPawns // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d839fc
	struct FTransform BP_GetInteractionMeshRelativeTransform(struct ARBInteractible* interactibleClass); // Function OPP.RBInteractible.BP_GetInteractionMeshRelativeTransform // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1d838f0
	void ApplyDesiredInteractorPawns(); // Function OPP.RBInteractible.ApplyDesiredInteractorPawns // (Final|Native|Private) // @ game+0x1d838dc
};

// Class OPP.RBOperatable
// Size: 0x658 (Inherited: 0x4c0)
struct ARBOperatable : ARBInteractible {
	char pad_4C0[0x8]; // 0x4c0(0x08)
	bool Client_bStateOn; // 0x4c8(0x01)
	bool Server_bStateOn; // 0x4c9(0x01)
	bool bCanBeInteractedAfterCompletion; // 0x4ca(0x01)
	bool bCanBeInteractedWhileCrouched; // 0x4cb(0x01)
	float OperateTime; // 0x4cc(0x04)
	float ReturnRatio; // 0x4d0(0x04)
	bool bInstantReturnRatio; // 0x4d4(0x01)
	bool bNeverFinishes; // 0x4d5(0x01)
	char pad_4D6[0x2]; // 0x4d6(0x02)
	float TimeBeforeReset; // 0x4d8(0x04)
	bool bDisableOnceLinkedActorTriggered; // 0x4dc(0x01)
	bool bCanBeOperatedByInteraction; // 0x4dd(0x01)
	bool bAutoStopWhenCompleted; // 0x4de(0x01)
	enum class ETriggerableActionBehavior TriggerActionBehavior; // 0x4df(0x01)
	struct TArray<float> TimeMultiplierPerInteractor; // 0x4e0(0x10)
	bool bMashOperatable; // 0x4f0(0x01)
	bool bUsePlayerHoldMultiplier; // 0x4f1(0x01)
	char pad_4F2[0x2]; // 0x4f2(0x02)
	float MashAmount; // 0x4f4(0x04)
	bool bConsumeRequiredItemOnFinish; // 0x4f8(0x01)
	char pad_4F9[0x7]; // 0x4f9(0x07)
	struct URBGhostAnimInstance* GhostAnimationInstanceClass; // 0x500(0x08)
	struct UAnimSequenceBase* InverseAnimSequence; // 0x508(0x08)
	float AnimationLoopPercentage; // 0x510(0x04)
	float InverseAnimSequencePlayRate; // 0x514(0x04)
	int32_t InverseAnimSequenceLoopCount; // 0x518(0x04)
	char pad_51C[0x4]; // 0x51c(0x04)
	struct FInteractionSoundEvent StartInverseInteractionSoundEvent; // 0x520(0x20)
	struct FInteractionSoundEvent ActionInverseInteractionSoundEvent; // 0x540(0x20)
	struct FInteractionSoundEvent EndInverseInteractionSoundEvent; // 0x560(0x20)
	bool bAlwaysTickOperatable; // 0x580(0x01)
	char pad_581[0x7]; // 0x581(0x07)
	struct FText DenyInteractionText; // 0x588(0x18)
	struct FText InverseInteractionText; // 0x5a0(0x18)
	struct FText CannotStopInteractionText; // 0x5b8(0x18)
	char pad_5D0[0x8]; // 0x5d0(0x08)
	struct FMulticastInlineDelegate OnCompletedEvent; // 0x5d8(0x10)
	struct FMulticastInlineDelegate OnStartOperatingEvent; // 0x5e8(0x10)
	struct FMulticastInlineDelegate OnStopOperatingEvent; // 0x5f8(0x10)
	struct FMulticastInlineDelegate OnStateChangedEvent; // 0x608(0x10)
	float Client_CurrentOperateTime; // 0x618(0x04)
	float Server_CurrentOperateTime; // 0x61c(0x04)
	float Server_OldOperateTime; // 0x620(0x04)
	bool bIsDenyInteraction; // 0x624(0x01)
	bool Server_bCompleted; // 0x625(0x01)
	bool Client_bCompleted; // 0x626(0x01)
	bool Client_bWaitingForComplete; // 0x627(0x01)
	char pad_628[0x10]; // 0x628(0x10)
	struct TArray<struct ARBPawn*> CompletedByPawnList; // 0x638(0x10)
	float Server_ForceDesiredOperateTime; // 0x648(0x04)
	float ForceProgressSpeed; // 0x64c(0x04)
	char pad_650[0x8]; // 0x650(0x08)

	void OnRep_IsDenyInteraction(); // Function OPP.RBOperatable.OnRep_IsDenyInteraction // (Final|Native|Public) // @ game+0x1daee7c
	void OnRep_ForceDesiredOperateTime(); // Function OPP.RBOperatable.OnRep_ForceDesiredOperateTime // (Final|Native|Private) // @ game+0x1daee68
	void OnRep_CurrentOperateTime_Callback(); // Function OPP.RBOperatable.OnRep_CurrentOperateTime_Callback // (Final|Native|Public) // @ game+0x1daee54
	void OnRep_CurrentOperateTime(); // Function OPP.RBOperatable.OnRep_CurrentOperateTime // (Final|Native|Public) // @ game+0x1daee40
	void OnRep_Completed_Callback(); // Function OPP.RBOperatable.OnRep_Completed_Callback // (Final|Native|Public) // @ game+0x1daee2c
	void OnRep_Completed(); // Function OPP.RBOperatable.OnRep_Completed // (Final|Native|Public) // @ game+0x1daee18
	void OnRep_bStateOn_Callback(); // Function OPP.RBOperatable.OnRep_bStateOn_Callback // (Final|Native|Public) // @ game+0x1daeea4
	void OnRep_bStateOn(); // Function OPP.RBOperatable.OnRep_bStateOn // (Final|Native|Public) // @ game+0x1daee90
	void Multicast_ResetCompletedState(float oldProgression); // Function OPP.RBOperatable.Multicast_ResetCompletedState // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1daea60
	void Multicast_OnTimedReset(); // Function OPP.RBOperatable.Multicast_OnTimedReset // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d34618
	void Multicast_OnStopInteractOperatable(struct ARBPawn* Pawn, float Server_CurrentOperateOnStop); // Function OPP.RBOperatable.Multicast_OnStopInteractOperatable // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1dae994
	void Multicast_OnCompletedOperation(float oldProgression, struct TArray<struct ARBPawn*> completedByPawnListValue); // Function OPP.RBOperatable.Multicast_OnCompletedOperation // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1dae8b4
	void Multicast_ForceState(float oldProgression, bool bForcedState); // Function OPP.RBOperatable.Multicast_ForceState // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1dae7e4
	void Multicast_ForceCompletion(); // Function OPP.RBOperatable.Multicast_ForceCompletion // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1dae7cc
	bool IsCurrentlyBeingOperated(); // Function OPP.RBOperatable.IsCurrentlyBeingOperated // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dae7a8
	void Event_OnTriggerableDeactivated(struct ARBTriggerable* triggerable); // Function OPP.RBOperatable.Event_OnTriggerableDeactivated // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnTriggerableActivated(struct ARBTriggerable* triggerable); // Function OPP.RBOperatable.Event_OnTriggerableActivated // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnTimedReset(); // Function OPP.RBOperatable.Event_OnTimedReset // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnStopOperating(struct ARBPawn* Pawn); // Function OPP.RBOperatable.Event_OnStopOperating // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnStateOnChanged(bool bStateOn); // Function OPP.RBOperatable.Event_OnStateOnChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnStartOperating(struct ARBPawn* Pawn); // Function OPP.RBOperatable.Event_OnStartOperating // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnResetCompletedState(float oldProgression); // Function OPP.RBOperatable.Event_OnResetCompletedState // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnOperationProgressChanged(float currentProgressRatio); // Function OPP.RBOperatable.Event_OnOperationProgressChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnIsDenyInteractionChanged(); // Function OPP.RBOperatable.Event_OnIsDenyInteractionChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnCompletedOperation(struct TArray<struct ARBPawn*>& pawns); // Function OPP.RBOperatable.Event_OnCompletedOperation // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x201e6d4
	bool DefaultTestPhysicsClearance(struct ARBPawn* interactorPawn); // Function OPP.RBOperatable.DefaultTestPhysicsClearance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dae5d0
	void BP_SetIsDenyInteraction(bool bDeny); // Function OPP.RBOperatable.BP_SetIsDenyInteraction // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1dae51c
	void BP_ResetCompletedState(); // Function OPP.RBOperatable.BP_ResetCompletedState // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1dae508
	float BP_GetCurrentProgressionRatio(); // Function OPP.RBOperatable.BP_GetCurrentProgressionRatio // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dae1dc
	void BP_ForceState(bool bForcedState); // Function OPP.RBOperatable.BP_ForceState // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1dae060
	void BP_ForceInteraction(bool bBypassCompletion); // Function OPP.RBOperatable.BP_ForceInteraction // (Final|Native|Public|BlueprintCallable) // @ game+0x1dadfc0
	void BP_ForceDesiredProgression(float desiredProgression, float progressionSpeed); // Function OPP.RBOperatable.BP_ForceDesiredProgression // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1dadee4
	bool BP_CanOperateWith(struct ARBPawn* Pawn); // Function OPP.RBOperatable.BP_CanOperateWith // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1dadd74
	void BP_CancelTimedReset(); // Function OPP.RBOperatable.BP_CancelTimedReset // (Final|Native|Public|BlueprintCallable) // @ game+0x1dade0c
};

// Class OPP.RBDoor
// Size: 0xc40 (Inherited: 0x658)
struct ARBDoor : ARBOperatable {
	char pad_658[0x98]; // 0x658(0x98)
	struct USceneComponent* LeftHinge; // 0x6f0(0x08)
	struct USceneComponent* RightHinge; // 0x6f8(0x08)
	struct UStaticMeshComponent* ShadowCaster; // 0x700(0x08)
	struct AActor* LockingPanelClass; // 0x708(0x08)
	struct ARBSlidingLock* SingleDoorSlidingLockClass; // 0x710(0x08)
	struct ARBSlidingLock* DoubleDoorLockClass; // 0x718(0x08)
	struct USceneComponent* FrontPadLockRef; // 0x720(0x08)
	struct USceneComponent* BackPadLockRef; // 0x728(0x08)
	struct USceneComponent* FrontSlidingLockRef; // 0x730(0x08)
	struct USceneComponent* BackSlidingLockRef; // 0x738(0x08)
	struct URBRepulsionComponent* repulsionComponent; // 0x740(0x08)
	struct USceneComponent* EditorTrapFrontRef; // 0x748(0x08)
	struct USceneComponent* EditorTrapBackRef; // 0x750(0x08)
	struct FVector BarScale; // 0x758(0x0c)
	float BarUnlockedOffset; // 0x764(0x04)
	float BarLockedOffset; // 0x768(0x04)
	float BarExtensionLockedOffset; // 0x76c(0x04)
	float DoubleBarLockedOffset; // 0x770(0x04)
	float DoubleDoorBarExtensionLockedOffset; // 0x774(0x04)
	float DoorFrameFrontOffset; // 0x778(0x04)
	float DoorFrameBackOffset; // 0x77c(0x04)
	struct UStaticMeshComponent* DoorFrame; // 0x780(0x08)
	struct AStaticMeshActor* LinkedDoubleDoorFrame; // 0x788(0x08)
	bool bHasDoorFrame; // 0x790(0x01)
	bool bHasDoorFrameTopBar; // 0x791(0x01)
	char pad_792[0x6]; // 0x792(0x06)
	struct UStaticMeshComponent* DoorBarExtensionLeft1; // 0x798(0x08)
	struct UStaticMeshComponent* DoorBarLeft1; // 0x7a0(0x08)
	struct UStaticMeshComponent* DoorBarExtensionRight1; // 0x7a8(0x08)
	struct UStaticMeshComponent* DoorBarRight1; // 0x7b0(0x08)
	bool bOpen; // 0x7b8(0x01)
	bool bOpenInFront; // 0x7b9(0x01)
	bool bCanOpenSlowly; // 0x7ba(0x01)
	bool bLockedFront; // 0x7bb(0x01)
	bool bLockedBack; // 0x7bc(0x01)
	bool bSlidingLockFront; // 0x7bd(0x01)
	bool bSlidingLockFrontLocked; // 0x7be(0x01)
	bool bSlidingLockBack; // 0x7bf(0x01)
	bool bSlidingLockBackLocked; // 0x7c0(0x01)
	char pad_7C1[0x3]; // 0x7c1(0x03)
	int32_t RandomFlags; // 0x7c4(0x04)
	bool bForceBlocked; // 0x7c8(0x01)
	bool bForceRemovedState; // 0x7c9(0x01)
	bool bForcePlankedState; // 0x7ca(0x01)
	bool bForceTrappedState; // 0x7cb(0x01)
	bool bForceOpenState; // 0x7cc(0x01)
	char pad_7CD[0x3]; // 0x7cd(0x03)
	struct TArray<struct FBlockableLink> BlockableLinks; // 0x7d0(0x10)
	struct TArray<struct TSoftObjectPtr<AActor>> ActorsToDisableIfImpassable; // 0x7e0(0x10)
	struct TArray<struct TSoftObjectPtr<ADecalActor>> LinkedRewardDecals; // 0x7f0(0x10)
	struct TArray<struct TSoftObjectPtr<ATextRenderActor>> LinkedRewardTexts; // 0x800(0x10)
	struct TArray<struct TSoftObjectPtr<AActor>> LinkedRewardButtons; // 0x810(0x10)
	bool bCanBeAutomaticallyBlockedBySection; // 0x820(0x01)
	bool bStuckedFront; // 0x821(0x01)
	bool bStuckedBack; // 0x822(0x01)
	char pad_823[0x1]; // 0x823(0x01)
	float WalkingMaxDoorInteractionOpenDoorOpenDistance2D; // 0x824(0x04)
	float MaxFrontDoorAngle; // 0x828(0x04)
	float MaxBackDoorAngle; // 0x82c(0x04)
	bool bCanBeUsedByBot; // 0x830(0x01)
	enum class EBotDoorPassBehavior BotPassBehavior; // 0x831(0x01)
	char pad_832[0x6]; // 0x832(0x06)
	struct FGameplayTagContainer EnableOnlyForNPCTags; // 0x838(0x20)
	struct FGameplayTagContainer DisableForNPCTags; // 0x858(0x20)
	bool bRefreshNavigationDynamicaly; // 0x878(0x01)
	bool bCutsNavMeshAcrossFrameWhenClosed; // 0x879(0x01)
	bool bNoNavMeshCutWhenOpenInFront; // 0x87a(0x01)
	bool bNoNavMeshCutWhenOpenInBack; // 0x87b(0x01)
	bool bAlwaysCutsNavMeshOpen; // 0x87c(0x01)
	bool bCanUnlockableForCartObj; // 0x87d(0x01)
	char pad_87E[0x2]; // 0x87e(0x02)
	struct URBSoundConnectorComponent* SoundConnectorComp; // 0x880(0x08)
	struct URBRoomConnectorComponent* RoomConnectorComp; // 0x888(0x08)
	struct URBNavLinkComponent* NavLinkCompFront; // 0x890(0x08)
	struct URBNavLinkComponent* NavLinkCompBack; // 0x898(0x08)
	struct FMulticastInlineDelegate OnDoorInteractionStarted; // 0x8a0(0x10)
	struct FText LockedCoopBreakableWithLargeObjectInteractionText; // 0x8b0(0x18)
	struct FText LockedCoopBreakableInteractionText; // 0x8c8(0x18)
	struct FText LockedBreakableInteractionText; // 0x8e0(0x18)
	struct FText LockedUnbreakableInteractionText; // 0x8f8(0x18)
	bool bAllowChunkToDetach; // 0x910(0x01)
	bool bCanStillInteractAfterDestroyed; // 0x911(0x01)
	char pad_912[0x6]; // 0x912(0x06)
	struct URBInvestigationComponent* InvestigationComponent; // 0x918(0x08)
	struct URBNPCInterestPointComponent* InterestPoint; // 0x920(0x08)
	struct URBInteractionZoneComponent* DoorFrameInteractZoneBox; // 0x928(0x08)
	struct FLightingChannels LightingChannelsOverride; // 0x930(0x01)
	enum class EDoorCollisionType CollisionType; // 0x931(0x01)
	char pad_932[0x2]; // 0x932(0x02)
	struct FName DoorSwitchType; // 0x934(0x08)
	enum class EAudioDoorType AudioDoorType; // 0x93c(0x01)
	char pad_93D[0x3]; // 0x93d(0x03)
	struct UAkAudioEvent* DoorMovementStartSoundEvent; // 0x940(0x08)
	struct UAkAudioEvent* DoorMovementStopSoundEvent; // 0x948(0x08)
	struct UAkAudioEvent* DoorSlamSoundEvent; // 0x950(0x08)
	float DoorMovementRTPCMaxAngleSpeed; // 0x958(0x04)
	bool bRewardRoomInFront; // 0x95c(0x01)
	char pad_95D[0x3]; // 0x95d(0x03)
	struct TArray<struct URBCoopOperatableComponent*> RewardLockingOperatables; // 0x960(0x10)
	struct FMulticastInlineDelegate OnDoorDestroyedEvent; // 0x970(0x10)
	struct FMulticastInlineDelegate OnDoorClosingEvent; // 0x980(0x10)
	struct FMulticastInlineDelegate OnDoorOpeningEvent; // 0x990(0x10)
	struct FMulticastInlineDelegate OnDoorClosedEvent; // 0x9a0(0x10)
	struct FMulticastInlineDelegate OnDoorUnlockedEvent; // 0x9b0(0x10)
	struct FMulticastInlineDelegate OnRepulsionScheduled; // 0x9c0(0x10)
	struct FMulticastInlineDelegate OnDoorAction; // 0x9d0(0x10)
	struct FMulticastInlineDelegate OnDoorBarsFullyUnlocked; // 0x9e0(0x10)
	struct FMulticastInlineDelegate OnDoorBarsFullyLocked; // 0x9f0(0x10)
	struct ARBDoor* LinkedDoubleDoor; // 0xa00(0x08)
	float CurrentDoorAngle; // 0xa08(0x04)
	char pad_A0C[0x4]; // 0xa0c(0x04)
	struct FScheduledFloat DesiredDoorAngle; // 0xa10(0x78)
	char pad_A88[0x8]; // 0xa88(0x08)
	struct AActor* LinkedLockingPanelFront; // 0xa90(0x08)
	struct AActor* LinkedLockingPanelBack; // 0xa98(0x08)
	struct AActor* RandomStaticBlockingActor; // 0xaa0(0x08)
	bool bDynamicallyReplaced; // 0xaa8(0x01)
	bool bDynamicalyRemoveDoorFrame; // 0xaa9(0x01)
	char pad_AAA[0x6]; // 0xaaa(0x06)
	struct AActor* DynamicReplacementActor; // 0xab0(0x08)
	struct ARBWireTriggerTrap* RandomSpawnedTrapTrigger; // 0xab8(0x08)
	struct ARBTrapTriggerable* RandomSpawnedTrapActor; // 0xac0(0x08)
	struct ARBPawn* LastDoorInteractor; // 0xac8(0x08)
	bool bUnhingedFront; // 0xad0(0x01)
	bool bUnhingedBack; // 0xad1(0x01)
	char pad_AD2[0xe]; // 0xad2(0x0e)
	struct FTransform UnhingedDoorTransform_Server; // 0xae0(0x30)
	char pad_B10[0xc]; // 0xb10(0x0c)
	float DoorInteractionTimestamp; // 0xb1c(0x04)
	float BotDoorPathServerTimestamp; // 0xb20(0x04)
	float BotLockPathServerTimestamp; // 0xb24(0x04)
	float BotRepulsedServerTimestamp; // 0xb28(0x04)
	char pad_B2C[0xc]; // 0xb2c(0x0c)
	struct ARBWireTriggerTrap* LinkedTrap; // 0xb38(0x08)
	struct TArray<struct AActor*> BlockingActorsFront; // 0xb40(0x10)
	struct TArray<struct AActor*> BlockingActorsBack; // 0xb50(0x10)
	char pad_B60[0x1]; // 0xb60(0x01)
	struct FDoorInvestigationData InvestigationData; // 0xb61(0x04)
	char pad_B65[0x13]; // 0xb65(0x13)
	struct URBPuzzleRoomComponent* UsedByPuzzleRoom; // 0xb78(0x08)
	char bBarBlocked : 1; // 0xb80(0x01)
	char pad_B80_1 : 7; // 0xb80(0x01)
	char pad_B81[0x7]; // 0xb81(0x07)
	struct TArray<struct UStaticMeshComponent*> LeftExtensionBars; // 0xb88(0x10)
	struct TArray<struct UStaticMeshComponent*> LeftBars; // 0xb98(0x10)
	struct TArray<struct UStaticMeshComponent*> RightExtensionBars; // 0xba8(0x10)
	struct TArray<struct UStaticMeshComponent*> RightBars; // 0xbb8(0x10)
	bool bEnableExclusiveInteractors; // 0xbc8(0x01)
	char pad_BC9[0x7]; // 0xbc9(0x07)
	struct TArray<struct ARBPawn*> ExclusiveAllowedInteractors; // 0xbd0(0x10)
	bool bSlowOpenTutorial; // 0xbe0(0x01)
	char pad_BE1[0x7]; // 0xbe1(0x07)
	struct URBSoundComponent* SoundComponent; // 0xbe8(0x08)
	char pad_BF0[0x8]; // 0xbf0(0x08)
	struct TArray<struct URBRoomConnectorComponent*> RoomDetourPath; // 0xbf8(0x10)
	bool bRoomDetourValid; // 0xc08(0x01)
	char pad_C09[0x3]; // 0xc09(0x03)
	int32_t numberOfRewardUnlockActive; // 0xc0c(0x04)
	char pad_C10[0x8]; // 0xc10(0x08)
	struct TArray<struct FDoorInteractionAudioEvent> InteractionSoundEvents; // 0xc18(0x10)
	char pad_C28[0x8]; // 0xc28(0x08)
	struct UAnimSequence* DoorInteractionAnim; // 0xc30(0x08)
	char pad_C38[0x8]; // 0xc38(0x08)

	void SlamClosedRepulsionDone(struct URBRepulsionComponent* repulsionComponentDone); // Function OPP.RBDoor.SlamClosedRepulsionDone // (Final|Native|Public) // @ game+0x1d520f0
	void SlamClosed_Server(enum class ERepulsionDirectionFlags Direction, struct TArray<struct ARBPawn*>& specificPawnsPushed); // Function OPP.RBDoor.SlamClosed_Server // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1d52170
	void SetupDynamicComponentVisibilityId(struct USceneComponent* Component); // Function OPP.RBDoor.SetupDynamicComponentVisibilityId // (Final|Native|Public|BlueprintCallable) // @ game+0x1d52070
	void SetupDynamicActorVisibilityId(struct AActor* Actor); // Function OPP.RBDoor.SetupDynamicActorVisibilityId // (Final|Native|Public|BlueprintCallable) // @ game+0x1d51ff0
	void SetLinkedDoubleDoor(struct ARBDoor* linkedDoor); // Function OPP.RBDoor.SetLinkedDoubleDoor // (Final|Native|Public|BlueprintCallable) // @ game+0x1d51f68
	void OnRep_Unhinged(); // Function OPP.RBDoor.OnRep_Unhinged // (Final|Native|Private) // @ game+0x1d51e9c
	void OnRep_SpawnedTrap(); // Function OPP.RBDoor.OnRep_SpawnedTrap // (Final|Native|Private) // @ game+0x1d51e88
	void OnRep_RewardLockingOperatables(); // Function OPP.RBDoor.OnRep_RewardLockingOperatables // (Final|Native|Private) // @ game+0x1d51e74
	void OnRep_RandomStaticBlockingActor(struct AActor* oldActor); // Function OPP.RBDoor.OnRep_RandomStaticBlockingActor // (Final|Native|Private) // @ game+0x1d51df4
	void OnRep_NumberOfRewardUnlockActive(); // Function OPP.RBDoor.OnRep_NumberOfRewardUnlockActive // (Final|Native|Private) // @ game+0x1d51de0
	void OnRep_LockPanel(); // Function OPP.RBDoor.OnRep_LockPanel // (Final|Native|Private) // @ game+0x1d51dcc
	void OnRep_DynamicallyReplaced(); // Function OPP.RBDoor.OnRep_DynamicallyReplaced // (Final|Native|Private) // @ game+0x1d51db8
	void OnRep_DesiredDoorAngle(); // Function OPP.RBDoor.OnRep_DesiredDoorAngle // (Final|Native|Private) // @ game+0x1d51d74
	void OnRep_BlockingActors(); // Function OPP.RBDoor.OnRep_BlockingActors // (Final|Native|Private) // @ game+0x1d51d4c
	void OnRep_BarLocked(); // Function OPP.RBDoor.OnRep_BarLocked // (Final|Native|Private) // @ game+0x1d51d38
	void OnLockPanelUnlocked(struct URBInteractiblePanelComponent* lockPanel, struct ARBPawn* Pawn); // Function OPP.RBDoor.OnLockPanelUnlocked // (Final|Native|Private) // @ game+0x1d51c74
	void OnDoorRepulsionDone(struct URBRepulsionComponent* repulsionComponentDone); // Function OPP.RBDoor.OnDoorRepulsionDone // (Final|Native|Public) // @ game+0x1d51a28
	void OnDesiredDoorAngleChangedCallback(enum class EScheduledPropertyValueChangedType changeType); // Function OPP.RBDoor.OnDesiredDoorAngleChangedCallback // (Final|Native|Private) // @ game+0x1d519a8
	void OnCoopOperatableOperatingStartedEvent(struct URBOperatableComponent* Component, struct ARBPawn* Pawn); // Function OPP.RBDoor.OnCoopOperatableOperatingStartedEvent // (Final|Native|Private) // @ game+0x1d518ec
	void Multicast_OnRewardDoorUnlocked(); // Function OPP.RBDoor.Multicast_OnRewardDoorUnlocked // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d518d4
	void Multicast_OnDoorInteract(float newDoorDesiredAngle, float newDoorAngleSpeedRatio, struct ARBPawn* Pawn); // Function OPP.RBDoor.Multicast_OnDoorInteract // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d517d4
	void LockingPanelActiveChanged(struct URBInteractiblePanelComponent* panel, struct ARBPawn* pawnInteracting); // Function OPP.RBDoor.LockingPanelActiveChanged // (Final|Native|Private) // @ game+0x1d5169c
	void LockBars_Server(bool bLocked); // Function OPP.RBDoor.LockBars_Server // (Final|Native|Public) // @ game+0x1d5161c
	struct URBSoundComponent* GetSoundComponent(); // Function OPP.RBDoor.GetSoundComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x1d515b8
	enum class EBlockableState GetBlockableState(); // Function OPP.RBDoor.GetBlockableState // (Native|Public|Const) // @ game+0x1d5158c
	void Flip(); // Function OPP.RBDoor.Flip // (Final|Native|Public) // @ game+0x1521dbc
	void Editor_OnSelected(); // Function OPP.RBDoor.Editor_OnSelected // (Final|Native|Private) // @ game+0x1521dbc
	void Editor_OnDeselected(); // Function OPP.RBDoor.Editor_OnDeselected // (Final|Native|Private) // @ game+0x1521dbc
	struct AActor* BP_SetDynamicReplacement(struct AActor* replacementClass, bool bShouldRemoveDoorFrame, int32_t randomID); // Function OPP.RBDoor.BP_SetDynamicReplacement // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d51400
	void BP_Server_Unlock(); // Function OPP.RBDoor.BP_Server_Unlock // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d513ec
	void BP_Server_Lock(); // Function OPP.RBDoor.BP_Server_Lock // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d513d8
	void BP_Reset(bool bApplyForceRandomization); // Function OPP.RBDoor.BP_Reset // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d51348
	void BP_RebuildInternalData(); // Function OPP.RBDoor.BP_RebuildInternalData // (Final|Native|Private|BlueprintCallable) // @ game+0x1d51334
	void BP_Open(bool bFrontSide, float speedRatio); // Function OPP.RBDoor.BP_Open // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d51250
	void BP_OnRewardDoorInitialization(); // Function OPP.RBDoor.BP_OnRewardDoorInitialization // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnNumberOfRewardUnlockActiveChanged(int32_t numberOfRewardUnlockActive); // Function OPP.RBDoor.BP_OnNumberOfRewardUnlockActiveChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnLockPanelUnlocked(struct URBInteractiblePanelComponent* lockPanel, struct ARBPawn* Pawn); // Function OPP.RBDoor.BP_OnLockPanelUnlocked // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnLockPanelsReplicated(); // Function OPP.RBDoor.BP_OnLockPanelsReplicated // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnDoorUnhingeEvent(struct ARBPawn* Pawn); // Function OPP.RBDoor.BP_OnDoorUnhingeEvent // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnDoorTrappedStateChanged(bool bTrapped, bool bFromFront); // Function OPP.RBDoor.BP_OnDoorTrappedStateChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnDoorTrapDisarmed(); // Function OPP.RBDoor.BP_OnDoorTrapDisarmed // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnDoorTrapActivated(); // Function OPP.RBDoor.BP_OnDoorTrapActivated // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnDoorInteract(struct ARBPawn* interactor); // Function OPP.RBDoor.BP_OnDoorInteract // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnDoorBashEvent(struct ARBPawn* Pawn, bool bSuccess, bool bApplyVisualDoorDamage, enum class EBashDoorType bashType); // Function OPP.RBDoor.BP_OnDoorBashEvent // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnDoorBarsLockingEvent(bool bLocking); // Function OPP.RBDoor.BP_OnDoorBarsLockingEvent // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_OnActorAttachedToDoor(struct AActor* Actor); // Function OPP.RBDoor.BP_OnActorAttachedToDoor // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	bool BP_IsOpening(); // Function OPP.RBDoor.BP_IsOpening // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d51230
	bool BP_IsOpen(); // Function OPP.RBDoor.BP_IsOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d51210
	bool BP_IsMoving(); // Function OPP.RBDoor.BP_IsMoving // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d511f0
	bool BP_IsLinkedTrapTriggered(); // Function OPP.RBDoor.BP_IsLinkedTrapTriggered // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d511c8
	bool BP_IsLinkedTrapArmed(); // Function OPP.RBDoor.BP_IsLinkedTrapArmed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d511a0
	bool BP_IsIdle(); // Function OPP.RBDoor.BP_IsIdle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d51180
	bool BP_IsFullyOpenInFront(); // Function OPP.RBDoor.BP_IsFullyOpenInFront // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d51154
	bool BP_IsFullyOpenInBack(); // Function OPP.RBDoor.BP_IsFullyOpenInBack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d51128
	bool BP_IsFullyOpen(); // Function OPP.RBDoor.BP_IsFullyOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d51108
	bool BP_IsClosing(); // Function OPP.RBDoor.BP_IsClosing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d510e8
	bool BP_IsClosed(); // Function OPP.RBDoor.BP_IsClosed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d510c8
	bool BP_IsBlockedOnAnySide(); // Function OPP.RBDoor.BP_IsBlockedOnAnySide // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d510a0
	bool BP_IsActorInFront(struct AActor* Actor); // Function OPP.RBDoor.BP_IsActorInFront // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d51010
	void BP_DeactivateBars(); // Function OPP.RBDoor.BP_DeactivateBars // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d50fd8
	void BP_Close(); // Function OPP.RBDoor.BP_Close // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d50fc4
	void BP_ActivateSlowOpenTutorial(); // Function OPP.RBDoor.BP_ActivateSlowOpenTutorial // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d50fa8
	void BP_ActivateBars(); // Function OPP.RBDoor.BP_ActivateBars // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d50f70
	struct FTransform ApplyDoorframeOffsetToTransform(struct FTransform& Transform, bool isAddonInFront, struct FVector& offsetDirection); // Function OPP.RBDoor.ApplyDoorframeOffsetToTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d50dec
};

// Class OPP.RBAutomaticDoor
// Size: 0xce0 (Inherited: 0xc40)
struct ARBAutomaticDoor : ARBDoor {
	struct UBoxComponent* FrontDetector; // 0xc38(0x08)
	struct UBoxComponent* BackDetector; // 0xc40(0x08)
	struct TArray<struct AActor*> DetectorOpenValidClasses; // 0xc48(0x10)
	struct TArray<struct AActor*> DetectorWarningValidClasses; // 0xc58(0x10)
	struct TArray<struct ARBTriggerable*> WarningTriggerables; // 0xc68(0x10)
	float StayOpenDuration; // 0xc78(0x04)
	struct TArray<struct AActor*> DetectedActors; // 0xc80(0x10)
	struct TArray<struct AActor*> DetectedFrontActors; // 0xc90(0x10)
	struct TArray<struct AActor*> DetectedBackActors; // 0xca0(0x10)
	struct TArray<struct AActor*> DetectedWarningFrontActors; // 0xcb0(0x10)
	struct TArray<struct AActor*> DetectedWarningBackActors; // 0xcc0(0x10)
	char pad_CD4[0xc]; // 0xcd4(0x0c)

	void FrontEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function OPP.RBAutomaticDoor.FrontEndOverlap // (Final|Native|Public) // @ game+0x1d106a4
	void FrontBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function OPP.RBAutomaticDoor.FrontBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x1d104b8
	void BackEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function OPP.RBAutomaticDoor.BackEndOverlap // (Final|Native|Public) // @ game+0x1d10214
	void BackBeginOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function OPP.RBAutomaticDoor.BackBeginOverlap // (Final|Native|Public|HasOutParms) // @ game+0x1d10028
};

// Class OPP.RBContainer
// Size: 0x300 (Inherited: 0x248)
struct ARBContainer : AActor {
	char pad_248[0x18]; // 0x248(0x18)
	struct UStaticMeshComponent* InteractionMesh; // 0x260(0x08)
	struct USceneComponent* InteractibleRootComponent; // 0x268(0x08)
	bool bAllowMultipleSpawnInContainer; // 0x270(0x01)
	bool bSelectableBySpawningManager; // 0x271(0x01)
	enum class EContainerSpawningType SpawningType; // 0x272(0x01)
	char pad_273[0x1]; // 0x273(0x01)
	int32_t ContainerPriorityWeight; // 0x274(0x04)
	bool bCanBeUsedByTrickster; // 0x278(0x01)
	bool bUseFromTopAnimation; // 0x279(0x01)
	bool bHideIfEmpty; // 0x27a(0x01)
	bool bHideIfDisabledByRandom; // 0x27b(0x01)
	bool bBoostItemDynamicShadowBounds; // 0x27c(0x01)
	bool bAutoSpawnForcedItems; // 0x27d(0x01)
	char pad_27E[0x2]; // 0x27e(0x02)
	struct TArray<struct ARBPickup*> ForcedContentItems; // 0x280(0x10)
	struct TArray<struct FContainerForcedContentSettings> RandomizedForcedContentSettings; // 0x290(0x10)
	struct TArray<struct TSoftObjectPtr<AActor>> ActorsToInverseMatchState; // 0x2a0(0x10)
	struct UTexture2D* LockedPingIconOverride; // 0x2b0(0x08)
	struct UTexture2D* PingIconOverride; // 0x2b8(0x08)
	struct TArray<struct URBContainerSpawnLocationComponent*> SpawnLocationComponents; // 0x2c0(0x10)
	struct URBRoomAssociationComponent* RoomAssociation; // 0x2d0(0x08)
	char pad_2D8[0x1]; // 0x2d8(0x01)
	bool bIsDisabledByRandom; // 0x2d9(0x01)
	enum class EContainerPopulatedState PopulatedState; // 0x2da(0x01)
	char pad_2DB[0x5]; // 0x2db(0x05)
	struct TArray<struct ARBPickup*> InvalidSpawnItems; // 0x2e0(0x10)
	struct TArray<struct FContainerSpawnedItemInfo> SpawnedItemInfos; // 0x2f0(0x10)

	void OnSpawnedItemInfosChanged(); // Function OPP.RBContainer.OnSpawnedItemInfosChanged // (Event|Protected|BlueprintEvent) // @ game+0x201e6d4
	void OnRep_SpawnedItemInfos(); // Function OPP.RBContainer.OnRep_SpawnedItemInfos // (Final|Native|Protected) // @ game+0x1d3adc8
	void OnRep_PopulatedState(); // Function OPP.RBContainer.OnRep_PopulatedState // (Native|Protected) // @ game+0x1d3adb0
	void Multicast_ItemPickedUp(struct ARBPawn* Pawn, struct ARBPickup* Item); // Function OPP.RBContainer.Multicast_ItemPickedUp // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1d3aaa4
	bool IsOpen(); // Function OPP.RBContainer.IsOpen // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1d3aa7c
	bool IsLocked(); // Function OPP.RBContainer.IsLocked // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d3aa54
	bool IsContainerEmpty(); // Function OPP.RBContainer.IsContainerEmpty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d3aa38
	bool IsClosableContainer(); // Function OPP.RBContainer.IsClosableContainer // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d3aa10
	void InsideItemPickedUp(struct ARBPawn* Pawn, struct ARBPickup* Item); // Function OPP.RBContainer.InsideItemPickedUp // (Final|Native|Public) // @ game+0x1d3a94c
	enum class EContainerPopulatedState GetPopulatedState(); // Function OPP.RBContainer.GetPopulatedState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d3a934
	bool GetPickupInteractionLocation(struct ARBPawn* Pawn, struct URBContainerSpawnLocationComponent* spawnComponent, struct FVector& out_location, struct FVector& out_direction); // Function OPP.RBContainer.GetPickupInteractionLocation // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1d3a7d4
	int32_t GetNumberOfSpawnedItems(); // Function OPP.RBContainer.GetNumberOfSpawnedItems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d3a7bc
	struct URBContainerSpawnLocationComponent* GetItemSpawnLocationComponent(struct ARBPickup* itemInContainer); // Function OPP.RBContainer.GetItemSpawnLocationComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d3a72c
	struct ARBPickup* GetItemFromSpawnLocation(struct URBContainerSpawnLocationComponent* spawnLocationComponent); // Function OPP.RBContainer.GetItemFromSpawnLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d3a69c
	void Event_SnapToState(); // Function OPP.RBContainer.Event_SnapToState // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_PostWorldPopulated_Server(); // Function OPP.RBContainer.Event_PostWorldPopulated_Server // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_ItemRemoved(struct ARBPickup* Item, int32_t Index, struct URBContainerSpawnLocationComponent* Location); // Function OPP.RBContainer.Event_ItemRemoved // (BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_ItemPickedUp(struct ARBPawn* Pawn, struct ARBPickup* Item); // Function OPP.RBContainer.Event_ItemPickedUp // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_ItemAdded(struct ARBPickup* Item, int32_t Index, struct URBContainerSpawnLocationComponent* Location); // Function OPP.RBContainer.Event_ItemAdded // (BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Editor_CreateAllItemDisplayMeshes(); // Function OPP.RBContainer.Editor_CreateAllItemDisplayMeshes // (Final|Native|Public) // @ game+0x1521dbc
	void Editor_ClearForcedItems(); // Function OPP.RBContainer.Editor_ClearForcedItems // (Final|Native|Public) // @ game+0x1521dbc
	void Editor_AddValidForcedItems(); // Function OPP.RBContainer.Editor_AddValidForcedItems // (Final|Native|Public) // @ game+0x1521dbc
	void Editor_AddEditorForcedItems(); // Function OPP.RBContainer.Editor_AddEditorForcedItems // (Final|Native|Public) // @ game+0x1521dbc
	void BP_ForceSpawnForcedContent(int32_t RandomSeed); // Function OPP.RBContainer.BP_ForceSpawnForcedContent // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d3a1d0
	void BP_ForceReset(); // Function OPP.RBContainer.BP_ForceReset // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d3a1b8
	void BP_DestroyItemsInside(); // Function OPP.RBContainer.BP_DestroyItemsInside // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d3a1a4
};

// Class OPP.RBAutoRespawnContainer
// Size: 0x640 (Inherited: 0x300)
struct ARBAutoRespawnContainer : ARBContainer {
	bool bAutoRespawnForcedItems; // 0x300(0x01)
	bool bAutoSpawnBatchAsGroup; // 0x301(0x01)
	char pad_302[0x6]; // 0x302(0x06)
	struct FConfigurableInt SpawnsPerBatchCount; // 0x308(0xc8)
	struct FConfigurableFloat TimeBetweenSpawnsInBatch; // 0x3d0(0xc8)
	struct FConfigurableFloat MinTimeBetweenBatch; // 0x498(0xc8)
	struct FConfigurableFloat MaxTimeBetweenBatch; // 0x560(0xc8)
	int32_t SpawnsInBatchRemaining; // 0x628(0x04)
	bool bAutoRespawnForcedItemsEnabled; // 0x62c(0x01)
	char pad_62D[0x3]; // 0x62d(0x03)
	int32_t SpawnCount; // 0x630(0x04)
	char pad_634[0xc]; // 0x634(0x0c)

	void OnRep_SpawnsInBatchRemaining(); // Function OPP.RBAutoRespawnContainer.OnRep_SpawnsInBatchRemaining // (Final|Native|Private) // @ game+0x1d11118
	void OnRep_AutoRespawnForcedItemsEnabled(); // Function OPP.RBAutoRespawnContainer.OnRep_AutoRespawnForcedItemsEnabled // (Final|Native|Private) // @ game+0x1d11028
	void Event_OnSpawnsInBatchRemainingChanged(); // Function OPP.RBAutoRespawnContainer.Event_OnSpawnsInBatchRemainingChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnAutoRespawnItemsEnabledChanged(bool bEnabled); // Function OPP.RBAutoRespawnContainer.Event_OnAutoRespawnItemsEnabledChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_SetAutoRespawnForcedItemsEnabled(bool bEnabled, bool bSpawnRightNow); // Function OPP.RBAutoRespawnContainer.BP_SetAutoRespawnForcedItemsEnabled // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d0ff3c
};

// Class OPP.RBAvailableTaskListWidget
// Size: 0x290 (Inherited: 0x278)
struct URBAvailableTaskListWidget : URBTaskMenuWidgetBase {
	char pad_278[0x18]; // 0x278(0x18)

	void SetMetaNpcType(enum class EMetaNPCType metaNPCType); // Function OPP.RBAvailableTaskListWidget.SetMetaNpcType // (Final|Native|Public|BlueprintCallable) // @ game+0x1d1150c
	struct TArray<struct FUINPCTask> GetAvailableTasks(); // Function OPP.RBAvailableTaskListWidget.GetAvailableTasks // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d107e0
};

// Class OPP.RBBackgroundCharacter
// Size: 0x630 (Inherited: 0x248)
struct ARBBackgroundCharacter : AActor {
	struct USkeletalMeshComponent* Mesh; // 0x248(0x08)
	struct URBSoundComponent* SoundComponent; // 0x250(0x08)
	struct URBBackgroundCharacterStation* DefaultStation; // 0x258(0x08)
	struct FBackgroundCharacterLocomotionSet WalkLocomotionSet; // 0x260(0xa8)
	struct FBackgroundCharacterLocomotionSet AlternateLocomotionSet; // 0x308(0xa8)
	struct TArray<struct URBVOMapping*> VOMappingOptions; // 0x3b0(0x10)
	struct FName FoleyType_Switch; // 0x3c0(0x08)
	struct UAkAudioEvent* FootstepWalk; // 0x3c8(0x08)
	struct UAkAudioEvent* FootstepRun; // 0x3d0(0x08)
	float WalkMovementSpeed; // 0x3d8(0x04)
	float MinTravelDistanceForStartAnim; // 0x3dc(0x04)
	struct FRandomMovementParams RandomMovementCfg; // 0x3e0(0x18)
	bool bAlwaysUseAlternateLocomotion; // 0x3f8(0x01)
	bool bCanLookAround; // 0x3f9(0x01)
	bool bUpdateLocomotionAnimData; // 0x3fa(0x01)
	char pad_3FB[0x5]; // 0x3fb(0x05)
	struct FRandomStationData Station; // 0x400(0x10)
	char pad_410[0x30]; // 0x410(0x30)
	struct ARBPawn* FocusPawn; // 0x440(0x08)
	char pad_448[0x48]; // 0x448(0x48)
	struct FBCAnimatedStartData AnimatedStart; // 0x490(0x30)
	struct FBCAnimatedStopData AnimatedStop; // 0x4c0(0x50)
	struct FRailSlider RailSlider; // 0x510(0x40)
	struct UAnimationAsset* PlayingAnim; // 0x550(0x08)
	char pad_558[0x30]; // 0x558(0x30)
	struct URBAnimInstanceBackgroundCharacter* AnimInst; // 0x588(0x08)
	char pad_590[0x50]; // 0x590(0x50)
	struct FFootstepData LastFootStepData; // 0x5e0(0x28)
	struct URBVOMapping* VOMappingAsset; // 0x608(0x08)
	struct FString VoiceType; // 0x610(0x10)
	char pad_620[0x10]; // 0x620(0x10)

	void SnapToStartPosition(); // Function OPP.RBBackgroundCharacter.SnapToStartPosition // (Final|Native|Public|BlueprintCallable) // @ game+0x1d11590
};

// Class OPP.RBBackgroundCharacterStation
// Size: 0x98 (Inherited: 0x28)
struct URBBackgroundCharacterStation : UObject {
	struct FRBBackgroundCharacterStationParams StationConfig; // 0x28(0x60)
	struct UAnimSequence* PreviewAnimSeq; // 0x88(0x08)
	float PreviewTime; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class OPP.RBBackgroundDoor
// Size: 0x260 (Inherited: 0x248)
struct ARBBackgroundDoor : AActor {
	float AutomaticOpenDistance; // 0x248(0x04)
	float MinOpenDuration; // 0x24c(0x04)
	char pad_250[0x10]; // 0x250(0x10)

	void Event_OpenDoor(); // Function OPP.RBBackgroundDoor.Event_OpenDoor // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_CloseDoor(); // Function OPP.RBBackgroundDoor.Event_CloseDoor // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBBackToLobbyMenu
// Size: 0x350 (Inherited: 0x308)
struct URBBackToLobbyMenu : URBMenuWidget {
	char pad_308[0x48]; // 0x308(0x48)

	bool LeavingWillLeaveParty(); // Function OPP.RBBackToLobbyMenu.LeavingWillLeaveParty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10aac
	bool IsOperationPending(); // Function OPP.RBBackToLobbyMenu.IsOperationPending // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10a40
	bool IsLeaving(); // Function OPP.RBBackToLobbyMenu.IsLeaving // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10a1c
	void Event_Refresh(); // Function OPP.RBBackToLobbyMenu.Event_Refresh // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	bool CanReturnWithParty(); // Function OPP.RBBackToLobbyMenu.CanReturnWithParty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d103d0
	void BackToLobby(bool bWithParty); // Function OPP.RBBackToLobbyMenu.BackToLobby // (Final|Native|Public|BlueprintCallable) // @ game+0x1d10350
};

// Class OPP.RBBareBonesInteractionComponent
// Size: 0x660 (Inherited: 0x600)
struct URBBareBonesInteractionComponent : URBInteractibleComponent {
	struct FMulticastInlineDelegate OnInteractionStarted; // 0x5f8(0x10)
	struct FMulticastInlineDelegate OnDoAction; // 0x608(0x10)
	struct FMulticastInlineDelegate OnInteractionCompleted; // 0x618(0x10)
	struct FMulticastInlineDelegate OnInteractionInterrupted; // 0x628(0x10)
	struct FMulticastInlineDelegate OnPawnInteractingChanged; // 0x638(0x10)
	int32_t RandomSeed; // 0x648(0x04)
	int32_t NumberOfInteract; // 0x64c(0x04)
	struct ARBPawn* pawnInteracting; // 0x650(0x08)

	void OnRep_PawnInteracting(); // Function OPP.RBBareBonesInteractionComponent.OnRep_PawnInteracting // (Native|Public) // @ game+0x1d110e8
};

// Class OPP.RBBaseObjectiveCoordinator
// Size: 0xba8 (Inherited: 0x248)
struct ARBBaseObjectiveCoordinator : AActor {
	char pad_248[0x8]; // 0x248(0x08)
	struct USceneComponent* ObjectiveCoordinatorRoot; // 0x250(0x08)
	struct UBillboardComponent* CoordinatorSprite; // 0x258(0x08)
	struct TArray<struct TSoftObjectPtr<ARBBaseObjectiveCoordinator>> NextObjectiveCoordinators; // 0x260(0x10)
	struct TSoftObjectPtr<ARBBaseObjectiveCoordinator> NextObjectiveCoordinator; // 0x270(0x28)
	bool bAutoStartOnStageStarted; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	struct TArray<struct FRBMissionID> ExclusiveMissionIds; // 0x2a0(0x10)
	struct FName OptionalNameID; // 0x2b0(0x08)
	struct TArray<struct AActor*> ObjectiveActorClasses; // 0x2b8(0x10)
	struct TArray<struct TSoftObjectPtr<AActor>> ObjectiveActors; // 0x2c8(0x10)
	bool bUseFixedMaxCount; // 0x2d8(0x01)
	char pad_2D9[0x7]; // 0x2d9(0x07)
	struct FConfigurableInt FixedMaxCount; // 0x2e0(0xc8)
	bool bIsMainObjective; // 0x3a8(0x01)
	bool bHideCompletionMessage; // 0x3a9(0x01)
	char pad_3AA[0x2]; // 0x3aa(0x02)
	float StartDelay; // 0x3ac(0x04)
	bool bEnabledByDefault; // 0x3b0(0x01)
	bool bDisablePlayerRespawnInStage; // 0x3b1(0x01)
	bool bSkipRandomStateCheckForPrimaryActorValidity; // 0x3b2(0x01)
	bool bPopulateSecondaryActorsFirst; // 0x3b3(0x01)
	bool bDontChangeIgnoredRandomActors; // 0x3b4(0x01)
	char pad_3B5[0x3]; // 0x3b5(0x03)
	struct TArray<struct TSoftObjectPtr<AActor>> ExcludedObjectiveActors; // 0x3b8(0x10)
	bool bAlwaysSendInAnalytics; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct TArray<struct TSoftObjectPtr<ARBBaseObjectiveCoordinator>> LinkedCoordinatorsToCompleteOnCompletion; // 0x3d0(0x10)
	bool bRestoresHealthOnCompleteWithPerk; // 0x3e0(0x01)
	char pad_3E1[0x3]; // 0x3e1(0x03)
	int32_t ObjectiveMissionIndex; // 0x3e4(0x04)
	bool bIsConcurrentObjective; // 0x3e8(0x01)
	bool bUseHUDIcons; // 0x3e9(0x01)
	enum class EGameObjectiveType gameObjectiveType; // 0x3ea(0x01)
	bool bShowObjectiveIconDistance; // 0x3eb(0x01)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct FText ObjectiveLevelText; // 0x3f0(0x18)
	struct FText CompletionInProgressText; // 0x408(0x18)
	struct FText CompletionInProgressTutorialText; // 0x420(0x18)
	struct FName CustomCompletionInProgressTutorialID; // 0x438(0x08)
	struct FText ObjectiveTitle; // 0x440(0x18)
	struct TArray<struct FTutorialTextData> CustomTutorialOnStartSequence; // 0x458(0x10)
	struct FNarrativeScreenAnimationData NarrativeScreenAnimationData; // 0x468(0x18)
	bool bPlayObjectiveIntroAnimation; // 0x480(0x01)
	char bUseObjectiveActorsRandomization : 1; // 0x481(0x01)
	char pad_481_1 : 7; // 0x481(0x01)
	char pad_482[0x6]; // 0x482(0x06)
	struct FObjectiveRandomizationSetupData PrimaryActorsRandomizationSetup; // 0x488(0x4e8)
	char bOverride_MaxWatchDistance : 1; // 0x970(0x01)
	char pad_970_1 : 7; // 0x970(0x01)
	char pad_971[0x7]; // 0x971(0x07)
	struct FConfigurableFloat MaxWatchDistanceOverride; // 0x978(0xc8)
	struct UAkAudioEvent* ObjectiveStartedSoundOverride; // 0xa40(0x08)
	char bOverride_ObjectiveStartedSound : 1; // 0xa48(0x01)
	char pad_A48_1 : 7; // 0xa48(0x01)
	char pad_A49[0x7]; // 0xa49(0x07)
	struct UAkAudioEvent* ObjectiveStartedVoice; // 0xa50(0x08)
	struct UAkAudioEvent* ObjectiveCompletedSoundOverride; // 0xa58(0x08)
	char bOverride_ObjectiveCompletedSound : 1; // 0xa60(0x01)
	char pad_A60_1 : 7; // 0xa60(0x01)
	char pad_A61[0x7]; // 0xa61(0x07)
	struct UAkAudioEvent* ObjectiveStepCompletedSoundOverride; // 0xa68(0x08)
	char bOverride_ObjectiveStepCompletedSound : 1; // 0xa70(0x01)
	char pad_A70_1 : 7; // 0xa70(0x01)
	char pad_A71[0x7]; // 0xa71(0x07)
	struct UAkAudioEvent* ObjectiveCompletedStepRevertedSoundOverride; // 0xa78(0x08)
	char bOverride_ObjectiveCompletedStepRevertedSound : 1; // 0xa80(0x01)
	char pad_A80_1 : 7; // 0xa80(0x01)
	char pad_A81[0x3]; // 0xa81(0x03)
	float PercentageOfStageXPForCompletion; // 0xa84(0x04)
	float PercentageOfStageXPForSteps; // 0xa88(0x04)
	bool bHasTimeLimit; // 0xa8c(0x01)
	char pad_A8D[0x3]; // 0xa8d(0x03)
	float TimeLimit; // 0xa90(0x04)
	bool bFailOnEndOfStage; // 0xa94(0x01)
	enum class EObjectiveCoordinatorState CoordinatorState; // 0xa95(0x01)
	char pad_A96[0x2]; // 0xa96(0x02)
	struct FMulticastInlineDelegate OnObjectiveCoordinatorStateChanged; // 0xa98(0x10)
	struct FMulticastInlineDelegate OnProgressChangedEvent; // 0xaa8(0x10)
	struct FMulticastInlineDelegate OnObjectiveCoordinatorCompleted; // 0xab8(0x10)
	struct FMulticastInlineDelegate OnObjectiveCoordinatorStarted; // 0xac8(0x10)
	struct FMulticastInlineDelegate OnSingleObjectiveCompleted; // 0xad8(0x10)
	struct FMulticastInlineDelegate OnSingleCompletedObjectiveReverted; // 0xae8(0x10)
	struct FMulticastInlineDelegate OnCompletionInProgressChanged; // 0xaf8(0x10)
	struct TArray<struct TSoftObjectPtr<ARBPlayer>> SpecificPlayers; // 0xb08(0x10)
	float StartedTime; // 0xb18(0x04)
	float EndedTime; // 0xb1c(0x04)
	float CurrentObjectiveStepProgressRatio; // 0xb20(0x04)
	float progressRatio; // 0xb24(0x04)
	struct TArray<struct AActor*> RemainingObjectives; // 0xb28(0x10)
	int32_t CurrentObjectiveCount; // 0xb38(0x04)
	int32_t ObjectiveMaxCount; // 0xb3c(0x04)
	struct FText TutorialText; // 0xb40(0x18)
	struct FName TutorialId; // 0xb58(0x08)
	char pad_B60[0x8]; // 0xb60(0x08)
	struct TArray<struct AActor*> ObjectiveActorsInitialized; // 0xb68(0x10)
	char pad_B78[0x30]; // 0xb78(0x30)

	void StopCoordinator(); // Function OPP.RBBaseObjectiveCoordinator.StopCoordinator // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d115b8
	void StartCoordinator(); // Function OPP.RBBaseObjectiveCoordinator.StartCoordinator // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d115a4
	void SetEnabled(bool Enabled); // Function OPP.RBBaseObjectiveCoordinator.SetEnabled // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d1148c
	void OnStageReady(struct FRBStageID& StageID, struct FRBMissionID& MissionID); // Function OPP.RBBaseObjectiveCoordinator.OnStageReady // (Native|Protected|HasOutParms) // @ game+0x1d11288
	void OnRep_StartedTime(); // Function OPP.RBBaseObjectiveCoordinator.OnRep_StartedTime // (Final|Native|Protected) // @ game+0x1d1112c
	void OnRep_RemainingObjectives(); // Function OPP.RBBaseObjectiveCoordinator.OnRep_RemainingObjectives // (Native|Protected) // @ game+0x1d11100
	void OnRep_ObjectiveMaxCount(); // Function OPP.RBBaseObjectiveCoordinator.OnRep_ObjectiveMaxCount // (Final|Native|Protected) // @ game+0x1d110d4
	void OnRep_CurrentObjectiveCount(); // Function OPP.RBBaseObjectiveCoordinator.OnRep_CurrentObjectiveCount // (Final|Native|Protected) // @ game+0x1d110c0
	void OnRep_CoordinatorState(enum class EObjectiveCoordinatorState oldState); // Function OPP.RBBaseObjectiveCoordinator.OnRep_CoordinatorState // (Native|Protected) // @ game+0x1d1103c
	void OnFailConditionTimerElapsed(); // Function OPP.RBBaseObjectiveCoordinator.OnFailConditionTimerElapsed // (Final|Native|Protected) // @ game+0x1d104a4
	void OnEndOfStage(struct FRBStageID& StageID, struct FRBMissionID& MissionID, bool isRestart); // Function OPP.RBBaseObjectiveCoordinator.OnEndOfStage // (Native|Protected|HasOutParms) // @ game+0x1d10cf0
	void Multicast_OnSingleObjectiveCompleted(struct AActor* Player, struct AActor* objectiveActor, bool IsFinalObjective, bool bRemoveFromRemainingList); // Function OPP.RBBaseObjectiveCoordinator.Multicast_OnSingleObjectiveCompleted // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1d10bac
	void Multicast_OnSingleCompletedObjectiveReverted(struct AActor* objectiveActor, bool bReaddToRemainingList); // Function OPP.RBBaseObjectiveCoordinator.Multicast_OnSingleCompletedObjectiveReverted // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x1d10ae0
	bool IsUserFacing(); // Function OPP.RBBaseObjectiveCoordinator.IsUserFacing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10a88
	bool IsStarted(); // Function OPP.RBBaseObjectiveCoordinator.IsStarted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10a6c
	bool IsFinalObjective(); // Function OPP.RBBaseObjectiveCoordinator.IsFinalObjective // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d109f4
	bool IsCompleted(); // Function OPP.RBBaseObjectiveCoordinator.IsCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d109d8
	bool HasIntermediateObjectiveText(); // Function OPP.RBBaseObjectiveCoordinator.HasIntermediateObjectiveText // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d109b0
	int32_t GetMaxCount(); // Function OPP.RBBaseObjectiveCoordinator.GetMaxCount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10988
	enum class EMainObjectiveType GetMainObjectiveType(); // Function OPP.RBBaseObjectiveCoordinator.GetMainObjectiveType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x150d484
	struct TArray<struct FIntermediateObjectiveData> GetIntermediateObjectivesData(); // Function OPP.RBBaseObjectiveCoordinator.GetIntermediateObjectivesData // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d108e4
	enum class EGameObjectiveType GetGameObjectiveType(); // Function OPP.RBBaseObjectiveCoordinator.GetGameObjectiveType // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d108bc
	int32_t GetCurrentCompletedCount(); // Function OPP.RBBaseObjectiveCoordinator.GetCurrentCompletedCount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10894
	struct FString GetCoordinatorName(); // Function OPP.RBBaseObjectiveCoordinator.GetCoordinatorName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10858
	void ForceRefreshObjectiveText(); // Function OPP.RBBaseObjectiveCoordinator.ForceRefreshObjectiveText // (Native|Public|BlueprintCallable) // @ game+0x13b1e38
	void FailCoordinator(); // Function OPP.RBBaseObjectiveCoordinator.FailCoordinator // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d104a4
	void Event_OnSetupSingleObjectiveActor(struct AActor* objectiveActor); // Function OPP.RBBaseObjectiveCoordinator.Event_OnSetupSingleObjectiveActor // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnCoordinatorStateChanged(enum class EObjectiveCoordinatorState oldState, enum class EObjectiveCoordinatorState newState); // Function OPP.RBBaseObjectiveCoordinator.Event_OnCoordinatorStateChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnCleanSingleObjectiveActor(struct AActor* objectiveActor); // Function OPP.RBBaseObjectiveCoordinator.Event_OnCleanSingleObjectiveActor // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Editor_RebuildMissionObjectiveIndexes(); // Function OPP.RBBaseObjectiveCoordinator.Editor_RebuildMissionObjectiveIndexes // (Final|Native|Public) // @ game+0x1521dbc
	void CompleteCoordinator(bool forceCompletion); // Function OPP.RBBaseObjectiveCoordinator.CompleteCoordinator // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d10424
	bool BP_ShouldShowObjectiveInHUD(); // Function OPP.RBBaseObjectiveCoordinator.BP_ShouldShowObjectiveInHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d10000
	bool BP_HasContinuousProgress(); // Function OPP.RBBaseObjectiveCoordinator.BP_HasContinuousProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0ff14
	int32_t BP_GetRemainingObjectiveCount(); // Function OPP.RBBaseObjectiveCoordinator.BP_GetRemainingObjectiveCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0feec
	struct TArray<struct AActor*> BP_GetRemainingObjectiveActors(); // Function OPP.RBBaseObjectiveCoordinator.BP_GetRemainingObjectiveActors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0fe90
	int32_t BP_GetObjectiveMaxCount(); // Function OPP.RBBaseObjectiveCoordinator.BP_GetObjectiveMaxCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0fe78
	struct FText BP_GetObjectiveLevelText(); // Function OPP.RBBaseObjectiveCoordinator.BP_GetObjectiveLevelText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0fe34
	struct UAkAudioEvent* BP_GetFailedSound(); // Function OPP.RBBaseObjectiveCoordinator.BP_GetFailedSound // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1521c28
	struct TArray<struct AActor*> BP_GetAllValidPrimaryObjectiveActors(); // Function OPP.RBBaseObjectiveCoordinator.BP_GetAllValidPrimaryObjectiveActors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d0fdf8
	void BP_CompleteSingleObjective(struct ARBPawn* Player, struct AActor* objectiveActor); // Function OPP.RBBaseObjectiveCoordinator.BP_CompleteSingleObjective // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d0fd2c
};

// Class OPP.RBBasePushable
// Size: 0x540 (Inherited: 0x248)
struct ARBBasePushable : AActor {
	bool bCanBePushedStartingValue; // 0x248(0x01)
	bool bAlwaysTick; // 0x249(0x01)
	char pad_24A[0x2]; // 0x24a(0x02)
	float WalkPushSpeed; // 0x24c(0x04)
	float RunPushSpeed; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct FConfigurableFloat BaseSpeedMultiplier; // 0x258(0xc8)
	bool bMajorDisturbance; // 0x320(0x01)
	char pad_321[0x3]; // 0x321(0x03)
	float MajorDisturbanceStimulusDistance; // 0x324(0x04)
	float MajorDisturbanceTriggerDistance; // 0x328(0x04)
	bool bTestClient; // 0x32c(0x01)
	char pad_32D[0x3]; // 0x32d(0x03)
	struct UAkAudioEvent* StartPushingSoundEvent; // 0x330(0x08)
	struct UAkAudioEvent* StopPushingSoundEvent; // 0x338(0x08)
	struct UAkAudioEvent* StuckSoundEvent; // 0x340(0x08)
	struct UAkAudioEvent* CollisionSoundEvent; // 0x348(0x08)
	struct FString PushingMovementSoundSwitchState; // 0x350(0x10)
	struct FString StuckSoundSwitchState; // 0x360(0x10)
	struct FString SpeedRTPCName; // 0x370(0x10)
	struct FVector2D SpeedRTPCMapping; // 0x380(0x08)
	bool SpeedRTPCAlsoAppliedToGlobal; // 0x388(0x01)
	char pad_389[0x3]; // 0x389(0x03)
	float CameraShakeIntensity; // 0x38c(0x04)
	struct UBoxComponent* NavCollision; // 0x390(0x08)
	float NavCollisionUpdateDistance; // 0x398(0x04)
	struct FVector NavCollisionIdleScale; // 0x39c(0x0c)
	struct FVector NavCollisionMovingScale; // 0x3a8(0x0c)
	bool bCanBePushed; // 0x3b4(0x01)
	bool bHasCustomUninteractableText; // 0x3b5(0x01)
	char pad_3B6[0x2]; // 0x3b6(0x02)
	struct FText CustomUninteractableText; // 0x3b8(0x18)
	float CustomWalkPushSpeed; // 0x3d0(0x04)
	float CustomRunPushSpeed; // 0x3d4(0x04)
	bool bHardToPush; // 0x3d8(0x01)
	char pad_3D9[0x1f]; // 0x3d9(0x1f)
	struct FMulticastInlineDelegate OnStartOrStopMoving; // 0x3f8(0x10)
	struct FMulticastInlineDelegate OnCanBePushedChanged; // 0x408(0x10)
	struct FMulticastInlineDelegate OnPushEvent; // 0x418(0x10)
	struct FMulticastInlineDelegate OnPawnPushingChangedEvent; // 0x428(0x10)
	bool bAllowBotsToJumpOver; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct URBNavLinkComponent* ForwardNavLinkComp; // 0x440(0x08)
	float ForwardNavLinkDepth; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	struct URBNavLinkComponent* SideNavLinkComp; // 0x450(0x08)
	float SideNavLinkDepth; // 0x458(0x04)
	char pad_45C[0x4]; // 0x45c(0x04)
	struct URBSoundComponent* SoundComponent; // 0x460(0x08)
	bool bPushableInitialReplication; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	struct TArray<struct URBPushableComponent*> PushableComponents; // 0x470(0x10)
	struct TArray<struct UPrimitiveComponent*> PushableCollisions; // 0x480(0x10)
	bool bIsInteractible_Server; // 0x490(0x01)
	char pad_491[0xf]; // 0x491(0x0f)
	struct FVector MovementLastFrame; // 0x4a0(0x0c)
	struct FVector MovementThisFrame; // 0x4ac(0x0c)
	char pad_4B8[0x68]; // 0x4b8(0x68)
	struct ARBBot* BotTraversing; // 0x520(0x08)
	bool bKeepTickingWithNoPushingPawns; // 0x528(0x01)
	bool Client_bKeepTickingWithNoPushingPawns; // 0x529(0x01)
	char pad_52A[0x6]; // 0x52a(0x06)
	struct TArray<struct AActor*> IgnoredWhenMovingActors; // 0x530(0x10)

	void Tick_Pushable(float DeltaTime); // Function OPP.RBBasePushable.Tick_Pushable // (Native|Event|Public|BlueprintEvent) // @ game+0x1d25750
	void Tick_NonPushable(float DeltaTime); // Function OPP.RBBasePushable.Tick_NonPushable // (Native|Event|Public|BlueprintEvent) // @ game+0x1d256c8
	void SetIsHardToPush(bool bHardToPushValue); // Function OPP.RBBasePushable.SetIsHardToPush // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d233f8
	void SetInteractionsEnabled_Server(bool bEnabled); // Function OPP.RBBasePushable.SetInteractionsEnabled_Server // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d23370
	void OnRep_PushableInitialReplication(); // Function OPP.RBBasePushable.OnRep_PushableInitialReplication // (Final|Native|Private) // @ game+0x13b1f70
	void OnRep_KeepTickingWithNoPushingPawns(); // Function OPP.RBBasePushable.OnRep_KeepTickingWithNoPushingPawns // (Final|Native|Private) // @ game+0x1d2173c
	void OnRep_CanBePushed(); // Function OPP.RBBasePushable.OnRep_CanBePushed // (Final|Native|Private) // @ game+0x1d21728
	void Multicast_ShakePushable(); // Function OPP.RBBasePushable.Multicast_ShakePushable // (Net|Native|Event|NetMulticast|Public) // @ game+0x1d21684
	void Multicast_PushableStuck(bool bFromCollision); // Function OPP.RBBasePushable.Multicast_PushableStuck // (Net|Native|Event|NetMulticast|Public) // @ game+0x1d21600
	bool IsMoving(); // Function OPP.RBBasePushable.IsMoving // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d20860
	bool IsConsideredMoving(); // Function OPP.RBBasePushable.IsConsideredMoving // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d200c0
	struct ARBLedgeMarker* GetLedgeMarkerClosestTo(struct FVector& Location); // Function OPP.RBBasePushable.GetLedgeMarkerClosestTo // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent|Const) // @ game+0x1d1d028
	void Event_ShakePushable(); // Function OPP.RBBasePushable.Event_ShakePushable // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnPawnPushingChanged(struct URBPushableComponent* pushableComponent, struct ARBPawn* Pawn); // Function OPP.RBBasePushable.Event_OnPawnPushingChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnCanBePushedChanged(bool canBePushed); // Function OPP.RBBasePushable.Event_OnCanBePushedChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BP_SetKeepTickingWithNoPushingPawns(bool bKeepTicking); // Function OPP.RBBasePushable.BP_SetKeepTickingWithNoPushingPawns // (Final|Native|Public|BlueprintCallable) // @ game+0x1d17aec
	void BP_SetCustomUninteractableText_Server(struct FText Text); // Function OPP.RBBasePushable.BP_SetCustomUninteractableText_Server // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d17a30
	void BP_SetCustomPushSpeed_Server(float walkSpeed, float runSpeed); // Function OPP.RBBasePushable.BP_SetCustomPushSpeed_Server // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d17964
	void BP_SetCanBePushed_Server(bool bValue); // Function OPP.RBBasePushable.BP_SetCanBePushed_Server // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d178e4
	void BP_PostMove(struct FVector DeltaLocation); // Function OPP.RBBasePushable.BP_PostMove // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x201e6d4
	struct TArray<struct ARBPawn*> BP_GetPawnsPushing(); // Function OPP.RBBasePushable.BP_GetPawnsPushing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d17754
	void BP_ClearCustomUninteractableText_Server(); // Function OPP.RBBasePushable.BP_ClearCustomUninteractableText_Server // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d17714
	void BP_ClearCustomPush_Server(); // Function OPP.RBBasePushable.BP_ClearCustomPush_Server // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d176f4
};

// Class OPP.RBInteractibleContainer
// Size: 0x4d0 (Inherited: 0x300)
struct ARBInteractibleContainer : ARBContainer {
	char pad_300[0x70]; // 0x300(0x70)
	bool bCanBeLocked; // 0x370(0x01)
	bool bForceLock; // 0x371(0x01)
	bool bForceTrap; // 0x372(0x01)
	bool bAutoOpenOnUnlock; // 0x373(0x01)
	char pad_374[0x4]; // 0x374(0x04)
	struct AActor* LockingPanelClass; // 0x378(0x08)
	struct ARBContainerTrapTriggerable* TrapClass; // 0x380(0x08)
	float MinTrapDelay; // 0x388(0x04)
	float MaxTrapDelay; // 0x38c(0x04)
	struct URBInteractionZoneComponent* InteractionZone; // 0x390(0x08)
	struct USceneComponent* TrapRef; // 0x398(0x08)
	struct USceneComponent* LockingPanelRef; // 0x3a0(0x08)
	struct ARBContainerTrapTriggerable* LinkedTrap; // 0x3a8(0x08)
	struct AActor* LinkedLockingPanel; // 0x3b0(0x08)
	struct FScheduledBool IsOpened; // 0x3b8(0x70)
	struct FString IntreractibleContainerSoundSwitch; // 0x428(0x10)
	struct FScheduledUObject InteractingPawn; // 0x438(0x88)
	struct URBHackPanelComponent* HackPanel; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)

	void SnapToState_Implementation(); // Function OPP.RBInteractibleContainer.SnapToState_Implementation // (Native|Public) // @ game+0x1d84560
	void OpenContainer(); // Function OPP.RBInteractibleContainer.OpenContainer // (Final|Native|Public|BlueprintCallable) // @ game+0x1d843e4
	void OnRep_PawnInteracting(); // Function OPP.RBInteractibleContainer.OnRep_PawnInteracting // (Final|Native|Protected) // @ game+0x1d843b0
	void OnRep_LinkedLockingPanel(); // Function OPP.RBInteractibleContainer.OnRep_LinkedLockingPanel // (Final|Native|Protected) // @ game+0x1d84370
	void OnRep_IsOpened(); // Function OPP.RBInteractibleContainer.OnRep_IsOpened // (Final|Native|Protected) // @ game+0x1d84354
	void OnPawnInteractingChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBInteractibleContainer.OnPawnInteractingChangedCallback // (Final|Native|Protected) // @ game+0x1d8421c
	void OnPanelUnlocked(struct URBInteractiblePanelComponent* panel, struct ARBPawn* pawnInteracting); // Function OPP.RBInteractibleContainer.OnPanelUnlocked // (Final|Native|Public) // @ game+0x1d8412c
	void IsOpenedChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBInteractibleContainer.IsOpenedChangedCallback // (Final|Native|Protected) // @ game+0x1d83f0c
	struct URBInteractionZoneComponent* GivesFocusTo(struct ARBPawn* interactorPawn); // Function OPP.RBInteractibleContainer.GivesFocusTo // (Final|Native|Public) // @ game+0x1d83de8
	void Event_SpawnLock(); // Function OPP.RBInteractibleContainer.Event_SpawnLock // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnPanelUnlocked(); // Function OPP.RBInteractibleContainer.Event_OnPanelUnlocked // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnIsOpenedChanged(); // Function OPP.RBInteractibleContainer.Event_OnIsOpenedChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
};

// Class OPP.RBBaseQuestItemContainer
// Size: 0x4f0 (Inherited: 0x4d0)
struct ARBBaseQuestItemContainer : ARBInteractibleContainer {
	char pad_4D0[0x8]; // 0x4d0(0x08)
	bool bUseForcedContentForQuest; // 0x4d8(0x01)
	char pad_4D9[0x7]; // 0x4d9(0x07)
	struct ARBPickup* QuestItemClass; // 0x4e0(0x08)
	char pad_4E8[0x8]; // 0x4e8(0x08)
};

// Class OPP.RBHidespotComponent
// Size: 0x910 (Inherited: 0x600)
struct URBHidespotComponent : URBInteractibleComponent {
	char pad_600[0x18]; // 0x600(0x18)
	enum class EHidespotCategory HidespotType; // 0x618(0x01)
	char VerticalAllowedDirection; // 0x619(0x01)
	bool bLargeClearance; // 0x61a(0x01)
	char pad_61B[0x1]; // 0x61b(0x01)
	float AnchorRotationAngle; // 0x61c(0x04)
	float MaxGameplayPeekRatio; // 0x620(0x04)
	bool bAllowExitWithMovement; // 0x624(0x01)
	char pad_625[0x3]; // 0x625(0x03)
	struct UBoxComponent* UsableSurfaceVolume; // 0x628(0x08)
	bool bSharedSpace; // 0x630(0x01)
	bool bIndependantHidespot; // 0x631(0x01)
	bool bSharedSpaceAlwaysFind; // 0x632(0x01)
	bool bGiveFocusToSharedSpaceIfOccupied; // 0x633(0x01)
	bool bSiblingsOverlap; // 0x634(0x01)
	char pad_635[0x3]; // 0x635(0x03)
	float FindHiddenPlayerProbability; // 0x638(0x04)
	struct FVector ClearanceTestOffset; // 0x63c(0x0c)
	struct FVector DarknessTestOffset; // 0x648(0x0c)
	char pad_654[0x4]; // 0x654(0x04)
	struct AActor* AdditionalCollisionActor; // 0x658(0x08)
	struct UAkAuxBus* Reverb; // 0x660(0x08)
	struct FName SwitchName; // 0x668(0x08)
	bool bUseCustomSoundSettings; // 0x670(0x01)
	char pad_671[0x3]; // 0x671(0x03)
	float ClosedOcclusion; // 0x674(0x04)
	float PeekingOcclusion; // 0x678(0x04)
	char pad_67C[0x4]; // 0x67c(0x04)
	struct UAkAudioEvent* DoorStartedMovingAudioEvent; // 0x680(0x08)
	struct UAkAudioEvent* DoorStoppedMovingAudioEvent; // 0x688(0x08)
	struct FHidespotCameraParams HiddenCameraParams; // 0x690(0x10)
	struct FHidespotCameraParams AnimatedPeekCameraParams; // 0x6a0(0x10)
	struct FGameplayTagContainer EnableOnlyForNPCTags; // 0x6b0(0x20)
	struct FGameplayTagContainer DisableForNPCTags; // 0x6d0(0x20)
	bool bCanBeDisabled; // 0x6f0(0x01)
	bool bForceDisabled; // 0x6f1(0x01)
	bool bWarnOnForceDisabled; // 0x6f2(0x01)
	bool bCanBeUsedByPouncer; // 0x6f3(0x01)
	struct FRotator PouncingPivotRotation; // 0x6f4(0x0c)
	float PouncerTriggerDistanceCrouchedHorz; // 0x700(0x04)
	float PouncerTriggerDistanceHorz; // 0x704(0x04)
	float PouncerTriggerDistanceDown; // 0x708(0x04)
	float PouncerTriggerDistanceUp; // 0x70c(0x04)
	float PouncerTriggerAngle; // 0x710(0x04)
	float PouncerShynessCloseRange; // 0x714(0x04)
	float PouncerShynessFarRange; // 0x718(0x04)
	float PouncerShynessMultiplier; // 0x71c(0x04)
	int32_t RandomSeed; // 0x720(0x04)
	char pad_724[0x4]; // 0x724(0x04)
	struct FMulticastInlineDelegate OnDoAction; // 0x728(0x10)
	struct FMulticastInlineDelegate OnDisabledChangedEvent; // 0x738(0x10)
	char pad_748[0xc]; // 0x748(0x0c)
	int32_t NumberOfInteract; // 0x754(0x04)
	struct FScheduledUObject PawnHiddenInside; // 0x758(0x88)
	struct FScheduledUObject pawnInteracting; // 0x7e0(0x88)
	struct TArray<struct URBHidespotComponent*> SiblingHidespots; // 0x868(0x10)
	struct TArray<struct UPrimitiveComponent*> InteractionIgnoreComponents; // 0x878(0x10)
	bool bPouncerEntered; // 0x888(0x01)
	char pad_889[0xb]; // 0x889(0x0b)
	bool bDisabled; // 0x894(0x01)
	char pad_895[0x3]; // 0x895(0x03)
	struct ARBNPC* LastHiddenPouncer; // 0x898(0x08)
	struct ARBNPC* PouncerReservation; // 0x8a0(0x08)
	struct USceneComponent* Anchor; // 0x8a8(0x08)
	struct USceneComponent* SoundLocationRef; // 0x8b0(0x08)
	struct USceneComponent* Pivot; // 0x8b8(0x08)
	struct URBRepulsionComponent* PawnHiddenRepulsion; // 0x8c0(0x08)
	struct URBRoomAssociationComponent* roomAssociationComponent; // 0x8c8(0x08)
	char pad_8D0[0x8]; // 0x8d0(0x08)
	struct URBSoundComponent* SoundComponent; // 0x8d8(0x08)
	char pad_8E0[0x8]; // 0x8e0(0x08)
	struct ARBPawn* LastPivotInteractor; // 0x8e8(0x08)
	char pad_8F0[0x20]; // 0x8f0(0x20)

	void OnRep_PouncerEntered(); // Function OPP.RBHidespotComponent.OnRep_PouncerEntered // (Final|Native|Public) // @ game+0x1d78a70
	void OnRep_PawnInteracting(); // Function OPP.RBHidespotComponent.OnRep_PawnInteracting // (Final|Native|Public) // @ game+0x1d78a54
	void OnRep_PawnHiddenInside(); // Function OPP.RBHidespotComponent.OnRep_PawnHiddenInside // (Final|Native|Public) // @ game+0x1d78a38
	void OnRep_Disabled(); // Function OPP.RBHidespotComponent.OnRep_Disabled // (Final|Native|Public) // @ game+0x1d7895c
	void OnPawnInteractingChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBHidespotComponent.OnPawnInteractingChangedCallback // (Final|Native|Public) // @ game+0x1d78784
	void OnPawnHiddenInsideChangedCallback(enum class EScheduledPropertyValueChangedType changedType); // Function OPP.RBHidespotComponent.OnPawnHiddenInsideChangedCallback // (Final|Native|Public) // @ game+0x1d78704
	void InitializeClearanceBoxes(); // Function OPP.RBHidespotComponent.InitializeClearanceBoxes // (Final|Native|Public|BlueprintCallable) // @ game+0x1521dbc
	void FixUpPouncer(); // Function OPP.RBHidespotComponent.FixUpPouncer // (Final|Native|Public) // @ game+0x1d77b64
	void BP_DisableHidespot(); // Function OPP.RBHidespotComponent.BP_DisableHidespot // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d77b40
};

// Class OPP.RBBedHidespotComponent
// Size: 0x920 (Inherited: 0x910)
struct URBBedHidespotComponent : URBHidespotComponent {
	bool bRightSide; // 0x910(0x01)
	bool bPouncerVisibleFromFront; // 0x911(0x01)
	char pad_912[0x6]; // 0x912(0x06)
	struct URBBedHidespotComponent* SharedBedHidespotComponent; // 0x918(0x08)
};

// Class OPP.RBBlockable
// Size: 0x28 (Inherited: 0x28)
struct URBBlockable : UInterface {

	enum class EBlockableState GetBlockableState(); // Function OPP.RBBlockable.GetBlockableState // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d1b664
};

// Class OPP.RBBlockingVolume
// Size: 0x2b8 (Inherited: 0x298)
struct ARBBlockingVolume : ANavModifierVolume {
	bool bEnabled; // 0x298(0x01)
	bool bBlockNPCs; // 0x299(0x01)
	bool bBlockPlayers; // 0x29a(0x01)
	bool bBlockInteractions; // 0x29b(0x01)
	bool bBlockVisibility; // 0x29c(0x01)
	enum class EPlayerCollisionType PlayerCollisionType; // 0x29d(0x01)
	bool bBlockPlayersCarryingLargeObjects; // 0x29e(0x01)
	enum class ECollisionChannel EffectiveCollisionChannel; // 0x29f(0x01)
	char bOverrideWalkableSlopeOnInstance : 1; // 0x2a0(0x01)
	char pad_2A0_1 : 7; // 0x2a0(0x01)
	char pad_2A1[0x3]; // 0x2a1(0x03)
	struct FWalkableSlopeOverride WalkableSlopeOverride; // 0x2a4(0x10)
	bool bCurrentlyEnabled; // 0x2b4(0x01)
	bool bCurrentlyBlockNPCs; // 0x2b5(0x01)
	bool bCurrentlyBlockPlayers; // 0x2b6(0x01)
	char pad_2B7[0x1]; // 0x2b7(0x01)

	void SetBlockingState(bool bNewBlockNPCs, bool bNewBlockPlayers); // Function OPP.RBBlockingVolume.SetBlockingState // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d22ec8
	void OnRep_PropertyChanged(); // Function OPP.RBBlockingVolume.OnRep_PropertyChanged // (Final|Native|Private) // @ game+0x1d21750
	bool GetEnabled(); // Function OPP.RBBlockingVolume.GetEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d1c940
	bool GetBlockVisibility(); // Function OPP.RBBlockingVolume.GetBlockVisibility // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d1b64c
	bool GetBlockPlayers(); // Function OPP.RBBlockingVolume.GetBlockPlayers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d1b62c
	bool GetBlockNPCs(); // Function OPP.RBBlockingVolume.GetBlockNPCs // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d1b60c
	bool GetBlockInteractions(); // Function OPP.RBBlockingVolume.GetBlockInteractions // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d1b5f4
	void EnableBlockingVolume(); // Function OPP.RBBlockingVolume.EnableBlockingVolume // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d19c7c
	void DisableBlockingVolume(); // Function OPP.RBBlockingVolume.DisableBlockingVolume // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1d19074
};

// Class OPP.RBBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct URBBlueprintLibrary : UBlueprintFunctionLibrary {

	void Warning(struct FString warningText); // Function OPP.RBBlueprintLibrary.Warning // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d25dac
	void WaitForPlayerConditions(struct ARBPlayer* Player, struct FLatentActionInfo LatentInfo, struct FRBPlayerConditionSet& conditionSet); // Function OPP.RBBlueprintLibrary.WaitForPlayerConditions // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d25afc
	void UnblockPlayerRespawnInStage(struct UObject* blockOwner); // Function OPP.RBBlueprintLibrary.UnblockPlayerRespawnInStage // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d25a84
	struct FString ToString(struct FUniqueNetIdRepl& UniqueId); // Function OPP.RBBlueprintLibrary.ToString // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d257d8
	void ToggleLedgeMarkerOnActor(struct AActor* Actor, bool bEnabled); // Function OPP.RBBlueprintLibrary.ToggleLedgeMarkerOnActor // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d25958
	void ToggleDebugMenu(); // Function OPP.RBBlueprintLibrary.ToggleDebugMenu // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1521dbc
	void ToggleActor(struct AActor* Actor, bool bEnabled); // Function OPP.RBBlueprintLibrary.ToggleActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d258a0
	void TestPlayerConditions(struct ARBPlayer* Player, enum class EBoolCommandResult& operationResult, struct FRBPlayerConditionSet& conditionSet); // Function OPP.RBBlueprintLibrary.TestPlayerConditions // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d254bc
	void TeleportRelative(struct ARBPlayer* Player, struct AActor* sourceReference, struct AActor* TargetReference, bool bUseTransitionFX); // Function OPP.RBBlueprintLibrary.TeleportRelative // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d25380
	void TeleportPlayer(struct ARBPlayer* Player, struct AActor* targetLocation, bool bUseTransitionFX, bool bUseTargetForRotation, bool bInterruptAction); // Function OPP.RBBlueprintLibrary.TeleportPlayer // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d25014
	void SwitchLevelRandomN(int32_t RandomizerId, int32_t maxOptions, enum class ERandomSwitch10& randomSwitch); // Function OPP.RBBlueprintLibrary.SwitchLevelRandomN // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d24f18
	void SwitchLevelRandom5(int32_t RandomizerId, enum class ERandomSwitch5& randomSwitch); // Function OPP.RBBlueprintLibrary.SwitchLevelRandom5 // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d24e4c
	void SwitchLevelRandom4(int32_t RandomizerId, enum class ERandomSwitch4& randomSwitch); // Function OPP.RBBlueprintLibrary.SwitchLevelRandom4 // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d24d80
	void SwitchLevelRandom3(int32_t RandomizerId, enum class ERandomSwitch3& randomSwitch); // Function OPP.RBBlueprintLibrary.SwitchLevelRandom3 // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d24cb4
	void SwitchLevelRandom2(int32_t RandomizerId, enum class ERandomSwitch2& randomSwitch); // Function OPP.RBBlueprintLibrary.SwitchLevelRandom2 // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d24bf0
	void StopPsychosisOnAllPlayers(bool bFadeOut); // Function OPP.RBBlueprintLibrary.StopPsychosisOnAllPlayers // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d24b80
	void StopMusicTrack(struct UAkAudioEvent* StartEvent, struct UAkAudioEvent* StopEvent, bool bResumeLevelMusic); // Function OPP.RBBlueprintLibrary.StopMusicTrack // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d24838
	void StopLoopingSoundOnActor(struct UAkAudioEvent* StartAkEvent, struct UAkAudioEvent* StopAkEvent, struct UObject* Actor); // Function OPP.RBBlueprintLibrary.StopLoopingSoundOnActor // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x1d246cc
	void StopAllTimersOnObject(struct UObject* timerOwner); // Function OPP.RBBlueprintLibrary.StopAllTimersOnObject // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d24444
	void StopAllMusic(); // Function OPP.RBBlueprintLibrary.StopAllMusic // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d2441c
	void StartPsychosisOnAllPlayers(struct URBHalluCfg_Psychosis* psychosisConfig, bool Force); // Function OPP.RBBlueprintLibrary.StartPsychosisOnAllPlayers // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d24368
	bool SortCompareString(struct FString stringA, struct FString stringB); // Function OPP.RBBlueprintLibrary.SortCompareString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d2425c
	bool SortCompareActorsByName(struct AActor* actorA, struct AActor* actorB); // Function OPP.RBBlueprintLibrary.SortCompareActorsByName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d24188
	struct TArray<struct UObject*> SortByName(struct TArray<struct UObject*> inObjects); // Function OPP.RBBlueprintLibrary.SortByName // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d24088
	void ShowObjectiveMessage(struct UObject* WorldContextObject, struct FText& Message, float duration, bool playSounds); // Function OPP.RBBlueprintLibrary.ShowObjectiveMessage // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d23f44
	void ShowInteractionMessageToAllPlayers(struct FText& Message, enum class EMessagePriority Priority, float duration); // Function OPP.RBBlueprintLibrary.ShowInteractionMessageToAllPlayers // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d23e34
	void ShowInteractionMessage(struct ARBPlayer* Player, struct FText& Message, enum class EMessagePriority Priority, float duration); // Function OPP.RBBlueprintLibrary.ShowInteractionMessage // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d23cd0
	void SetupMasterPose(struct USkeletalMeshComponent* MasterPoseComponent); // Function OPP.RBBlueprintLibrary.SetupMasterPose // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d23af8
	void SetNVBattery(struct ARBPlayer* Player, float Value); // Function OPP.RBBlueprintLibrary.SetNVBattery // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d23678
	void SetNetworkSyncState(struct AActor* Actor, bool bActive, bool bChain); // Function OPP.RBBlueprintLibrary.SetNetworkSyncState // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d23960
	void SetNarrativeMusicServer(struct FNarrativeSoundEventsInfo& NarrativeSoundEventsInfo, bool bPauseLevelMusic); // Function OPP.RBBlueprintLibrary.SetNarrativeMusicServer // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d23834
	void SetNarrativeMusicClient(struct FNarrativeSoundEventsInfo& NarrativeSoundEventsInfo, struct ARBPawn* Pawn); // Function OPP.RBBlueprintLibrary.SetNarrativeMusicClient // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d23730
	void SetListenAtPlayerLocation(struct UObject* requestOwner, bool bListenAtPlayerLocation); // Function OPP.RBBlueprintLibrary.SetListenAtPlayerLocation // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x1d235a0
	void SetLevelMusic(struct TArray<struct UAkAudioEvent*>& StartEvents, struct TArray<struct UAkAudioEvent*>& StopEvents); // Function OPP.RBBlueprintLibrary.SetLevelMusic // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d23488
	void SetHasPlayedTutorialMap(); // Function OPP.RBBlueprintLibrary.SetHasPlayedTutorialMap // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d23344
	void SetForceNoVolumetricLightmapsOnHierarchy(struct USceneComponent* SceneComponent, bool bForceNoVolumetricLightMap); // Function OPP.RBBlueprintLibrary.SetForceNoVolumetricLightmapsOnHierarchy // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d23220
	void SetCollisionEnabledOnHierarchy(struct USceneComponent* SceneComponent, enum class ECollisionEnabled NewType); // Function OPP.RBBlueprintLibrary.SetCollisionEnabledOnHierarchy // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d23100
	void SetCanStepUpon(struct USceneComponent* SceneComponent, enum class ECanBeCharacterBase canStepUponValue, bool bPropagateToChildren); // Function OPP.RBBlueprintLibrary.SetCanStepUpon // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d22fac
	void SetActorTemporarilyHiddenInEditor(struct AActor* TargetActor, bool bIsHidden); // Function OPP.RBBlueprintLibrary.SetActorTemporarilyHiddenInEditor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d22e24
	void Set3DWidgetEnabled(struct AActor* Actor, struct FName PropertyName, bool bWidgetEnabled); // Function OPP.RBBlueprintLibrary.Set3DWidgetEnabled // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d22d40
	void SelectInEditor(struct AActor* TargetActor); // Function OPP.RBBlueprintLibrary.SelectInEditor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d228d0
	void SelectComponentsInEditor(struct TArray<struct UActorComponent*>& Components, bool bClearSelection); // Function OPP.RBBlueprintLibrary.SelectComponentsInEditor // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d22c8c
	void SelectActorsInEditor(struct TArray<struct AActor*>& Actors, bool bClearSelection); // Function OPP.RBBlueprintLibrary.SelectActorsInEditor // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d22c8c
	void Select3DWidget(struct FString PropertyName, int32_t PropertyIndex, bool bIsPropertyTransform); // Function OPP.RBBlueprintLibrary.Select3DWidget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d22b94
	void SeekOnEvent(struct FString in_EventName, struct UAkComponent* in_pComponent, float in_fPercent, bool in_bSeekToNearestMarker); // Function OPP.RBBlueprintLibrary.SeekOnEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d22948
	void SaveProfile(); // Function OPP.RBBlueprintLibrary.SaveProfile // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d22934
	void RunConstructionScript(struct AActor* TargetActor); // Function OPP.RBBlueprintLibrary.RunConstructionScript // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d228d0
	void RemoveObjectiveIconForSpecificPlayer(struct ARBPlayer* Player, struct AActor* inActor); // Function OPP.RBBlueprintLibrary.RemoveObjectiveIconForSpecificPlayer // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d22794
	void RemoveObjectiveIcon(struct AActor* inActor); // Function OPP.RBBlueprintLibrary.RemoveObjectiveIcon // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d226e0
	struct TArray<struct AActor*> RandomizeActorArray(int32_t RandomizerId, struct TArray<struct AActor*>& inActors); // Function OPP.RBBlueprintLibrary.RandomizeActorArray // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d225ec
	void PrintScreenMessage(struct FString Message); // Function OPP.RBBlueprintLibrary.PrintScreenMessage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x161f0f8
	void PostAudioEventOnGroup_Client(struct UAkAudioEvent* akEvent, struct FName GroupName); // Function OPP.RBBlueprintLibrary.PostAudioEventOnGroup_Client // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x1d22470
	void PlaySingleShotMusicTrack(struct UAkAudioEvent* musicTrack, bool bPauseLevelMusic); // Function OPP.RBBlueprintLibrary.PlaySingleShotMusicTrack // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d221c0
	void PlayScareStinger(struct AActor* scareActor, struct UAkAudioEvent* StingerEvent, struct FVector& Location, float Distance); // Function OPP.RBBlueprintLibrary.PlayScareStinger // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d22080
	void PlayObjectiveNarrativeScreenAnimation(struct FNarrativeScreenAnimationData& animData, bool bPlayerDefaultIntro); // Function OPP.RBBlueprintLibrary.PlayObjectiveNarrativeScreenAnimation // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d21f8c
	void PlayMurkoffAnnouncement(struct FRBMurkoffAnnouncentData& announcementData, struct UAkAudioEvent* StopEvent, float stopDelay); // Function OPP.RBBlueprintLibrary.PlayMurkoffAnnouncement // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d21df4
	int32_t PlayLoopingSoundOnActor(struct UAkAudioEvent* StartAkEvent, struct UAkAudioEvent* StopAkEvent, struct UObject* Actor); // Function OPP.RBBlueprintLibrary.PlayLoopingSoundOnActor // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x1d21c2c
	void PlayLoopingMusicTrack(struct UAkAudioEvent* StartEvent, struct UAkAudioEvent* StopEvent, bool bStopLevelMusic); // Function OPP.RBBlueprintLibrary.PlayLoopingMusicTrack // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d218d4
	void PlayLobbyMurkoffAnnouncement(); // Function OPP.RBBlueprintLibrary.PlayLobbyMurkoffAnnouncement // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d218ac
	void PlayAnnouncerLine_Server(struct UAkAudioEvent* akEvent, enum class EVOBehavior voBehavior, float prePlayQueueDelay); // Function OPP.RBBlueprintLibrary.PlayAnnouncerLine_Server // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d21764
	float NormalizeRotationAngle(float& Current); // Function OPP.RBBlueprintLibrary.NormalizeRotationAngle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d2169c
	void MarkRenderStateDirty(struct UPrimitiveComponent* PrimitiveComponent); // Function OPP.RBBlueprintLibrary.MarkRenderStateDirty // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d21594
	void LogMovement(struct ARBPawn* Pawn, struct FString string); // Function OPP.RBBlueprintLibrary.LogMovement // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d214dc
	int32_t LevelRandomIntRange(int32_t RandomizerId, int32_t MinValue, int32_t MaxValue); // Function OPP.RBBlueprintLibrary.LevelRandomIntRange // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d213e8
	int32_t LevelRandomInt(int32_t RandomizerId, int32_t MaxValue); // Function OPP.RBBlueprintLibrary.LevelRandomInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d21328
	float LevelRandomFloatRange(int32_t RandomizerId, float MinValue, float MaxValue); // Function OPP.RBBlueprintLibrary.LevelRandomFloatRange // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d21230
	float LevelRandomFloat(int32_t RandomizerId); // Function OPP.RBBlueprintLibrary.LevelRandomFloat // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d211b0
	bool LevelRandomBool(int32_t RandomizerId); // Function OPP.RBBlueprintLibrary.LevelRandomBool // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d21134
	float LerpAngle(float angleA, float angleB, float Alpha); // Function OPP.RBBlueprintLibrary.LerpAngle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d21038
	bool IsWorldPopulated(); // Function OPP.RBBlueprintLibrary.IsWorldPopulated // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20ff4
	bool IsWaitingToStart(); // Function OPP.RBBlueprintLibrary.IsWaitingToStart // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20fc0
	bool IsValidNPCForAuraVariator(struct ARBNPC* RBNPC); // Function OPP.RBBlueprintLibrary.IsValidNPCForAuraVariator // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20f40
	bool IsValid(struct FUniqueNetIdRepl& UniqueId); // Function OPP.RBBlueprintLibrary.IsValid // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d20e98
	bool IsUniqueVariatorTypeActive(enum class EUniqueVariatorType Type); // Function OPP.RBBlueprintLibrary.IsUniqueVariatorTypeActive // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20e18
	bool IsTransient(struct AActor* TargetActor); // Function OPP.RBBlueprintLibrary.IsTransient // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d20504
	bool IsTransactional(struct AActor* TargetActor); // Function OPP.RBBlueprintLibrary.IsTransactional // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d20504
	bool IsStageStarted(); // Function OPP.RBBlueprintLibrary.IsStageStarted // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20de0
	bool IsStageReady(); // Function OPP.RBBlueprintLibrary.IsStageReady // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20da0
	bool IsStagePrepared(); // Function OPP.RBBlueprintLibrary.IsStagePrepared // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20d5c
	bool IsStageIDValid(struct FRBStageID& StageID); // Function OPP.RBBlueprintLibrary.IsStageIDValid // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d20cc4
	bool IsStageIDEqual(struct FRBStageID& stageID1, struct FRBStageID& stageID2); // Function OPP.RBBlueprintLibrary.IsStageIDEqual // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d20bbc
	bool IsRunningFunctionalTests(); // Function OPP.RBBlueprintLibrary.IsRunningFunctionalTests // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20b98
	bool IsRecentServerEvent(float Time, float maxDelay); // Function OPP.RBBlueprintLibrary.IsRecentServerEvent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20ad4
	bool IsRecentEvent(float Time, float maxDelay); // Function OPP.RBBlueprintLibrary.IsRecentEvent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20a10
	bool IsPropertyWidgetSelected(struct AActor* inActor, struct FString InWidgetName, int32_t& outWidgetIndex); // Function OPP.RBBlueprintLibrary.IsPropertyWidgetSelected // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d20908
	bool IsPlayInEditor(struct UObject* WorldContextObject); // Function OPP.RBBlueprintLibrary.IsPlayInEditor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d20888
	bool IsMissionIDValid(struct FRBMissionID& MissionID); // Function OPP.RBBlueprintLibrary.IsMissionIDValid // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d207c8
	bool IsMissionIDEqual(struct FRBMissionID& missionID1, struct FRBMissionID& missionID2); // Function OPP.RBBlueprintLibrary.IsMissionIDEqual // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d206c8
	bool IsInTutorialStage(); // Function OPP.RBBlueprintLibrary.IsInTutorialStage // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d206a4
	bool IsInReagentReleaseTrial(); // Function OPP.RBBlueprintLibrary.IsInReagentReleaseTrial // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20680
	bool IsInPIE(struct UObject* WorldContextObject); // Function OPP.RBBlueprintLibrary.IsInPIE // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d205e8
	bool IsInEditorOrCommandlet(struct UObject* WorldContextObject); // Function OPP.RBBlueprintLibrary.IsInEditorOrCommandlet // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d20570
	bool IsInEditor(struct UObject* WorldContextObject); // Function OPP.RBBlueprintLibrary.IsInEditor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d20504
	bool IsInBlueprintEditor(struct UObject* WorldContextObject); // Function OPP.RBBlueprintLibrary.IsInBlueprintEditor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20504
	bool IsHiddenInEditor(struct AActor* inActor); // Function OPP.RBBlueprintLibrary.IsHiddenInEditor // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d20504
	bool IsExperimentStarted(); // Function OPP.RBBlueprintLibrary.IsExperimentStarted // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d204c0
	bool IsEqual(struct FUniqueNetIdRepl& uniqueID1, struct FUniqueNetIdRepl& uniqueID2); // Function OPP.RBBlueprintLibrary.IsEqual // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d203a0
	bool IsDifficultyLessThan(enum class EGameDifficulty Difficulty); // Function OPP.RBBlueprintLibrary.IsDifficultyLessThan // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d2031c
	bool IsDifficultyGreaterThan(enum class EGameDifficulty Difficulty); // Function OPP.RBBlueprintLibrary.IsDifficultyGreaterThan // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20298
	bool IsDifficultyEqualTo(enum class EGameDifficulty Difficulty); // Function OPP.RBBlueprintLibrary.IsDifficultyEqualTo // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20214
	bool IsDifficultyEqualOrLessThan(enum class EGameDifficulty Difficulty); // Function OPP.RBBlueprintLibrary.IsDifficultyEqualOrLessThan // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d20190
	bool IsDifficultyEqualOrGreaterThan(enum class EGameDifficulty Difficulty); // Function OPP.RBBlueprintLibrary.IsDifficultyEqualOrGreaterThan // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d2010c
	bool IsConsideredSoloGame(); // Function OPP.RBBlueprintLibrary.IsConsideredSoloGame // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d200e8
	bool IsClient(); // Function OPP.RBBlueprintLibrary.IsClient // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d200a8
	bool IsAxisMappingValid(struct FInputAxisKeyMapping& keyMapping); // Function OPP.RBBlueprintLibrary.IsAxisMappingValid // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1ffe8
	bool IsActionMappingValid(struct FInputActionKeyMapping& keyMapping); // Function OPP.RBBlueprintLibrary.IsActionMappingValid // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1ff24
	void HideInteractionMessageForAllPlayers(); // Function OPP.RBBlueprintLibrary.HideInteractionMessageForAllPlayers // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d1ff10
	void HideInteractionMessage(struct ARBPlayer* Player); // Function OPP.RBBlueprintLibrary.HideInteractionMessage // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d1fe7c
	bool HasPlayedTutorialMap(); // Function OPP.RBBlueprintLibrary.HasPlayedTutorialMap // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1fd8c
	struct FString HashString(struct FString string); // Function OPP.RBBlueprintLibrary.HashString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1fdc8
	bool HasActorBegunPlay(struct AActor* Actor); // Function OPP.RBBlueprintLibrary.HasActorBegunPlay // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1fd00
	void GetWorldTransformMatrixFromGhostAnimationAnchorByTransform(struct URBGhostAnimInstance* ghostAnimClass, struct FTransform& inTransformReference, struct FTransform& OutTransform); // Function OPP.RBBlueprintLibrary.GetWorldTransformMatrixFromGhostAnimationAnchorByTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1fb5c
	void GetWorldTransformMatrixFromAnimationAnchorByTransformInMeshSpace(struct ARBPawn* Pawn, struct UAnimSequence* Sequence, struct FTransform& inTransformReference, bool bSnapToGround, struct FTransform& OutTransform, struct UObject* snapToGroundRequester); // Function OPP.RBBlueprintLibrary.GetWorldTransformMatrixFromAnimationAnchorByTransformInMeshSpace // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1f8fc
	void GetWorldTransformMatrixFromAnimationAnchorByTransform(struct ARBPawn* Pawn, struct UAnimSequence* Sequence, struct FTransform& inTransformReference, bool bSnapToGround, struct FTransform& OutTransform, struct UObject* snapToGroundRequester); // Function OPP.RBBlueprintLibrary.GetWorldTransformMatrixFromAnimationAnchorByTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1f69c
	void GetWorldTransformMatrixForBoneAtTimeRelativeToTransform(struct UAnimSequence* Sequence, struct FName BoneName, float evalTime, struct FTransform& inTransformReference, struct FTransform& OutTransform); // Function OPP.RBBlueprintLibrary.GetWorldTransformMatrixForBoneAtTimeRelativeToTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1f488
	void GetWorldTransformMatrixForBoneAtTheEndOfTheSequenceRelativeToTransform(struct UAnimSequence* Sequence, struct FName BoneName, struct FTransform& inTransformReference, struct FTransform& OutTransform); // Function OPP.RBBlueprintLibrary.GetWorldTransformMatrixForBoneAtTheEndOfTheSequenceRelativeToTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1f2b0
	void GetWorldTransformFromGhostAnimationAnchorByTransform(struct URBGhostAnimInstance* ghostAnimClass, struct FTransform& inTransformReference, struct FVector& OutLocation, struct FVector& outDirection); // Function OPP.RBBlueprintLibrary.GetWorldTransformFromGhostAnimationAnchorByTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1f110
	void GetWorldTransformFromAnimationAnchorByTransform(struct ARBPawn* Pawn, struct UAnimSequence* Sequence, struct FTransform& inTransformReference, bool bSnapToGround, struct FVector& OutLocation, struct FVector& outDirection, struct UObject* snapToGroundRequester); // Function OPP.RBBlueprintLibrary.GetWorldTransformFromAnimationAnchorByTransform // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1ee98
	void GetWorldTransformFromAnimationAnchor(struct ARBPawn* Pawn, struct UAnimSequence* Sequence, struct USceneComponent* inSceneComponent, bool bSnapToGround, struct FVector& OutLocation, struct FVector& outDirection, struct UObject* snapToGroundRequester); // Function OPP.RBBlueprintLibrary.GetWorldTransformFromAnimationAnchor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1ec5c
	struct ARBWorldSettings* GetWorldSettings(); // Function OPP.RBBlueprintLibrary.GetWorldSettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1ec38
	struct FTransform GetWorldAnchorTransformForGhostAnimation(struct URBGhostAnimInstance* ghostAnimClass, struct USceneComponent* inSceneComponent); // Function OPP.RBBlueprintLibrary.GetWorldAnchorTransformForGhostAnimation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1d1eb68
	struct FRotator GetViewRotation(struct UObject* WorldContextObject); // Function OPP.RBBlueprintLibrary.GetViewRotation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1ea9c
	void GetViewPoint(struct UObject* WorldContextObject, struct FVector& ViewLocation, struct FRotator& viewRotation); // Function OPP.RBBlueprintLibrary.GetViewPoint // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d1e94c
	struct FVector GetViewLocation(struct UObject* WorldContextObject); // Function OPP.RBBlueprintLibrary.GetViewLocation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1e880
	struct FVector GetViewForward(struct UObject* WorldContextObject); // Function OPP.RBBlueprintLibrary.GetViewForward // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1e7a8
	struct ARBVariatorManager* GetVariatorManager(); // Function OPP.RBBlueprintLibrary.GetVariatorManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e784
	struct URBCustomizationOption* GetValidCustomizationOption(struct FUICustomizationItem& Item); // Function OPP.RBBlueprintLibrary.GetValidCustomizationOption // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1e6f8
	bool GetUniqueVariatorTypeValue(enum class EUniqueVariatorType Type, struct FName& Name, float& OutValue); // Function OPP.RBBlueprintLibrary.GetUniqueVariatorTypeValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1e5ec
	struct TArray<struct UTexture*> GetTexturesFromMaterial(struct UMaterialInterface* Material); // Function OPP.RBBlueprintLibrary.GetTexturesFromMaterial // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e4fc
	struct URBTasksConfig* GetTasksConfig(); // Function OPP.RBBlueprintLibrary.GetTasksConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e4d8
	bool GetStaticMeshLODGenerateLightmapUVs(struct UStaticMesh* StaticMesh, int32_t LODIndex); // Function OPP.RBBlueprintLibrary.GetStaticMeshLODGenerateLightmapUVs // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e42c
	bool GetStaticMeshImportSettingsGenerateLightmapUVs(struct UStaticMesh* StaticMesh, int32_t LODIndex); // Function OPP.RBBlueprintLibrary.GetStaticMeshImportSettingsGenerateLightmapUVs // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e42c
	float GetStageTime(); // Function OPP.RBBlueprintLibrary.GetStageTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e404
	int32_t GetStageResetCount(); // Function OPP.RBBlueprintLibrary.GetStageResetCount // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e3c8
	struct URBStageInfo* GetStageInfo(struct FRBStageID& StageID); // Function OPP.RBBlueprintLibrary.GetStageInfo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1e330
	struct ARBSpectatorPawn* GetSpectatorPawn(); // Function OPP.RBBlueprintLibrary.GetSpectatorPawn // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e30c
	struct ARBPlayer* GetSpectatedPlayer(); // Function OPP.RBBlueprintLibrary.GetSpectatedPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e2e8
	float GetServerTime(); // Function OPP.RBBlueprintLibrary.GetServerTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e2c0
	struct URBScoringConfig* GetScoringConfig(); // Function OPP.RBBlueprintLibrary.GetScoringConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e29c
	float GetRoomPathedDistance(struct AActor* SourceActor, struct AActor* DestActor, bool& out_ValidPath, float MaxDistance, bool allowCoopRooms); // Function OPP.RBBlueprintLibrary.GetRoomPathedDistance // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1e110
	struct ARBRoom* GetRoomForActor(struct AActor* Actor); // Function OPP.RBBlueprintLibrary.GetRoomForActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1e090
	struct FTransform GetRefPoseBoneComponentSpace(struct USkeletalMeshComponent* SkelMesh, struct FName BoneName); // Function OPP.RBBlueprintLibrary.GetRefPoseBoneComponentSpace // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1df94
	struct URBWorld* GetRBWorld(); // Function OPP.RBBlueprintLibrary.GetRBWorld // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dd88
	struct ARBTaskManager* GetRBTaskManager(); // Function OPP.RBBlueprintLibrary.GetRBTaskManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dd64
	struct ARBStreaming* GetRBStreaming(); // Function OPP.RBBlueprintLibrary.GetRBStreaming // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dd40
	struct URBSettings_Gameplay* GetRBSettings_Gameplay(); // Function OPP.RBBlueprintLibrary.GetRBSettings_Gameplay // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dd10
	struct URBSettings_Anim* GetRBSettings_Anim(); // Function OPP.RBBlueprintLibrary.GetRBSettings_Anim // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dce0
	struct ARBPlayerLoadoutManager* GetRBPlayerLoadoutManager(); // Function OPP.RBBlueprintLibrary.GetRBPlayerLoadoutManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dcbc
	struct URBObjectiveManager* GetRBObjectiveManager(); // Function OPP.RBBlueprintLibrary.GetRBObjectiveManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dc98
	struct URBGameUserSettings* GetRBGameUserSettings(); // Function OPP.RBBlueprintLibrary.GetRBGameUserSettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dc44
	struct ARBGameStateLobby* GetRBGameStateLobby(); // Function OPP.RBBlueprintLibrary.GetRBGameStateLobby // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dc20
	struct ARBGameStateBase* GetRBGameStateBase(); // Function OPP.RBBlueprintLibrary.GetRBGameStateBase // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dbfc
	struct ARBGameState* GetRBGameState(); // Function OPP.RBBlueprintLibrary.GetRBGameState // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dbd8
	struct ARBGameModeMainMenu* GetRBGameModeMainMenu(); // Function OPP.RBBlueprintLibrary.GetRBGameModeMainMenu // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dbb4
	struct ARBGameModeLobby* GetRBGameModeLobby(); // Function OPP.RBBlueprintLibrary.GetRBGameModeLobby // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1db90
	struct ARBGameModeBase* GetRBGameModeBase(); // Function OPP.RBBlueprintLibrary.GetRBGameModeBase // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1db6c
	struct ARBGameMode* GetRBGameMode(); // Function OPP.RBBlueprintLibrary.GetRBGameMode // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1db48
	struct URBGameInstance* GetRBGameInstance(); // Function OPP.RBBlueprintLibrary.GetRBGameInstance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1db24
	int32_t GetRandomIndexForNPCCustomizationSlot(struct FGruntCustomizationMeshesConfig& customizationMeshesConfig, bool bFemale, enum class ENPCCustomizationSlot Slot, enum class ENPCFlavor flavor); // Function OPP.RBBlueprintLibrary.GetRandomIndexForNPCCustomizationSlot // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1ddac
	struct URBLocalProfile* GetProfile(); // Function OPP.RBBlueprintLibrary.GetProfile // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1db00
	struct ARBPostProcessUpdateManager* GetPostProcessUpdateManager(); // Function OPP.RBBlueprintLibrary.GetPostProcessUpdateManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1dac4
	struct URBPlayerStatsConfig* GetPlayerStatsConfig(); // Function OPP.RBBlueprintLibrary.GetPlayerStatsConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1daa0
	struct ARBPlayerState* GetPlayerStateByUniqueId(struct FUniqueNetIdRepl& UniqueId); // Function OPP.RBBlueprintLibrary.GetPlayerStateByUniqueId // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1d9f8
	struct ARBPlayerState* GetPlayerStateByPlayerId(struct FRBPlayerId& PlayerId); // Function OPP.RBBlueprintLibrary.GetPlayerStateByPlayerId // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1d960
	struct ARBPlayerState* GetPlayerStateByPlayer(struct ARBPlayer* Player); // Function OPP.RBBlueprintLibrary.GetPlayerStateByPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d8e0
	struct ARBPlayerProgressionManager* GetPlayerProgressionManager(); // Function OPP.RBBlueprintLibrary.GetPlayerProgressionManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d8bc
	struct URBPlayerProgressionData* GetPlayerProgressionData(struct ARBPlayerState* RBPlayerState); // Function OPP.RBBlueprintLibrary.GetPlayerProgressionData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d838
	struct URBPlayerLoadoutConfig* GetPlayerLoadoutConfig(); // Function OPP.RBBlueprintLibrary.GetPlayerLoadoutConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d814
	struct URBPlayerGameSessionManager* GetPlayerGameSessionManager(); // Function OPP.RBBlueprintLibrary.GetPlayerGameSessionManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d7f0
	struct URBPlayerCustomizationOption* GetPlayerCustomizationOptionForSlot(struct AActor* customizationOwner, enum class EPlayerCustomizationSlot Slot); // Function OPP.RBBlueprintLibrary.GetPlayerCustomizationOptionForSlot // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d6c8
	struct URBPlayerCustomizationConfig* GetPlayerCustomizationConfig(); // Function OPP.RBBlueprintLibrary.GetPlayerCustomizationConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d6a4
	struct URBPlayerCellCustomizationConfig* GetPlayerCellCustomizationConfig(); // Function OPP.RBBlueprintLibrary.GetPlayerCellCustomizationConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d680
	struct ARBPlayer* GetPlayerByUniqueId(struct FUniqueNetIdRepl& UniqueId); // Function OPP.RBBlueprintLibrary.GetPlayerByUniqueId // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1d5d8
	struct ARBPlayer* GetPlayerByPlayerId(struct FRBPlayerId& PlayerId); // Function OPP.RBBlueprintLibrary.GetPlayerByPlayerId // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1d540
	struct URBPawnCustomizationManager* GetPawnCustomizationManager(); // Function OPP.RBBlueprintLibrary.GetPawnCustomizationManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d51c
	int32_t GetNumberOfPlayer(); // Function OPP.RBBlueprintLibrary.GetNumberOfPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d4f8
	int32_t GetNumberOfAlivePlayer(); // Function OPP.RBBlueprintLibrary.GetNumberOfAlivePlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d4d4
	struct AActor* GetNewRandomActor(struct TArray<struct AActor*> actorList, struct AActor* currentActor); // Function OPP.RBBlueprintLibrary.GetNewRandomActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d3e4
	struct AActor* GetNarrator_ClientOnly(); // Function OPP.RBBlueprintLibrary.GetNarrator_ClientOnly // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d3c0
	struct URBMissionInfo* GetMissionInfo(struct FRBMissionID& MissionID); // Function OPP.RBBlueprintLibrary.GetMissionInfo // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1d328
	struct URBMenuManager* GetMenuManager(); // Function OPP.RBBlueprintLibrary.GetMenuManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d304
	struct ARBPlayerState* GetLocalPlayerState(); // Function OPP.RBBlueprintLibrary.GetLocalPlayerState // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d2e0
	struct URBPlayerProgressionData* GetLocalPlayerProgressionData(); // Function OPP.RBBlueprintLibrary.GetLocalPlayerProgressionData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d2bc
	struct ARBController* GetLocalPlayerController(); // Function OPP.RBBlueprintLibrary.GetLocalPlayerController // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d298
	struct ARBPlayer* GetLocalPawn(); // Function OPP.RBBlueprintLibrary.GetLocalPawn // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d274
	struct ARBMenuPlayerController* GetLocalMenuController(); // Function OPP.RBBlueprintLibrary.GetLocalMenuController // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d250
	struct ARBMainMenuPlayerController* GetLocalMainMenuPlayerController(); // Function OPP.RBBlueprintLibrary.GetLocalMainMenuPlayerController // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d22c
	struct ARBLobbyPlayerController* GetLocalLobbyPlayerController(); // Function OPP.RBBlueprintLibrary.GetLocalLobbyPlayerController // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1d208
	struct TArray<struct UActorComponent*> GetLoadedOnServerComponents(struct AActor* Actor); // Function OPP.RBBlueprintLibrary.GetLoadedOnServerComponents // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1d0c0
	struct FName GetKeyFName(struct FKey& Key); // Function OPP.RBBlueprintLibrary.GetKeyFName // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1cf7c
	int32_t GetIntValue(struct FConfigurableInt& ConfigurableInt); // Function OPP.RBBlueprintLibrary.GetIntValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1cedc
	struct FInputActionKeyMapping GetInputBinding(struct FName ActionName, int32_t Value, bool bForceGamepad, bool bForceKBM); // Function OPP.RBBlueprintLibrary.GetInputBinding // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1cd48
	struct URBHUDWidget* GetHUDWidget(); // Function OPP.RBBlueprintLibrary.GetHUDWidget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1cce8
	struct ARBHUD* GetHUD(); // Function OPP.RBBlueprintLibrary.GetHUD // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1ccc4
	struct ARBHallucinationManager* GetHallucinationManager(); // Function OPP.RBBlueprintLibrary.GetHallucinationManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1cd24
	struct URBGlobalUIConfig* GetGlobalUIConfig(); // Function OPP.RBBlueprintLibrary.GetGlobalUIConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1cca0
	struct URBGlobalAudioConfig* GetGlobalAudioConfig(); // Function OPP.RBBlueprintLibrary.GetGlobalAudioConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1cc7c
	struct FString GetGameVersionString(); // Function OPP.RBBlueprintLibrary.GetGameVersionString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1cc3c
	float GetGameTime(); // Function OPP.RBBlueprintLibrary.GetGameTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1cc14
	struct URBGameStructureConfig* GetGameStructureConfig(); // Function OPP.RBBlueprintLibrary.GetGameStructureConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1cbf0
	struct FRBGameStageInfo GetGameStageInfo(); // Function OPP.RBBlueprintLibrary.GetGameStageInfo // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1cbac
	enum class EGameDifficulty GetGameDifficulty(); // Function OPP.RBBlueprintLibrary.GetGameDifficulty // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1cb88
	struct URBFXManager* GetFXManager(); // Function OPP.RBBlueprintLibrary.GetFXManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c968
	struct FName GetFoleySwitchOverrideFromGruntCustomization(struct FSelectedGruntCustomizationMeshesInfo& selectedMeshInfo, struct FGruntCustomizationMeshesConfig& meshesConfig); // Function OPP.RBBlueprintLibrary.GetFoleySwitchOverrideFromGruntCustomization // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1ca74
	float GetFloatValue(struct FConfigurableFloat& ConfigurableFloat); // Function OPP.RBBlueprintLibrary.GetFloatValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1c9d4
	struct ARBBasePushable* GetFirstPushableCart(); // Function OPP.RBBlueprintLibrary.GetFirstPushableCart // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c98c
	float GetElapsedTime(float Time); // Function OPP.RBBlueprintLibrary.GetElapsedTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c8b8
	float GetElapsedServerTime(float Time); // Function OPP.RBBlueprintLibrary.GetElapsedServerTime // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c830
	enum class ESASVariatorType GetEffectiveSASVariatorType(); // Function OPP.RBBlueprintLibrary.GetEffectiveSASVariatorType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c80c
	int32_t GetEffectivePlayerCountForConfiguration(); // Function OPP.RBBlueprintLibrary.GetEffectivePlayerCountForConfiguration // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c7e8
	struct ARBWorldSettings* GetEditorWorldSettings(); // Function OPP.RBBlueprintLibrary.GetEditorWorldSettings // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c78c
	struct UObject* GetDefaultObject(struct UObject* Object); // Function OPP.RBBlueprintLibrary.GetDefaultObject // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1c6f8
	struct FNPCCustomizationMesh GetCustomizationMeshForGrunt(struct FGruntCustomizationMeshesConfig& customizationMeshesConfig, struct FSelectedGruntCustomizationMeshesInfo& customizationMeshesInfo, enum class ENPCCustomizationSlot Slot); // Function OPP.RBBlueprintLibrary.GetCustomizationMeshForGrunt // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1c538
	bool GetCurveValueFromAnimInstance(struct UAnimInstance* AnimInstance, struct FName& CurveName, float& out_value); // Function OPP.RBBlueprintLibrary.GetCurveValueFromAnimInstance // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1c42c
	float GetCurveValueForAnimation(struct UAnimSequence* Sequence, struct FName CurveName, float evalTime); // Function OPP.RBBlueprintLibrary.GetCurveValueForAnimation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1c29c
	struct ARBSAS* GetCurrentSAS(); // Function OPP.RBBlueprintLibrary.GetCurrentSAS // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c260
	struct FRBMissionID GetCurrentMissionID(); // Function OPP.RBBlueprintLibrary.GetCurrentMissionID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c208
	struct FVector GetCurrentEditorNormal(); // Function OPP.RBBlueprintLibrary.GetCurrentEditorNormal // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1d1c1e0
	struct ARBPlayer* GetControlledPlayer(); // Function OPP.RBBlueprintLibrary.GetControlledPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c1bc
	struct APawn* GetControlledPawn(); // Function OPP.RBBlueprintLibrary.GetControlledPawn // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1c18c
	struct UActorComponent* GetComponentFromSelector(struct FRBComponentSelector& componentSelector, struct AActor* Owner); // Function OPP.RBBlueprintLibrary.GetComponentFromSelector // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d1c0a0
	void GetComponentByClass(struct AActor* Actor, struct UActorComponent* classOf, struct TArray<struct UActorComponent*>& OutComponents); // Function OPP.RBBlueprintLibrary.GetComponentByClass // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d1bf88
	struct URBCollectibleDocumentsConfig* GetCollectibleDocumentsConfig(); // Function OPP.RBBlueprintLibrary.GetCollectibleDocumentsConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1bf64
	struct ARBPushCartGoalManager* GetClosestPushCartGoalManager(struct FVector& Position); // Function OPP.RBBlueprintLibrary.GetClosestPushCartGoalManager // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1bee0
	struct URBChunkInstallManager* GetChunkInstallManager(); // Function OPP.RBBlueprintLibrary.GetChunkInstallManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1bebc
	void GetChildComponentsByTag(struct USceneComponent* Component, struct FName ComponentTag, struct TArray<struct USceneComponent*>& OutComponents); // Function OPP.RBBlueprintLibrary.GetChildComponentsByTag // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d1bd24
	void GetChildComponentsByClass(struct USceneComponent* Component, struct USceneComponent* classOf, struct TArray<struct USceneComponent*>& OutComponents); // Function OPP.RBBlueprintLibrary.GetChildComponentsByClass // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d1bb68
	void GetChildComponentByTag(struct USceneComponent* Component, struct FName ComponentTag, struct USceneComponent*& outComponent); // Function OPP.RBBlueprintLibrary.GetChildComponentByTag // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d1ba08
	struct USceneComponent* GetChildComponentByClass(struct USceneComponent* Component, struct USceneComponent* classOf); // Function OPP.RBBlueprintLibrary.GetChildComponentByClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1b8c4
	bool GetBoolValue(struct FConfigurableBool& ConfigurableBool); // Function OPP.RBBlueprintLibrary.GetBoolValue // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1b7f4
	struct FTransform GetBoneTransformForAnimation(struct UAnimSequence* Sequence, struct FName BoneName, float evalTime); // Function OPP.RBBlueprintLibrary.GetBoneTransformForAnimation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1d1b688
	int32_t GetBinariesVersion(); // Function OPP.RBBlueprintLibrary.GetBinariesVersion // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1b5d0
	struct ARBPlayer* GetAnyPlayer(); // Function OPP.RBBlueprintLibrary.GetAnyPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1b578
	struct ARBPlayer* GetAnyAlivePlayer(); // Function OPP.RBBlueprintLibrary.GetAnyAlivePlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1b51c
	float GetAnimPlayLength(struct UAnimSequence* animSeqence); // Function OPP.RBBlueprintLibrary.GetAnimPlayLength // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1b494
	struct FTransform GetAnimBoneTransform(struct USkeletalMeshComponent* SkeletalMesh, struct UAnimSequence* AnimAsset, struct FName BoneName, float Time); // Function OPP.RBBlueprintLibrary.GetAnimBoneTransform // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1b29c
	struct FTransform GetAnchorTransformForInteraction(struct UAnimSequence* Sequence, struct USceneComponent* inSceneComponent); // Function OPP.RBBlueprintLibrary.GetAnchorTransformForInteraction // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1d1b1cc
	struct FTransform GetAnchorOffsetTransformFromGhostAnimation(struct URBGhostAnimInstance* ghostAnimClass); // Function OPP.RBBlueprintLibrary.GetAnchorOffsetTransformFromGhostAnimation // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1d1b130
	struct FTransform GetAnchorOffsetTransform(struct UAnimSequence* Sequence); // Function OPP.RBBlueprintLibrary.GetAnchorOffsetTransform // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1d1b094
	struct TArray<struct ARBBasePushable*> GetAllPushableCarts(); // Function OPP.RBBlueprintLibrary.GetAllPushableCarts // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1b028
	struct TArray<struct ARBPlayerState*> GetAllPlayerStates(); // Function OPP.RBBlueprintLibrary.GetAllPlayerStates // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1afb0
	struct TArray<struct AActor*> GetActorSelectedInEditor(); // Function OPP.RBBlueprintLibrary.GetActorSelectedInEditor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1af6c
	struct FActiveSkillCommonParams GetActiveSkillCommonParamsById(struct FName& ID); // Function OPP.RBBlueprintLibrary.GetActiveSkillCommonParamsById // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d1aebc
	struct FActiveSkillCommonParams GetActiveSkillCommonParams(enum class EActiveSkillType Type); // Function OPP.RBBlueprintLibrary.GetActiveSkillCommonParams // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1ae34
	struct ARBActiveSkill* GetActiveSkillClass(enum class EActiveSkillType Type); // Function OPP.RBBlueprintLibrary.GetActiveSkillClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1adb0
	struct URBAchievementsConfig* GetAchievementsConfig(); // Function OPP.RBBlueprintLibrary.GetAchievementsConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1ad8c
	struct FString GenerateRandomString(int32_t nbOfCharactersNeeded); // Function OPP.RBBlueprintLibrary.GenerateRandomString // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1acf8
	int32_t GenerateRandomSeedNonDeterministic(struct UObject* randomSeedObject); // Function OPP.RBBlueprintLibrary.GenerateRandomSeedNonDeterministic // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1ab60
	int32_t GenerateRandomSeed(struct UObject* randomSeedObject); // Function OPP.RBBlueprintLibrary.GenerateRandomSeed // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1a9cc
	struct FDateTime FromUnixTimestamp(int64_t Timestamp); // Function OPP.RBBlueprintLibrary.FromUnixTimestamp // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1a940
	struct FString FormatTimeFromInt(int32_t Seconds); // Function OPP.RBBlueprintLibrary.FormatTimeFromInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1a8a4
	struct FString FormatTimeFromFloat(float Seconds); // Function OPP.RBBlueprintLibrary.FormatTimeFromFloat // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d1a808
	void ForceSpecificClosetPlayerRespawnPoint(struct ARBMonsterCloset* closet); // Function OPP.RBBlueprintLibrary.ForceSpecificClosetPlayerRespawnPoint // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1a764
	void FlipRelativeLocation(struct USceneComponent* Component, bool bFlipX, bool bFlipY, bool bFlipZ); // Function OPP.RBBlueprintLibrary.FlipRelativeLocation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1a440
	struct FQuat FindQuatBetweenVectors(struct FVector& vec1, struct FVector& vec2); // Function OPP.RBBlueprintLibrary.FindQuatBetweenVectors // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1a35c
	bool FindCollisionUVFromHit(struct FHitResult& Hit, struct FVector2D& UV); // Function OPP.RBBlueprintLibrary.FindCollisionUVFromHit // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1d1a268
	struct UActorComponent* FindAssociatedComponent(struct USceneComponent* Component, struct UActorComponent* ComponentClass); // Function OPP.RBBlueprintLibrary.FindAssociatedComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d1a00c
	struct TArray<struct AActor*> FilterByRandomState(struct TArray<struct AActor*> inActors, bool bIsStateA); // Function OPP.RBBlueprintLibrary.FilterByRandomState // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d19ef4
	float EvalRuntimeFloatCurve(struct FRuntimeFloatCurve& Curve, float Time, float DefaultValue); // Function OPP.RBBlueprintLibrary.EvalRuntimeFloatCurve // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d19da0
	void Error(struct FString ErrorText); // Function OPP.RBBlueprintLibrary.Error // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d19ce0
	void EndCurrentStage(); // Function OPP.RBBlueprintLibrary.EndCurrentStage // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d19cb8
	void Editor_SelectActors(struct TArray<struct AActor*>& Actors); // Function OPP.RBBlueprintLibrary.Editor_SelectActors // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d19c08
	void Dispatch_StopCameraShake(bool bInstantly, struct UObject* shakeOwner, bool bIgnoreOwnerCondition); // Function OPP.RBBlueprintLibrary.Dispatch_StopCameraShake // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d19ac8
	void Dispatch_PostAudioEventOnIntercom(struct UAkAudioEvent* akEvent); // Function OPP.RBBlueprintLibrary.Dispatch_PostAudioEventOnIntercom // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d19a4c
	void Dispatch_PostAudioEventOnGroup(struct UAkAudioEvent* akEvent, struct FName GroupName); // Function OPP.RBBlueprintLibrary.Dispatch_PostAudioEventOnGroup // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d1998c
	void Dispatch_PostAssociatedAKEvent(struct UAkComponent* AkComponent); // Function OPP.RBBlueprintLibrary.Dispatch_PostAssociatedAKEvent // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d1991c
	void Dispatch_PostAkEventOnActor(struct AActor* Actor, struct UAkAudioEvent* akEvent); // Function OPP.RBBlueprintLibrary.Dispatch_PostAkEventOnActor // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d19868
	void Dispatch_PostAkEventGlobal(struct UAkAudioEvent* akEvent); // Function OPP.RBBlueprintLibrary.Dispatch_PostAkEventGlobal // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d197f8
	void Dispatch_PostAkEvent(struct UAkComponent* AkComponent, struct UAkAudioEvent* akEvent); // Function OPP.RBBlueprintLibrary.Dispatch_PostAkEvent // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d19744
	void Dispatch_PlayVOOnWatch(struct UAkAudioEvent* akEvent); // Function OPP.RBBlueprintLibrary.Dispatch_PlayVOOnWatch // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d196d4
	void Dispatch_PlayVOOnNarrator(struct UAkAudioEvent* akEvent, enum class EVOPriority VOPriority); // Function OPP.RBBlueprintLibrary.Dispatch_PlayVOOnNarrator // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d19620
	void Dispatch_PlayVOOnActor(struct UAkAudioEvent* akEvent, struct AActor* Owner, enum class EVOPriority VOPriority, bool bPlayOnPlayersWatch); // Function OPP.RBBlueprintLibrary.Dispatch_PlayVOOnActor // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d194b4
	void Dispatch_PlaySingleShotMusicTrack(struct UAkAudioEvent* musicTrack, struct ARBPlayer* Player, bool bPauseLevelMusic); // Function OPP.RBBlueprintLibrary.Dispatch_PlaySingleShotMusicTrack // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d193b8
	void Dispatch_ActivateVFX(struct AActor* Actor); // Function OPP.RBBlueprintLibrary.Dispatch_ActivateVFX // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d19348
	void Dispatch_ActivateCameraShake(struct FCameraShakeData shakeData, struct FVector sourceLocation, struct UObject* shakeOwner); // Function OPP.RBBlueprintLibrary.Dispatch_ActivateCameraShake // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1d19168
	void DisablePawnAnimOptims(struct ARBPawn* RBPawn, bool bDisableOptims); // Function OPP.RBBlueprintLibrary.DisablePawnAnimOptims // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d190b0
	void DestroyComponentHierarchy(struct USceneComponent* Component); // Function OPP.RBBlueprintLibrary.DestroyComponentHierarchy // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d18f90
	struct FString ConfigurableIntToString(struct FConfigurableInt& ConfigurableInt); // Function OPP.RBBlueprintLibrary.ConfigurableIntToString // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d18ed8
	struct FString ConfigurableFloatToString(struct FConfigurableFloat& ConfigurableFloat); // Function OPP.RBBlueprintLibrary.ConfigurableFloatToString // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d18e20
	struct FString ConfigurableBoolToString(struct FConfigurableBool& ConfigurableBool); // Function OPP.RBBlueprintLibrary.ConfigurableBoolToString // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d18d38
	void CompleteSingleObjective(struct ARBPawn* playerCompleting, struct AActor* objectiveActor); // Function OPP.RBBlueprintLibrary.CompleteSingleObjective // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d18c6c
	void ClientOnly_QueueVOOnActor(struct UAkAudioEvent* akEvent, struct AActor* Owner, enum class EVOPriority VOPriority, float prePlayDelay, int32_t forcedRandomSeed); // Function OPP.RBBlueprintLibrary.ClientOnly_QueueVOOnActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d18830
	void ClientOnly_PlayVOOnActor(struct UAkAudioEvent* akEvent, struct AActor* Owner, enum class EVOPriority VOPriority, int32_t forcedRandomSeed); // Function OPP.RBBlueprintLibrary.ClientOnly_PlayVOOnActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d17e1c
	bool CanNPCBeFemale(struct FGruntCustomizationMeshesConfig& customizationMeshesConfig, enum class ENPCFlavor flavor); // Function OPP.RBBlueprintLibrary.CanNPCBeFemale // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d17cf4
	bool CanEditLoadouts(); // Function OPP.RBBlueprintLibrary.CanEditLoadouts // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d17ca4
	bool CanActorCollisionOverlapInEditor(struct AActor* baseActor, struct AActor* actorToCheck); // Function OPP.RBBlueprintLibrary.CanActorCollisionOverlapInEditor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d17bf4
	bool BP_IsRayTracingEnabled(); // Function OPP.RBBlueprintLibrary.BP_IsRayTracingEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d178b8
	bool BP_IsIndicatorOfObjectiveType(enum class EPlayerIndicatorType indicatorType); // Function OPP.RBBlueprintLibrary.BP_IsIndicatorOfObjectiveType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d17810
	bool BP_IsIndicatorOfIncapacitatedType(enum class EPlayerIndicatorType indicatorType); // Function OPP.RBBlueprintLibrary.BP_IsIndicatorOfIncapacitatedType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d17790
	void BlockPlayerRespawnInStage(struct UObject* blockOwner); // Function OPP.RBBlueprintLibrary.BlockPlayerRespawnInStage // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d17b7c
	bool AreSameProfileIds(struct FProfileId& firstProfileId, struct FProfileId& secondProfileId); // Function OPP.RBBlueprintLibrary.AreSameProfileIds // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1d175f4
	bool AreCheatsEnabled(); // Function OPP.RBBlueprintLibrary.AreCheatsEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x150d484
	float Approach(float& Current, float& Target, float coeff, float DeltaTime); // Function OPP.RBBlueprintLibrary.Approach // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1d17488
	float AInterpTo(float Current, float Target, float DeltaTime, float InterpSpeed); // Function OPP.RBBlueprintLibrary.AInterpTo // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1d16ebc
	void AddRandomizeRelativeLocation(struct USceneComponent* Component, int32_t RandomSeed, float rangeXMin, float rangeXMax, float rangeYMin, float rangeYMax, float rangeZMin, float rangeZMax); // Function OPP.RBBlueprintLibrary.AddRandomizeRelativeLocation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1d17020
	void ActivateStageExitSAS(); // Function OPP.RBBlueprintLibrary.ActivateStageExitSAS // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1d16ff8
};

// Class OPP.RBBot
