// WidgetBlueprintGeneratedClass PhotoFinish.PhotoFinish_C
// Size: 0x980 (Inherited: 0x4d8)
struct UPhotoFinish_C : URBExperimentResultScreen {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4d8(0x08)
	struct UWidgetAnimation* Summary_PersonalRating; // 0x4e0(0x08)
	struct UWidgetAnimation* ShowDeathComment; // 0x4e8(0x08)
	struct UWidgetAnimation* ShowGroupRatingComment; // 0x4f0(0x08)
	struct UWidgetAnimation* LevelUp; // 0x4f8(0x08)
	struct UWidgetAnimation* Summary_Deaths; // 0x500(0x08)
	struct UWidgetAnimation* Summary_CompletionTime; // 0x508(0x08)
	struct UWidgetAnimation* Summary_GroupRating; // 0x510(0x08)
	struct UWidgetAnimation* Summary_State; // 0x518(0x08)
	struct UImage* Background_2; // 0x520(0x08)
	struct UImage* BackgroundImage; // 0x528(0x08)
	struct UImage* BackgroundImage_2; // 0x530(0x08)
	struct UImage* BackgroundImage_3; // 0x538(0x08)
	struct UImage* BackgroundImage_4; // 0x540(0x08)
	struct UTextBlock* BadgeNameText; // 0x548(0x08)
	struct UBadgeSashEntry_C* BadgeSashEntry; // 0x550(0x08)
	struct UBadgeSashEntry_C* BadgeSashEntry_2; // 0x558(0x08)
	struct UBadgeSashEntry_C* BadgeSashEntry_3; // 0x560(0x08)
	struct UBadgeSashEntry_C* BadgeSashEntry_4; // 0x568(0x08)
	struct UBadgeSashEntry_C* BadgeSashEntry_5; // 0x570(0x08)
	struct UBadgeSashEntry_C* BadgeSashEntry_6; // 0x578(0x08)
	struct UHorizontalBox* BadgesContainer; // 0x580(0x08)
	struct UOverlay* BadgesHeader; // 0x588(0x08)
	struct UScrollBox* BadgesScrollBox; // 0x590(0x08)
	struct UScaleBox* CommentScaleBox; // 0x598(0x08)
	struct UImage* DeathsArrow; // 0x5a0(0x08)
	struct UImage* DeathsCommentOverlay; // 0x5a8(0x08)
	struct UOverlay* FailedStamp; // 0x5b0(0x08)
	struct UTextBlock* GradeBox; // 0x5b8(0x08)
	struct UVerticalBox* GroupBox; // 0x5c0(0x08)
	struct UImage* GroupRatingArrow; // 0x5c8(0x08)
	struct UImage* GroupRatingCommentOverlay; // 0x5d0(0x08)
	struct UTextBlock* GroupRatingCommentText; // 0x5d8(0x08)
	struct UVerticalBox* GroupVBox; // 0x5e0(0x08)
	struct UActionIconWidget_C* leftTabButton; // 0x5e8(0x08)
	struct ULevelIndicatorWidget_C* LevelIndicatorWidget; // 0x5f0(0x08)
	struct ULocalPlayerInfo_v2_C* LocalPlayerInfo_v2; // 0x5f8(0x08)
	struct UInvalidationBox* MenuContent; // 0x600(0x08)
	struct UButton* NextBadgesButton; // 0x608(0x08)
	struct URBMenuButton_C* NextButton; // 0x610(0x08)
	struct UTextBlock* pagetitle; // 0x618(0x08)
	struct UTextBlock* PersonalRankText_2; // 0x620(0x08)
	struct UTextBlock* PersonalRankText_3; // 0x628(0x08)
	struct UScaleBox* PhotoFinishScreen; // 0x630(0x08)
	struct UButton* PreviousBadgesButton; // 0x638(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget; // 0x640(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_2; // 0x648(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_3; // 0x650(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_4; // 0x658(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_5; // 0x660(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_6; // 0x668(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_7; // 0x670(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_8; // 0x678(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_9; // 0x680(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_10; // 0x688(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_11; // 0x690(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_12; // 0x698(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_13; // 0x6a0(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_554; // 0x6a8(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget; // 0x6b0(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_2; // 0x6b8(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_3; // 0x6c0(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_4; // 0x6c8(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_5; // 0x6d0(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_6; // 0x6d8(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_7; // 0x6e0(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_8; // 0x6e8(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_9; // 0x6f0(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_10; // 0x6f8(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_11; // 0x700(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_12; // 0x708(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_13; // 0x710(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_14; // 0x718(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_15; // 0x720(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_16; // 0x728(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_17; // 0x730(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_18; // 0x738(0x08)
	struct URBCharacterSheetTabMenuButton_C* ProgressionButton; // 0x740(0x08)
	struct UTextBlock* RequiredXpText; // 0x748(0x08)
	struct UReturningToSleepRoomPendingWidget_C* ReturningToSleepRoomPendingWidget; // 0x750(0x08)
	struct URewardDetailLineEntry_C* RewardDetailLineEntry; // 0x758(0x08)
	struct URewardDetailLineEntry_C* RewardDetailLineEntry_2; // 0x760(0x08)
	struct URewardDetailLineEntry_C* RewardDetailLineEntry_3; // 0x768(0x08)
	struct URewardDetailLineEntry_C* RewardDetailLineEntry_4; // 0x770(0x08)
	struct UHorizontalBox* RewardHorizontalBox; // 0x778(0x08)
	struct UHorizontalBox* RewardHorizontalBox2; // 0x780(0x08)
	struct UOverlay* RewardsHeader; // 0x788(0x08)
	struct UTextBlock* RewardsHeaderText; // 0x790(0x08)
	struct UActionIconWidget_C* rightTabButton; // 0x798(0x08)
	struct URBCharacterSheetTabMenuButton_C* ScoreButton; // 0x7a0(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry; // 0x7a8(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_2; // 0x7b0(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_3; // 0x7b8(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_4; // 0x7c0(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_5; // 0x7c8(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_6; // 0x7d0(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_7; // 0x7d8(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_8; // 0x7e0(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_9; // 0x7e8(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_10; // 0x7f0(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_11; // 0x7f8(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_12; // 0x800(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_13; // 0x808(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_14; // 0x810(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_15; // 0x818(0x08)
	struct UScoreDetailLineEntry_C* ScoreDetailLineEntry_16; // 0x820(0x08)
	struct UVerticalBox* ScoreLines; // 0x828(0x08)
	struct UScorePlayerEntry_C* ScorePlayerEntry; // 0x830(0x08)
	struct UScorePlayerEntry_C* ScorePlayerEntry_2; // 0x838(0x08)
	struct UScorePlayerEntry_C* ScorePlayerEntry_3; // 0x840(0x08)
	struct UScorePlayerEntry_C* ScorePlayerEntry_4; // 0x848(0x08)
	struct URBCharacterSheetTabMenuButton_C* SummaryButtom; // 0x850(0x08)
	struct UVerticalBox* TabRewardsContent; // 0x858(0x08)
	struct UVerticalBox* TabScoreContent; // 0x860(0x08)
	struct UVerticalBox* TabSummaryContent; // 0x868(0x08)
	struct UTextBlock* Title; // 0x870(0x08)
	struct UTextBlock* TrialCompletionTimeText; // 0x878(0x08)
	struct UTextBlock* TrialCompletionTypeText; // 0x880(0x08)
	struct UTextBlock* TrialCompletionTypeText_2; // 0x888(0x08)
	struct UTextBlock* TrialDeathCountText; // 0x890(0x08)
	struct UTextBlock* TrialNameText; // 0x898(0x08)
	struct UTextBlock* TrialNameText_2; // 0x8a0(0x08)
	struct UTextBlock* TrialNameText_3; // 0x8a8(0x08)
	struct UTextBlock* TrialRankText; // 0x8b0(0x08)
	struct UVerticalBox* TrialRewardsVerticalBox; // 0x8b8(0x08)
	struct UTextBlock* TrialTypeText; // 0x8c0(0x08)
	struct UTextBlock* TrialTypeText_2; // 0x8c8(0x08)
	struct UTextBlock* TrialTypeText_3; // 0x8d0(0x08)
	struct UHorizontalBox* VariatorHBox; // 0x8d8(0x08)
	struct UHorizontalBox* VariatorHBox_2; // 0x8e0(0x08)
	struct UHorizontalBox* VariatorHBox_3; // 0x8e8(0x08)
	struct UXPProgressBar_C* XPProgressBar; // 0x8f0(0x08)
	struct AMenuCam_BP_C* MenuCam; // 0x8f8(0x08)
	bool bSetup; // 0x900(0x01)
	bool bInSummary; // 0x901(0x01)
	bool bInScore; // 0x902(0x01)
	bool bInProgression; // 0x903(0x01)
	bool bSeenScore; // 0x904(0x01)
	bool bSeenProgression; // 0x905(0x01)
	char pad_906[0x2]; // 0x906(0x02)
	int32_t ProgressionAnimationIndex; // 0x908(0x04)
	int32_t ProgressionLevelUpRewardIndex; // 0x90c(0x04)
	bool bPlayedMurkoffCommentAnimation; // 0x910(0x01)
	char pad_911[0x3]; // 0x911(0x03)
	int32_t ProgressionAnimationStartXp; // 0x914(0x04)
	int32_t ProgressionAnimationCurrentXp; // 0x918(0x04)
	int32_t ProgressionAnimationXpToGive; // 0x91c(0x04)
	int32_t ProgressionAnimationCurrentLevel; // 0x920(0x04)
	int32_t ProgressionAnimationXp; // 0x924(0x04)
	float CurrentAnimationDelta; // 0x928(0x04)
	float TimeUntilNextSummaryAnimation; // 0x92c(0x04)
	struct TArray<struct UWidgetAnimation*> SummaryAnimations; // 0x930(0x10)
	struct TArray<struct UScoreDetailLineEntry_C*> PendingScoreLines; // 0x940(0x10)
	float TimeUntilNextScoreAnimation; // 0x950(0x04)
	char pad_954[0x4]; // 0x954(0x04)
	struct TArray<struct UBadgeSashEntry_C*> PendingBadges; // 0x958(0x10)
	bool bPlayingScoreLinesSound; // 0x968(0x01)
	char pad_969[0x3]; // 0x969(0x03)
	float TimeUntilNextProgressionAnimation; // 0x96c(0x04)
	struct TArray<struct FRewardUIData> PendingRewards; // 0x970(0x10)

	void SetupMurkoffCommentScale(); // Function PhotoFinish.PhotoFinish_C.SetupMurkoffCommentScale // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void StopXpSound(); // Function PhotoFinish.PhotoFinish_C.StopXpSound // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void StartXpSound(); // Function PhotoFinish.PhotoFinish_C.StartXpSound // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void StopScoreLinesSound(); // Function PhotoFinish.PhotoFinish_C.StopScoreLinesSound // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void StartScoreLinesSound(); // Function PhotoFinish.PhotoFinish_C.StartScoreLinesSound // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void GetRewardWidget(struct FRewardUIData& RewardUIData, struct UProgramTrialRewardWidget_C*& rewardWidget, bool& bCreated); // Function PhotoFinish.PhotoFinish_C.GetRewardWidget // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void AddPendingReward(struct FRewardUIData& RewardUIData); // Function PhotoFinish.PhotoFinish_C.AddPendingReward // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct FEventReply OnFocusReceived(struct FGeometry MyGeometry, struct FFocusEvent InFocusEvent); // Function PhotoFinish.PhotoFinish_C.OnFocusReceived // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void SetupXpCounterDisplay(int32_t Level, int32_t Value); // Function PhotoFinish.PhotoFinish_C.SetupXpCounterDisplay // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void OnBadgeUnhovered(struct FRBPlayerBadgeRow badgeSettings); // Function PhotoFinish.PhotoFinish_C.OnBadgeUnhovered // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void OnBadgeHovered(struct FRBPlayerBadgeRow badgeSettings); // Function PhotoFinish.PhotoFinish_C.OnBadgeHovered // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void RefreshBadgeButtons(); // Function PhotoFinish.PhotoFinish_C.RefreshBadgeButtons // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void OnLevelUp(); // Function PhotoFinish.PhotoFinish_C.OnLevelUp // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void TryStartNextProgressionAnimation(); // Function PhotoFinish.PhotoFinish_C.TryStartNextProgressionAnimation // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowProgression(); // Function PhotoFinish.PhotoFinish_C.ShowProgression // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowScore(); // Function PhotoFinish.PhotoFinish_C.ShowScore // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowSummary(); // Function PhotoFinish.PhotoFinish_C.ShowSummary // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void RefreshActionButtons(); // Function PhotoFinish.PhotoFinish_C.RefreshActionButtons // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void SetupInitialLevelData(); // Function PhotoFinish.PhotoFinish_C.SetupInitialLevelData // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void SetupBadges(); // Function PhotoFinish.PhotoFinish_C.SetupBadges // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void SetupScoreLines(); // Function PhotoFinish.PhotoFinish_C.SetupScoreLines // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void SetupGroupDetails(); // Function PhotoFinish.PhotoFinish_C.SetupGroupDetails // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void SetupMurkoffComment(); // Function PhotoFinish.PhotoFinish_C.SetupMurkoffComment // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void SetupVariators(struct UHorizontalBox* targetHBox); // Function PhotoFinish.PhotoFinish_C.SetupVariators // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void Setup(); // Function PhotoFinish.PhotoFinish_C.Setup // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void Finished_B770552149C35E96E54C2788A8B201FC(); // Function PhotoFinish.PhotoFinish_C.Finished_B770552149C35E96E54C2788A8B201FC // (BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void Construct(); // Function PhotoFinish.PhotoFinish_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_StartAnimations(); // Function PhotoFinish.PhotoFinish_C.Event_StartAnimations // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_Refresh(); // Function PhotoFinish.PhotoFinish_C.Event_Refresh // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__LeaveButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature(struct URBMenuButton_C* Button); // Function PhotoFinish.PhotoFinish_C.BndEvt__LeaveButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void Event_OnFocusMenu(); // Function PhotoFinish.PhotoFinish_C.Event_OnFocusMenu // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void NextInputPressed(); // Function PhotoFinish.PhotoFinish_C.NextInputPressed // (BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void Destruct(); // Function PhotoFinish.PhotoFinish_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void PreConstruct(bool IsDesignTime); // Function PhotoFinish.PhotoFinish_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__PhotoFinish_SummaryButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature(struct URBMenuTabButton* Button); // Function PhotoFinish.PhotoFinish_C.BndEvt__PhotoFinish_SummaryButtom_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__PhotoFinish_ScoreButton_K2Node_ComponentBoundEvent_2_OnMenuTabButtonClicked__DelegateSignature(struct URBMenuTabButton* Button); // Function PhotoFinish.PhotoFinish_C.BndEvt__PhotoFinish_ScoreButton_K2Node_ComponentBoundEvent_2_OnMenuTabButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__PhotoFinish_ProgressionButton_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature(struct URBMenuTabButton* Button); // Function PhotoFinish.PhotoFinish_C.BndEvt__PhotoFinish_ProgressionButton_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void Event_MenuTabLeft_Released(); // Function PhotoFinish.PhotoFinish_C.Event_MenuTabLeft_Released // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_MenuTabRight_Released(); // Function PhotoFinish.PhotoFinish_C.Event_MenuTabRight_Released // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__PhotoFinish_PreviousPageButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(); // Function PhotoFinish.PhotoFinish_C.BndEvt__PhotoFinish_PreviousPageButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__PhotoFinish_NextBadgesButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function PhotoFinish.PhotoFinish_C.BndEvt__PhotoFinish_NextBadgesButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__PhotoFinish_BadgesScrollBox_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature(float CurrentOffset); // Function PhotoFinish.PhotoFinish_C.BndEvt__PhotoFinish_BadgesScrollBox_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function PhotoFinish.PhotoFinish_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void ExecuteUbergraph_PhotoFinish(int32_t EntryPoint); // Function PhotoFinish.PhotoFinish_C.ExecuteUbergraph_PhotoFinish // (Final|UbergraphFunction|HasDefaults) // @ game+0x201e6d4
};

