// AnimBlueprintGeneratedClass player_3P_AnimBP.player_3P_AnimBP_C
// Size: 0xc520 (Inherited: 0xfc0)
struct Uplayer_3P_AnimBP_C : URBAnimInstancePlayer3P {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xfc0(0x08)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0xfc8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x1010(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x1058(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x1118(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x1270(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x1330(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x1488(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x14b0(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x1530(0x158)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_4; // 0x1688(0xf8)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_3; // 0x1780(0xf8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x1878(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1980(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x19a0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x19c0(0x158)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1b18(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1b38(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x1bf8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1c20(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x1d78(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x1e38(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x1e60(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1ea8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x1f68(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x1fe8(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x2090(0xa8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_125; // 0x2138(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_124; // 0x2160(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x2188(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x2208(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x2288(0xa8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x2330(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x23f0(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x2418(0xc8)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_3; // 0x24e0(0xf0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x25d0(0xa8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x2678(0xc8)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2; // 0x2740(0xf0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x2830(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_78; // 0x2858(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x2888(0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x2930(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x2958(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x2980(0x190)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_77; // 0x2b10(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_16; // 0x2b40(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x2bf0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x2c18(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x2d70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x2d98(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x2dc0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x2e08(0x48)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh_3; // 0x2e50(0x1d8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x3028(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_123; // 0x3180(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_122; // 0x31a8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x31d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_76; // 0x3250(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x3280(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_75; // 0x32a8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0x32d8(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x3388(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_121; // 0x3428(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_120; // 0x3450(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119; // 0x3478(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118; // 0x34a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117; // 0x34c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116; // 0x34f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115; // 0x3518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114; // 0x3540(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113; // 0x3568(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112; // 0x3590(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111; // 0x35b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110; // 0x35e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109; // 0x3608(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108; // 0x3630(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107; // 0x3658(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106; // 0x3680(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105; // 0x36a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104; // 0x36d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103; // 0x36f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102; // 0x3720(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101; // 0x3748(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100; // 0x3770(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99; // 0x3798(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98; // 0x37c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97; // 0x37e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0x3810(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0x3838(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0x3860(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0x3888(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0x38b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0x38d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0x3900(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x3928(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x3950(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x3978(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x39a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x39c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x39f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x3a18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x3a40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x3a68(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x3a90(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_74; // 0x3b10(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x3b40(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_73; // 0x3bc0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x3bf0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_72; // 0x3c70(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x3ca0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_71; // 0x3d20(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x3d50(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_70; // 0x3dd0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x3e00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_69; // 0x3e80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x3eb0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_68; // 0x3f30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x3f60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_67; // 0x3fe0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x4010(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_66; // 0x4090(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x40c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x4140(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x41c0(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_65; // 0x4268(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x4298(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_64; // 0x4380(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x43b0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_63; // 0x43d8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x4408(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_62; // 0x44f0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0x4520(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_61; // 0x45d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x4600(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_60; // 0x4680(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x46b0(0xa8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x4758(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x4840(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_59; // 0x48c0(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x48f0(0xa8)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x4998(0xf0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x4a88(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_58; // 0x4ad8(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x4b08(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_57; // 0x4b58(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x4b88(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_56; // 0x4c08(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x4c38(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_55; // 0x4d20(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x4d50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x4d78(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x4da0(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_54; // 0x4df0(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x4e20(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_53; // 0x4e70(0x30)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x4ea0(0x18)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_52; // 0x4eb8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x4ee8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_51; // 0x4f98(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x4fc8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_50; // 0x4ff0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x5020(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x50d0(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x5228(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x5270(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x5298(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x52c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x52e8(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x5310(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x5330(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x5350(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x5530(0x1e0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x5710(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_49; // 0x5790(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x57c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x57e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x5810(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x5838(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x5860(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x5888(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x58b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x58d8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x5900(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x5980(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x5a28(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_48; // 0x5aa8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x5ad8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0x5b00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x5b30(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x5bb0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x5be0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x5c08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x5c30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x5c58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x5c80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x5ca8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x5cd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x5cf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x5d20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x5d48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x5d70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x5d98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x5dc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x5de8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x5e10(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x5e38(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x5eb8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x5f38(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x5fe0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x6010(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x6090(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x60c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x6140(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x6170(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x61f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x6220(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x62a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x62d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x6350(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x6380(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x6400(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x6430(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x64b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x64e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x6560(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x6590(0xa8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x6638(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x66f8(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x6778(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x67a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x6820(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x6850(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x68d0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x6900(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x69b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x69e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x6a60(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x6a90(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x6b40(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x6b70(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x6b98(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x6bc8(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x6c78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x6ca0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x6cc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x6cf0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x6d18(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x6d98(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x6e18(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x6ec0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x6ef0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x6f70(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x7018(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x7098(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x70c8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x70f0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x7120(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x71d0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x71f8(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x7350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x7378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x73a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x73c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x73f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x7418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x7440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x7468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x7490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x74b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x74e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x7508(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x7530(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x7618(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x7700(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x77e8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x7868(0xb8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x7920(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x7950(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x79d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x7a50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x7ad0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x7b50(0xb8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x7c08(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x7cf0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x7dd8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x7ec0(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x7fa8(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x8060(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x8118(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x81d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x8250(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x8280(0xa8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x8328(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x8410(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x84f8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x8528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x8550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x8578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x85a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x85c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x85f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x8618(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x8640(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x8668(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x8690(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x86b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x86e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x8708(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x8730(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x8758(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x8780(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x87a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x87d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x87f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x8820(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x8848(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x8870(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x8898(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x88c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x88e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x8910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x8938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x8960(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x8988(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x8a08(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x8ab0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x8b30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x8b60(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x8be0(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x8c88(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x8d08(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x8d38(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x8de8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x8e18(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x8e98(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x8ec8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x8f48(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x8f78(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x8fa0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x9020(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x9050(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x90d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x9100(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x9180(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x91b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x9230(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x9260(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x92e0(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x9388(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x9408(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x9438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x9460(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x9488(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x9508(0xa8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x95b0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x9698(0xa8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x9740(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x9828(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x9858(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x9900(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x9980(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x9a00(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x9a30(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x9ae0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x9b10(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x9b90(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x9c38(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x9cb8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x9ce8(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x9d90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x9e10(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x9e90(0xa8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x9f38(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xa020(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xa050(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xa078(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0xa0a0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0xa188(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xa270(0xa8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xa318(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xa348(0x80)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0xa3c8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0xa418(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xa468(0xa8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xa510(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0xa5d8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xa610(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xa690(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0xa6c0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xa770(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0xa7a0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xa850(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xa880(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xa8a8(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0xa8d0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xa9b8(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0xaaa0(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xab68(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0xac30(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0xad18(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xae00(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xaee8(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xaf90(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xb038(0xa8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xb0e0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xb1c8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xb1f8(0xa8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xb2a0(0x80)
	struct FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0xb320(0x78)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0xb398(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xb3e8(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xb438(0xa8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xb4e0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xb5a8(0x80)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0xb628(0x38)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xb660(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xb690(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb740(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xb770(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xb820(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb850(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xb8d0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xb900(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xb9b0(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xb9e0(0x20)
	struct FAnimNode_RBRotateRelative AnimGraphNode_RBRotateRelative; // 0xba00(0xf8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xbaf8(0x28)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh_2; // 0xbb20(0x1d8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xbcf8(0xc0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK_2; // 0xbdb8(0xf8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xbeb0(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xbed0(0xa8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xbf78(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xbfa0(0x20)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0xbfc0(0xf8)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0xc0b8(0x1d8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xc290(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xc398(0x108)
	bool IsAFK; // 0xc4a0(0x01)
	char pad_C4A1[0x7]; // 0xc4a1(0x07)
	struct FTimerHandle IdleTimer; // 0xc4a8(0x08)
	bool IsShopping; // 0xc4b0(0x01)
	char pad_C4B1[0x3]; // 0xc4b1(0x03)
	int32_t AFKStyle; // 0xc4b4(0x04)
	float DelayedPeek; // 0xc4b8(0x04)
	float LookBlend; // 0xc4bc(0x04)
	struct TMap<enum class EItemType, struct UAnimSequenceBase*> ItemTypeStyle; // 0xc4c0(0x50)
	float PickUpBlend; // 0xc510(0x04)
	char pad_C514[0x4]; // 0xc514(0x04)
	struct UAnimSequenceBase* PickUpHand; // 0xc518(0x08)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function player_3P_AnimBP.player_3P_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void AnimNotify_IsGone(); // Function player_3P_AnimBP.player_3P_AnimBP_C.AnimNotify_IsGone // (BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void AnimNotify_IsIdle(); // Function player_3P_AnimBP.player_3P_AnimBP_C.AnimNotify_IsIdle // (BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void AnimNotify_IsBack(); // Function player_3P_AnimBP.player_3P_AnimBP_C.AnimNotify_IsBack // (BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function player_3P_AnimBP.player_3P_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
