// UserDefinedStruct TextBox.TextBox
// Size: 0x86 (Inherited: 0x00)
struct FTextBox {
	struct FText Text_44_BC2D0814482B1E1808D36A8F757E7FC1; // 0x00(0x18)
	struct FString String_45_D525E99446A95CBB25B53EAF689203B2; // 0x18(0x10)
	char pad_28[0x8]; // 0x28(0x08)
	struct FVector4 BorderRLTB_11_E8A4F54440B2BC9C35E31FBEA403A526; // 0x30(0x10)
	struct UFont* Font_6_9876006543FF6A9B6A90C5967F26F16B; // 0x40(0x08)
	float FontScale_29_A5EDC95248C49190EF6113A3D1B330E2; // 0x48(0x04)
	struct FLinearColor FontColor_28_87D486A246E4E3C9753F3CA1501E233F; // 0x4c(0x10)
	struct FLinearColor FontOutlineColor_35_A814854F48BF6BAB0B368DAB7534C37A; // 0x5c(0x10)
	struct FLinearColor FontShadowColor_33_620D06484C61E6871139059757FE0081; // 0x6c(0x10)
	float FontKerning_30_E2AEFB8B411F45E7C7DA29A6F6C798DF; // 0x7c(0x04)
	float LineSpace_22_84BB51A94153917E619F678A2B43D36F; // 0x80(0x04)
	bool CenterX_38_9ECC00C6408B6DEEC03A12A09EE69AB6; // 0x84(0x01)
	bool CenterY_39_C1AAF35F44D20A4C47A964BA8526A449; // 0x85(0x01)
};

