// UserDefinedStruct TextAnim_Struc.TextAnim_Struc
// Size: 0x4c (Inherited: 0x00)
struct FTextAnim_Struc {
	struct FText Text_3_063F560F4EADCF934DEC33A37F44E501; // 0x00(0x18)
	struct FString String_5_30DBFE2C4E02D227850CEE824AE48D77; // 0x18(0x10)
	float StartTime_17_D86BE86A44A2C1ED307A8E98803EB88E; // 0x28(0x04)
	float EndTime_18_571820434EF225AA662F568C0241EE8E; // 0x2c(0x04)
	float TextColor_10_76A316494A59234980A4CBB60DD0A6F6; // 0x30(0x04)
	float TEXTSIZE_13_78DD5D7E4357A8C07A8B7D801C43ED99; // 0x34(0x04)
	struct UTexture* TVImage_22_5C73FAD043C8052AF58A0D943BC98797; // 0x38(0x08)
	struct UAkAudioEvent* Sound_26_43B19AC9428E8CAA1C0D6C8E3F85511C; // 0x40(0x08)
	bool PlaySoundOnNarrator_36_D04AD0234716824F32CB509F6904C317; // 0x48(0x01)
	bool Noise_28_F30532F843A673D7A2A98590F24D0D17; // 0x49(0x01)
	bool Rorschard_30_FEAF14F04F2BA7CB7537CBAC30042E48; // 0x4a(0x01)
	bool MovieFlash_32_C8BC1C244A7D3BBF65223E85561AE8E1; // 0x4b(0x01)
};

