// WidgetBlueprintGeneratedClass TrialBoardTab.TrialBoardTab_C
// Size: 0x7f8 (Inherited: 0x3a8)
struct UTrialBoardTab_C : URBTrialBoardMenuTabWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3a8(0x08)
	struct UCanvasPanel* AddFriendCanvas; // 0x3b0(0x08)
	struct UAddFriendWidget_C* AddFriendWidget; // 0x3b8(0x08)
	struct UButton* ArrowDownButton; // 0x3c0(0x08)
	struct UImage* ArrowDownButtonIcon; // 0x3c8(0x08)
	struct UButton* ArrowUpButton; // 0x3d0(0x08)
	struct UImage* ArrowUpButtonIcon; // 0x3d8(0x08)
	struct UBorder* BackgroundBorder; // 0x3e0(0x08)
	struct URBCharacterSheetTabMenuButton_C* BlockedButton; // 0x3e8(0x08)
	struct UImage* BottomBorder; // 0x3f0(0x08)
	struct UImage* BottomBorder_3; // 0x3f8(0x08)
	struct UImage* BottomBorder_5; // 0x400(0x08)
	struct UImage* BottomBorder_6; // 0x408(0x08)
	struct UExperimentBoardActionButton_C* CancelBtn; // 0x410(0x08)
	struct UImage* ClipImage; // 0x418(0x08)
	struct UImage* DashedLine; // 0x420(0x08)
	struct UExperimentBoardActionButton_C* DummySelectTrialButton2; // 0x428(0x08)
	struct UPartyFindGroupSizeButton_C* DuoButton; // 0x430(0x08)
	struct UCanvasPanel* EntriesCanvas; // 0x438(0x08)
	struct UCanvasPanel* FindPartyCanvas; // 0x440(0x08)
	struct URBCharacterSheetTabMenuButton_C* FriendsButton; // 0x448(0x08)
	struct UExperimentBoardActionButton_C* GroupFinderBtn_2; // 0x450(0x08)
	struct UBorder* GroupFinderContainer; // 0x458(0x08)
	struct UExperimentBoardActionButton_C* GroupFinderStartBtn; // 0x460(0x08)
	struct UImage* Image; // 0x468(0x08)
	struct UImage* Image_2; // 0x470(0x08)
	struct UImage* Image_3; // 0x478(0x08)
	struct UImage* Image_4; // 0x480(0x08)
	struct UImage* Image_5; // 0x488(0x08)
	struct UImage* Image_6; // 0x490(0x08)
	struct UImage* Image_7; // 0x498(0x08)
	struct UImage* Image_8; // 0x4a0(0x08)
	struct UImage* Image_9; // 0x4a8(0x08)
	struct UImage* Image_10; // 0x4b0(0x08)
	struct UImage* Image_88; // 0x4b8(0x08)
	struct UImage* Image_113; // 0x4c0(0x08)
	struct UImage* Image_117; // 0x4c8(0x08)
	struct UImage* Image_764; // 0x4d0(0x08)
	struct UBorder* InnerBorder; // 0x4d8(0x08)
	struct UVerticalBox* InternalTrialsVBox; // 0x4e0(0x08)
	struct UActionIconWidget_C* leftTabButton; // 0x4e8(0x08)
	struct UBorder* LockedBorder; // 0x4f0(0x08)
	struct UTextBlock* LockedText; // 0x4f8(0x08)
	struct UImage* MainBackground; // 0x500(0x08)
	struct UImage* MainBackground_3; // 0x508(0x08)
	struct UImage* MainBackground_5; // 0x510(0x08)
	struct UImage* MainBackground_6; // 0x518(0x08)
	struct USizeBox* NumberSizeBox; // 0x520(0x08)
	struct UTextBlock* pagetitle; // 0x528(0x08)
	struct URBCharacterSheetTabMenuButton_C* PartyButton; // 0x530(0x08)
	struct UTextBlock* PlayerName; // 0x538(0x08)
	struct UImage* Poster; // 0x540(0x08)
	struct UButton* PosterButton; // 0x548(0x08)
	struct UTextBlock* PosterProgramName; // 0x550(0x08)
	struct UCanvasPanel* ProgramCanvas; // 0x558(0x08)
	struct UTextBlock* ProgramName; // 0x560(0x08)
	struct UImage* ProgramPoster; // 0x568(0x08)
	struct UProgramPosterCarrousel_C* ProgramPosterCarrousel; // 0x570(0x08)
	struct UCanvasPanel* ProgramSelectionCanvas; // 0x578(0x08)
	struct UTextBlock* ProgramSource; // 0x580(0x08)
	struct UTextBlock* ProgramTQText; // 0x588(0x08)
	struct UProgramTrialBlockWidget_C* ProgramTrialBlockWidget; // 0x590(0x08)
	struct UProgramTrialBlockWidget_C* ProgramTrialBlockWidget_2; // 0x598(0x08)
	struct UProgramTrialBlockWidget_C* ProgramTrialBlockWidget_3; // 0x5a0(0x08)
	struct UProgramTrialBlockWidget_C* ProgramTrialBlockWidget_4; // 0x5a8(0x08)
	struct UProgramTrialBlockWidget_C* ProgramTrialBlockWidget_79; // 0x5b0(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget; // 0x5b8(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_2; // 0x5c0(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_3; // 0x5c8(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_4; // 0x5d0(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_5; // 0x5d8(0x08)
	struct UProgramTrialRewardWidget_C* ProgramTrialRewardWidget_554; // 0x5e0(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_2; // 0x5e8(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_3; // 0x5f0(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_4; // 0x5f8(0x08)
	struct UProgramTrialVariatorWidget_C* ProgramTrialVariatorWidget_5; // 0x600(0x08)
	struct UPartyFindGroupSizeButton_C* QuadButton; // 0x608(0x08)
	struct UTextBlock* ReagentId; // 0x610(0x08)
	struct URBCharacterSheetTabMenuButton_C* RecentButton; // 0x618(0x08)
	struct UHorizontalBox* RewardHBox; // 0x620(0x08)
	struct UActionIconWidget_C* rightTabButton; // 0x628(0x08)
	struct UBorder* SelectAProgramBorder; // 0x630(0x08)
	struct UBorder* SelectAProgramBorderBackground; // 0x638(0x08)
	struct UTextBlock* SelectAProgramText; // 0x640(0x08)
	struct UTextBlock* SelectedTrialName; // 0x648(0x08)
	struct UImage* SelectionHover; // 0x650(0x08)
	struct UCanvasPanel* SelectionHoverPanel; // 0x658(0x08)
	struct UExperimentBoardActionButton_C* SelectTrialButton; // 0x660(0x08)
	struct UImage* Separator; // 0x668(0x08)
	struct UImage* Separator_2; // 0x670(0x08)
	struct UImage* SeparatorLineBottom; // 0x678(0x08)
	struct UImage* SeparatorLineBottom_2; // 0x680(0x08)
	struct UImage* SeparatorLineTop; // 0x688(0x08)
	struct UImage* SeparatorLineTop_2; // 0x690(0x08)
	struct UImage* SeparatorLineTop_3; // 0x698(0x08)
	struct UImage* SeparatorLineTop_4; // 0x6a0(0x08)
	struct URBCharacterSheetTabMenuButton_C* SleepRoomButton; // 0x6a8(0x08)
	struct UCanvasPanel* SocialCanvas; // 0x6b0(0x08)
	struct USocialMenu_Tab_Party_C* SocialMenu_Tab_Party; // 0x6b8(0x08)
	struct USocialMenu_Tab_Blocked_C* SocialMenuBlockedTab; // 0x6c0(0x08)
	struct USocialMenu_Tab_Friends_C* SocialMenuFriendsTab; // 0x6c8(0x08)
	struct USocialMenu_Tab_Recent_C* SocialMenuRecentTab; // 0x6d0(0x08)
	struct USocialMenu_Tab_SleepRoom_C* SocialMenuSleepRoomTab; // 0x6d8(0x08)
	struct UWidgetSwitcher* SocialWidgets; // 0x6e0(0x08)
	struct UExperimentBoardActionButton_C* StartBtn; // 0x6e8(0x08)
	struct UImage* TopBorder; // 0x6f0(0x08)
	struct UImage* TopBorder_3; // 0x6f8(0x08)
	struct UImage* TopBorder_5; // 0x700(0x08)
	struct UImage* TopBorder_6; // 0x708(0x08)
	struct UCanvasPanel* TrialBoardCanvas; // 0x710(0x08)
	struct UVerticalBox* TrialBoardDetailsVBox; // 0x718(0x08)
	struct UTextBlock* TrialBoardProgramName; // 0x720(0x08)
	struct UTextBlock* TrialBoardProgramSource; // 0x728(0x08)
	struct UImage* TrialBoardTrialArrow; // 0x730(0x08)
	struct UImage* TrialBoardTrialBackgroundImage; // 0x738(0x08)
	struct UTextBlock* TrialBoardTrialBlockNumberText; // 0x740(0x08)
	struct UTextBlock* TrialBoardTrialName; // 0x748(0x08)
	struct UTextBlock* TrialBoardTrialType; // 0x750(0x08)
	struct UTextBlock* TrialDescription; // 0x758(0x08)
	struct UImage* TrialImage; // 0x760(0x08)
	struct UScrollBox* TrialScrollBox; // 0x768(0x08)
	struct UVerticalBox* TrialsVBox; // 0x770(0x08)
	struct UPartyFindGroupSizeButton_C* TrioButton; // 0x778(0x08)
	struct UVariatorCountPreviewWidget_C* VariatorCountPreviewWidget; // 0x780(0x08)
	struct USizeBox* VariatorDescriptionSizeBox; // 0x788(0x08)
	struct UTextBlock* VariatorDetailsText; // 0x790(0x08)
	struct UHorizontalBox* VariatorHBox; // 0x798(0x08)
	struct UBorder* VariatorHeaderBorder; // 0x7a0(0x08)
	bool bInSocial; // 0x7a8(0x01)
	bool bInProgramSelection; // 0x7a9(0x01)
	bool bInProgram; // 0x7aa(0x01)
	bool bInGroupFinder; // 0x7ab(0x01)
	bool bPosterHovered; // 0x7ac(0x01)
	bool bInAddFriend; // 0x7ad(0x01)
	char pad_7AE[0x2]; // 0x7ae(0x02)
	struct TArray<struct UObject*> Trials; // 0x7b0(0x10)
	int32_t SelectedSocialTabIndex; // 0x7c0(0x04)
	struct FName DisplayedTrialId; // 0x7c4(0x08)
	int32_t LastFocusedSocialEntryPosition; // 0x7cc(0x04)
	int32_t DesiredGroupSize; // 0x7d0(0x04)
	char pad_7D4[0x4]; // 0x7d4(0x04)
	struct TArray<struct FRBProgramInfoRow> Programs; // 0x7d8(0x10)
	struct FName CurrentlyDisplayedProgramId; // 0x7e8(0x08)
	struct UProgramTrialVariatorWidget_C* CurrentDisplayedVariator; // 0x7f0(0x08)

	void ToggleGroupFinder(); // Function TrialBoardTab.TrialBoardTab_C.ToggleGroupFinder // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void OnAddAFriendButtonClicked(struct URBMenuButton_C* Button); // Function TrialBoardTab.TrialBoardTab_C.OnAddAFriendButtonClicked // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowAddAFriend(); // Function TrialBoardTab.TrialBoardTab_C.ShowAddAFriend // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct FText GetPageSubtitle(); // Function TrialBoardTab.TrialBoardTab_C.GetPageSubtitle // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x201e6d4
	void OnInputSourceChanged(bool bIsGamepad); // Function TrialBoardTab.TrialBoardTab_C.OnInputSourceChanged // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* GetFocusSelectTrialButton(); // Function TrialBoardTab.TrialBoardTab_C.GetFocusSelectTrialButton // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	struct UWidget* FocusNextVariator(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.FocusNextVariator // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* FocusPreviousVariator(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.FocusPreviousVariator // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void FocusFirstVariator(); // Function TrialBoardTab.TrialBoardTab_C.FocusFirstVariator // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* FocusNextTrial(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.FocusNextTrial // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* FocusPreviousTrial(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.FocusPreviousTrial // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void FocusInitialTrial(); // Function TrialBoardTab.TrialBoardTab_C.FocusInitialTrial // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	bool IsTrialListScrollButtonDownEnabled(); // Function TrialBoardTab.TrialBoardTab_C.IsTrialListScrollButtonDownEnabled // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	bool IsTrialListScrollButtonTopEnabled(); // Function TrialBoardTab.TrialBoardTab_C.IsTrialListScrollButtonTopEnabled // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	void GetTrialBlockNumber(struct FName TrialId, int32_t& BlockNumber); // Function TrialBoardTab.TrialBoardTab_C.GetTrialBlockNumber // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void OnTrialSelected(struct FName TrialId); // Function TrialBoardTab.TrialBoardTab_C.OnTrialSelected // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* GetTrioNavigation(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.GetTrioNavigation // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* GetQuadNavigation(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.GetQuadNavigation // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	enum class ESlateVisibility GetGroupFinderBtnVisibility(); // Function TrialBoardTab.TrialBoardTab_C.GetGroupFinderBtnVisibility // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	void UpdatedDesiredGroupSize(); // Function TrialBoardTab.TrialBoardTab_C.UpdatedDesiredGroupSize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowGroupFinder(); // Function TrialBoardTab.TrialBoardTab_C.ShowGroupFinder // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* GamepadNav_NavRightFromGroupFinderButton(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.GamepadNav_NavRightFromGroupFinderButton // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* GamepadNav_CycleTrialBoardSocialEntries(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.GamepadNav_CycleTrialBoardSocialEntries // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* GamepadNav_NavToTrialBoardSocialEntries(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.GamepadNav_NavToTrialBoardSocialEntries // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void SortTrialBoardSocialEntries(struct URBSocialMenuEntry* Entry); // Function TrialBoardTab.TrialBoardTab_C.SortTrialBoardSocialEntries // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct UWidget* GamepadNav_NavToMMButtons(enum class EUINavigation Navigation); // Function TrialBoardTab.TrialBoardTab_C.GamepadNav_NavToMMButtons // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct FEventReply OnFocusReceived(struct FGeometry MyGeometry, struct FFocusEvent InFocusEvent); // Function TrialBoardTab.TrialBoardTab_C.OnFocusReceived // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	enum class ESlateVisibility GetCancelButtonVisibility(); // Function TrialBoardTab.TrialBoardTab_C.GetCancelButtonVisibility // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	enum class ESlateVisibility GetStartButtonVisibility(); // Function TrialBoardTab.TrialBoardTab_C.GetStartButtonVisibility // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	void IsInTrialBoardPage(bool& bIntrialBoardPage); // Function TrialBoardTab.TrialBoardTab_C.IsInTrialBoardPage // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	struct UWidget* Get_PosterButton_ToolTipWidget_1(); // Function TrialBoardTab.TrialBoardTab_C.Get_PosterButton_ToolTipWidget_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	bool HandleMenuTabRight(); // Function TrialBoardTab.TrialBoardTab_C.HandleMenuTabRight // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	bool HandleMenuTabLeft(); // Function TrialBoardTab.TrialBoardTab_C.HandleMenuTabLeft // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void BuildProgramList(); // Function TrialBoardTab.TrialBoardTab_C.BuildProgramList // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	enum class ESlateVisibility GetTrialOptionsBtnVisibility(); // Function TrialBoardTab.TrialBoardTab_C.GetTrialOptionsBtnVisibility // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	void HideVariatorDetails(struct UProgramTrialVariatorWidget_C* Widget); // Function TrialBoardTab.TrialBoardTab_C.HideVariatorDetails // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowVariatorDetails(struct UProgramTrialVariatorWidget_C* Widget); // Function TrialBoardTab.TrialBoardTab_C.ShowVariatorDetails // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void AddProgramUnlockReward(struct FName TrialId); // Function TrialBoardTab.TrialBoardTab_C.AddProgramUnlockReward // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void BuildTrialRewards(struct FName RewardDataId, bool bPerfect, bool bAcquired); // Function TrialBoardTab.TrialBoardTab_C.BuildTrialRewards // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowTrialDetails(); // Function TrialBoardTab.TrialBoardTab_C.ShowTrialDetails // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowProgram(struct FName ProgramId); // Function TrialBoardTab.TrialBoardTab_C.ShowProgram // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowProgramSelection(); // Function TrialBoardTab.TrialBoardTab_C.ShowProgramSelection // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowTrialBoard(); // Function TrialBoardTab.TrialBoardTab_C.ShowTrialBoard // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ShowSocial(); // Function TrialBoardTab.TrialBoardTab_C.ShowSocial // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void RefreshCurrentTrialDetails(); // Function TrialBoardTab.TrialBoardTab_C.RefreshCurrentTrialDetails // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void Refresh(); // Function TrialBoardTab.TrialBoardTab_C.Refresh // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct FEventReply OnMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function TrialBoardTab.TrialBoardTab_C.OnMouseButtonDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void DeactivateCurrentSection(); // Function TrialBoardTab.TrialBoardTab_C.DeactivateCurrentSection // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void ActivateSocialTab(int32_t Index); // Function TrialBoardTab.TrialBoardTab_C.ActivateSocialTab // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	bool ShouldShowNavigation(); // Function TrialBoardTab.TrialBoardTab_C.ShouldShowNavigation // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x201e6d4
	bool ShouldShowPageTitle(); // Function TrialBoardTab.TrialBoardTab_C.ShouldShowPageTitle // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x201e6d4
	bool IsReadyToClose(); // Function TrialBoardTab.TrialBoardTab_C.IsReadyToClose // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x201e6d4
	void GetPageSpecificButtons(struct TArray<struct UUserWidget*>& outButtons); // Function TrialBoardTab.TrialBoardTab_C.GetPageSpecificButtons // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	struct FText GetPageTitle(); // Function TrialBoardTab.TrialBoardTab_C.GetPageTitle // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x201e6d4
	void PreConstruct(bool IsDesignTime); // Function TrialBoardTab.TrialBoardTab_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Construct(); // Function TrialBoardTab.TrialBoardTab_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_ChangeActiveSkill(); // Function TrialBoardTab.TrialBoardTab_C.Event_ChangeActiveSkill // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void OnBackRequested(); // Function TrialBoardTab.TrialBoardTab_C.OnBackRequested // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_FriendsButton_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature(struct URBMenuTabButton* Button); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_FriendsButton_K2Node_ComponentBoundEvent_0_OnMenuTabButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_SleepRoomButton_K2Node_ComponentBoundEvent_1_OnMenuTabButtonClicked__DelegateSignature(struct URBMenuTabButton* Button); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_SleepRoomButton_K2Node_ComponentBoundEvent_1_OnMenuTabButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_RecentButton_K2Node_ComponentBoundEvent_2_OnMenuTabButtonClicked__DelegateSignature(struct URBMenuTabButton* Button); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_RecentButton_K2Node_ComponentBoundEvent_2_OnMenuTabButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_BlockedButton_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature(struct URBMenuTabButton* Button); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_BlockedButton_K2Node_ComponentBoundEvent_3_OnMenuTabButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void Event_ShowOptions(); // Function TrialBoardTab.TrialBoardTab_C.Event_ShowOptions // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_Refresh(); // Function TrialBoardTab.TrialBoardTab_C.Event_Refresh // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_CancelBtn_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_CancelBtn_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_StartBtn_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_StartBtn_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_PosterButton_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_PosterButton_K2Node_ComponentBoundEvent_13_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_PosterButton_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_PosterButton_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_PosterButton_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_PosterButton_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void Event_AddEntry(struct URBSocialMenuEntry* Entry); // Function TrialBoardTab.TrialBoardTab_C.Event_AddEntry // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_RemoveEntry(struct URBSocialMenuEntry* Entry); // Function TrialBoardTab.TrialBoardTab_C.Event_RemoveEntry // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_SetEntryPosition(struct URBSocialMenuEntry* Entry, struct FVector2D& Position); // Function TrialBoardTab.TrialBoardTab_C.Event_SetEntryPosition // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_PartyButton_K2Node_ComponentBoundEvent_4_OnMenuTabButtonClicked__DelegateSignature(struct URBMenuTabButton* Button); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_PartyButton_K2Node_ComponentBoundEvent_4_OnMenuTabButtonClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_DuoButton_K2Node_ComponentBoundEvent_19_OnClicked__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_DuoButton_K2Node_ComponentBoundEvent_19_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_TrioButton_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_TrioButton_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_QuadButton_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_QuadButton_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_StartBtn_1_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_StartBtn_1_K2Node_ComponentBoundEvent_22_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_ProgramPosterCarrousel_K2Node_ComponentBoundEvent_12_OnPosterClicked__DelegateSignature(struct FName ProgramId); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_ProgramPosterCarrousel_K2Node_ComponentBoundEvent_12_OnPosterClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_SelectTrialButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_SelectTrialButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_ArrowUpButton_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_ArrowUpButton_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_ArrowDownButton_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_ArrowDownButton_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void Event_InputSourceChanged(bool bIsGamepad); // Function TrialBoardTab.TrialBoardTab_C.Event_InputSourceChanged // (Event|Public|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnTabSelected(); // Function TrialBoardTab.TrialBoardTab_C.Event_OnTabSelected // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void Event_OnTabUnselected(); // Function TrialBoardTab.TrialBoardTab_C.Event_OnTabUnselected // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_AddFriendWidget_K2Node_ComponentBoundEvent_8_OnBackRequested__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_AddFriendWidget_K2Node_ComponentBoundEvent_8_OnBackRequested__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void BndEvt__TrialBoardTab_GroupFinderBtn_1_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature(); // Function TrialBoardTab.TrialBoardTab_C.BndEvt__TrialBoardTab_GroupFinderBtn_1_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x201e6d4
	void ExecuteUbergraph_TrialBoardTab(int32_t EntryPoint); // Function TrialBoardTab.TrialBoardTab_C.ExecuteUbergraph_TrialBoardTab // (Final|UbergraphFunction|HasDefaults) // @ game+0x201e6d4
};

